


                                  relax repository checkout r21124
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'analysis_mq_cr72.py'
----------------------------------------------------------------------------------------------------
"""Script for CPMG relaxation dispersion curve fitting to the 'MQ CR72' model using Dr. Flemming Hansen's data from http://dx.doi.org/10.1021/jp074793o.

This is to test the nesting of the 'CR72' and 'MQ CR72' models.  The 'MQ CR72' results should be identical to the 'CR72' results but with dwH = 0.

To run:

$ ../../../../../relax --tee analysis_mq_cr72.log analysis_mq_cr72.py
"""


# Python module imports.
from os import sep

# relax module imports.
from auto_analyses.relax_disp import Relax_disp
from data_store import Relax_data_store; ds = Relax_data_store()
from pipe_control.mol_res_spin import return_spin
from status import Status; status = Status()


# Analysis variables.
#####################

# The dispersion models.
MODELS = ['R2eff', 'MQ CR72']

# The grid search size (the number of increments per dimension).
GRID_INC = 6

# The number of Monte Carlo simulations to be used for error analysis at the end of the analysis.
MC_NUM = 3



# Set up the data pipe.
#######################

# Create the data pipe.
pipe_name = 'base pipe'
pipe_bundle = 'relax_disp'
pipe.create(pipe_name=pipe_name, bundle=pipe_bundle, pipe_type='relax_disp')

# The path to the data files.
data_path = status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'Hansen'

# Load the sequence.
sequence.read('fake_sequence.in', dir=status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'Hansen', res_num_col=1, res_name_col=2)

# Name the spins so they can be matched to the assignments, and the isotope for field strength scaling.
spin.name(name='N')
spin.isotope(isotope='15N')

# The spectral data - spectrum ID, peak list file name, CPMG frequency (Hz), spectrometer frequency in Hertz.
data = [
    ['500_reference.in',    '500_MHz'+sep+'reference.in_sparky',           None,  500e6],
    ['500_66.667.in',       '500_MHz'+sep+'66.667.in_sparky',           66.6666,  500e6],
    ['500_133.33.in',       '500_MHz'+sep+'133.33.in_sparky',          133.3333,  500e6],
    ['500_133.33.in.bis',   '500_MHz'+sep+'133.33.in.bis_sparky',      133.3333,  500e6],
    ['500_200.in',          '500_MHz'+sep+'200.in_sparky',             200.0000,  500e6],
    ['500_266.67.in',       '500_MHz'+sep+'266.67.in_sparky',          266.6666,  500e6],
    ['500_333.33.in',       '500_MHz'+sep+'333.33.in_sparky',          333.3333,  500e6],
    ['500_400.in',          '500_MHz'+sep+'400.in_sparky',             400.0000,  500e6],
    ['500_466.67.in',       '500_MHz'+sep+'466.67.in_sparky',          466.6666,  500e6],
    ['500_533.33.in',       '500_MHz'+sep+'533.33.in_sparky',          533.3333,  500e6],
    ['500_533.33.in.bis',   '500_MHz'+sep+'533.33.in.bis_sparky',      533.3333,  500e6],
    ['500_600.in',          '500_MHz'+sep+'600.in_sparky',             600.0000,  500e6],
    ['500_666.67.in',       '500_MHz'+sep+'666.67.in_sparky',          666.6666,  500e6],
    ['500_733.33.in',       '500_MHz'+sep+'733.33.in_sparky',          733.3333,  500e6],
    ['500_800.in',          '500_MHz'+sep+'800.in_sparky',             800.0000,  500e6],
    ['500_866.67.in',       '500_MHz'+sep+'866.67.in_sparky',          866.6666,  500e6],
    ['500_933.33.in',       '500_MHz'+sep+'933.33.in_sparky',          933.3333,  500e6],
    ['500_933.33.in.bis',   '500_MHz'+sep+'933.33.in.bis_sparky',      933.3333,  500e6],
    ['500_1000.in',         '500_MHz'+sep+'1000.in_sparky',           1000.0000,  500e6],
    ['800_reference.in',    '800_MHz'+sep+'reference.in_sparky',           None,  800e6],
    ['800_66.667.in',       '800_MHz'+sep+'66.667.in_sparky',           66.6666,  800e6],
    ['800_133.33.in',       '800_MHz'+sep+'133.33.in_sparky',          133.3333,  800e6],
    ['800_133.33.in.bis',   '800_MHz'+sep+'133.33.in.bis_sparky',      133.3333,  800e6],
    ['800_200.in',          '800_MHz'+sep+'200.in_sparky',             200.0000,  800e6],
    ['800_266.67.in',       '800_MHz'+sep+'266.67.in_sparky',          266.6666,  800e6],
    ['800_333.33.in',       '800_MHz'+sep+'333.33.in_sparky',          333.3333,  800e6],
    ['800_400.in',          '800_MHz'+sep+'400.in_sparky',             400.0000,  800e6],
    ['800_466.67.in',       '800_MHz'+sep+'466.67.in_sparky',          466.6666,  800e6],
    ['800_533.33.in',       '800_MHz'+sep+'533.33.in_sparky',          533.3333,  800e6],
    ['800_533.33.in.bis',   '800_MHz'+sep+'533.33.in.bis_sparky',      533.3333,  800e6],
    ['800_600.in',          '800_MHz'+sep+'600.in_sparky',             600.0000,  800e6],
    ['800_666.67.in',       '800_MHz'+sep+'666.67.in_sparky',          666.6666,  800e6],
    ['800_733.33.in',       '800_MHz'+sep+'733.33.in_sparky',          733.3333,  800e6],
    ['800_800.in',          '800_MHz'+sep+'800.in_sparky',             800.0000,  800e6],
    ['800_866.67.in',       '800_MHz'+sep+'866.67.in_sparky',          866.6666,  800e6],
    ['800_933.33.in',       '800_MHz'+sep+'933.33.in_sparky',          933.3333,  800e6],
    ['800_933.33.in.bis',   '800_MHz'+sep+'933.33.in.bis_sparky',      933.3333,  800e6],
    ['800_1000.in',         '800_MHz'+sep+'1000.in_sparky',           1000.0000,  800e6]
]

# Loop over the spectra.
for id, file, cpmg_frq, H_frq in data:
    # Load the peak intensities.
    spectrum.read_intensities(file=file, dir=data_path, spectrum_id=id, int_method='height')

    # Set the relaxation dispersion experiment type.
    relax_disp.exp_type(spectrum_id=id, exp_type='MQ CPMG')

    # Set the relaxation dispersion CPMG frequencies.
    relax_disp.cpmg_frq(spectrum_id=id, cpmg_frq=cpmg_frq)

    # Set the NMR field strength of the spectrum.
    spectrometer.frequency(id=id, frq=H_frq)

    # Relaxation dispersion CPMG constant time delay T (in s).
    relax_disp.relax_time(spectrum_id=id, time=0.030)

# Specify the duplicated spectra.
spectrum.replicated(spectrum_ids=['500_133.33.in', '500_133.33.in.bis'])
spectrum.replicated(spectrum_ids=['500_533.33.in', '500_533.33.in.bis'])
spectrum.replicated(spectrum_ids=['500_933.33.in', '500_933.33.in.bis'])
spectrum.replicated(spectrum_ids=['800_133.33.in', '800_133.33.in.bis'])
spectrum.replicated(spectrum_ids=['800_533.33.in', '800_533.33.in.bis'])
spectrum.replicated(spectrum_ids=['800_933.33.in', '800_933.33.in.bis'])

# Peak intensity error analysis.
spectrum.error_analysis(subset=['500_reference.in', '500_66.667.in', '500_133.33.in', '500_133.33.in.bis', '500_200.in', '500_266.67.in', '500_333.33.in', '500_400.in', '500_466.67.in', '500_533.33.in', '500_533.33.in.bis', '500_600.in', '500_666.67.in', '500_733.33.in', '500_800.in', '500_866.67.in', '500_933.33.in', '500_933.33.in.bis', '500_1000.in'])
spectrum.error_analysis(subset=['800_reference.in', '800_66.667.in', '800_133.33.in', '800_133.33.in.bis', '800_200.in', '800_266.67.in', '800_333.33.in', '800_400.in', '800_466.67.in', '800_533.33.in', '800_533.33.in.bis', '800_600.in', '800_666.67.in', '800_733.33.in', '800_800.in', '800_866.67.in', '800_933.33.in', '800_933.33.in.bis', '800_1000.in'])

# Deselect unresolved spins.
deselect.read(file='unresolved', dir=data_path+sep+'500_MHz', res_num_col=1)
deselect.read(file='unresolved', dir=data_path+sep+'800_MHz', res_num_col=1)

# Select just spins :70@N and :71@N.
select.spin(":70-71", change_all=True)



# Auto-analysis execution (manually and partly replicated).
###########################################################

# Do not change!
#Relax_disp(pipe_name=pipe_name, pipe_bundle=pipe_bundle, models=MODELS, grid_inc=GRID_INC, mc_sim_num=MC_NUM)

# The 'R2eff' model.
model = MODELS[0]
pipe.copy(pipe_from='base pipe', pipe_to=model, bundle_to='relax_disp')
pipe.switch(pipe_name=model)
relax_disp.select_model(model='R2eff')
calc(verbosity=1)

# The 'MQ CR72' model.
######################

model = MODELS[1]
pipe.copy(pipe_from='base pipe', pipe_to=model, bundle_to='relax_disp')
pipe.switch(pipe_name=model)
relax_disp.select_model(model=model)
value.copy(pipe_from='R2eff', pipe_to=model, param='r2eff')

# Alias the spins.
spin70 = return_spin(":70")
spin71 = return_spin(":71")

# Set the initial parameter values (from the CR72 model).
spin70.r2 = [7.011, 9.465]
spin70.pA = 0.990
spin70.dw = 5.577
spin70.kex = 1765.993
spin70.chi2 = 18.450
spin71.r2 = [4.978, 10.0]
spin71.pA = 0.997
spin71.dw = 4.460
spin71.kex = 1879.584
spin71.chi2 = 1.379

# Optimisation.
#grid_search(lower=None, upper=None, inc=6, constraints=True, verbosity=1)
minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)
spin70.dwH = 0.0
spin71.dwH = 0.0
minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)

# Results output.
results_dir = data_path + sep + model
relax_disp.plot_disp_curves(dir=results_dir, force=True)
value.write(param='pA', file='pA.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
value.write(param='pB', file='pB.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir=results_dir, force=True, norm=False)
grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir=results_dir, force=True, norm=False)
value.write(param='dw', file='dw.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir=results_dir, force=True, norm=False)
value.write(param='dwH', file='dwH.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
grace.write(x_data_type='res_num', y_data_type='dwH', spin_id=None, plot_data='value', file='dwH.agr', dir=results_dir, force=True, norm=False)
value.write(param='k_AB', file='k_AB.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
value.write(param='kex', file='kex.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
value.write(param='tex', file='tex.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir=results_dir, force=True, norm=False)
grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir=results_dir, force=True, norm=False)
grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir=results_dir, force=True, norm=False)
grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir=results_dir, force=True, norm=False)
results.write(file='results', dir=results_dir, compress_type=1, force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='base pipe', pipe_type='relax_disp', bundle='relax_disp')

relax> sequence.read(file='fake_sequence.in', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=2, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/fake_sequence.in' for reading.
# mol_name    res_num    res_name    spin_num    spin_name    
None          1          GLY         None        None         
None          2          GLY         None        None         
None          3          GLY         None        None         
None          4          GLY         None        None         
None          5          GLY         None        None         
None          6          GLY         None        None         
None          7          GLY         None        None         
None          8          GLY         None        None         
None          9          GLY         None        None         
None          10         GLY         None        None         
None          11         GLY         None        None         
None          12         GLY         None        None         
None          13         GLY         None        None         
None          14         GLY         None        None         
None          15         GLY         None        None         
None          16         GLY         None        None         
None          17         GLY         None        None         
None          18         GLY         None        None         
None          19         GLY         None        None         
None          20         GLY         None        None         
None          21         GLY         None        None         
None          22         GLY         None        None         
None          23         GLY         None        None         
None          24         GLY         None        None         
None          25         GLY         None        None         
None          26         GLY         None        None         
None          27         GLY         None        None         
None          28         GLY         None        None         
None          29         GLY         None        None         
None          30         GLY         None        None         
None          31         GLY         None        None         
None          32         GLY         None        None         
None          33         GLY         None        None         
None          34         GLY         None        None         
None          35         GLY         None        None         
None          36         GLY         None        None         
None          37         GLY         None        None         
None          38         GLY         None        None         
None          39         GLY         None        None         
None          40         GLY         None        None         
None          41         GLY         None        None         
None          42         GLY         None        None         
None          43         GLY         None        None         
None          44         GLY         None        None         
None          45         GLY         None        None         
None          46         GLY         None        None         
None          47         GLY         None        None         
None          48         GLY         None        None         
None          49         GLY         None        None         
None          50         GLY         None        None         
None          51         GLY         None        None         
None          52         GLY         None        None         
None          53         GLY         None        None         
None          54         GLY         None        None         
None          55         GLY         None        None         
None          56         GLY         None        None         
None          57         GLY         None        None         
None          58         GLY         None        None         
None          59         GLY         None        None         
None          60         GLY         None        None         
None          61         GLY         None        None         
None          62         GLY         None        None         
None          63         GLY         None        None         
None          64         GLY         None        None         
None          65         GLY         None        None         
None          66         GLY         None        None         
None          67         GLY         None        None         
None          68         GLY         None        None         
None          69         GLY         None        None         
None          70         GLY         None        None         
None          71         GLY         None        None         
None          72         GLY         None        None         
None          73         GLY         None        None         

relax> spin.name(name='N', spin_id=None, force=False)

relax> spin.isotope(isotope='15N', spin_id=None, force=False)

relax> spectrum.read_intensities(file='500_MHz/reference.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_reference.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/reference.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         19312.608    
:2@N         40148.897    
:3@N         40068.959    
:4@N         51701.544    
:5@N         29811.94     
:6@N         5990.5349    
:7@N         48753.25     
:8@N         38628.954    
:10@N        36604.809    
:11@N        50984.946    
:12@N        40394.627    
:13@N        46505.888    
:14@N        42325.073    
:15@N        34883.499    
:16@N        44593.269    
:17@N        41805.531    
:18@N        39546.218    
:19@N        42535.101    
:20@N        33680.308    
:21@N        32571.258    
:22@N        41089.662    
:23@N        41548.982    
:24@N        28119.249    
:25@N        40710.101    
:26@N        32342.841    
:29@N        37797.18     
:31@N        38850.677    
:32@N        42320.977    
:33@N        42762.184    
:34@N        38715.5      
:35@N        35825.727    
:36@N        35094.871    
:37@N        40885.27     
:38@N        38635.076    
:39@N        44639.246    
:40@N        33650.055    
:41@N        38123.128    
:42@N        43478.12     
:43@N        42545.592    
:44@N        57807.407    
:45@N        32803.021    
:46@N        39211.095    
:47@N        39512.868    
:48@N        38979.349    
:49@N        45118.083    
:50@N        39622.685    
:51@N        39847.255    
:52@N        33648.739    
:53@N        29973.27     
:55@N        36640.166    
:56@N        40903.67     
:57@N        38805.298    
:58@N        44369.278    
:59@N        40469.072    
:60@N        39410.204    
:61@N        34241.94     
:62@N        46560.353    
:63@N        46670.542    
:64@N        34428.285    
:65@N        37634.449    
:66@N        46469.294    
:67@N        30469.201    
:70@N        25707.455    
:71@N        39274.345    
:72@N        27308.616    
:73@N        17387.446    

relax> relax_disp.exp_type(spectrum_id='500_reference.in', exp_type='MQ CPMG')
Setting the '500_reference.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_reference.in', cpmg_frq=None)
Setting the '500_reference.in' spectrum CPMG frequency None Hz.

relax> spectrometer.frequency(id='500_reference.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_reference.in', time=0.03)
Setting the '500_reference.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/66.667.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_66.667.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/66.667.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         9900.7022    
:2@N         35082.951    
:3@N         34698.901    
:4@N         49187.324    
:5@N         20351.238    
:6@N         5710.9091    
:7@N         47336.223    
:8@N         31282.912    
:10@N        30419.45     
:11@N        46452.533    
:12@N        34508.147    
:13@N        45737.759    
:14@N        34810.511    
:15@N        29116.56     
:16@N        40674.88     
:17@N        34723.441    
:18@N        32992.337    
:19@N        35791.189    
:20@N        27974.385    
:21@N        25031.944    
:22@N        34304.904    
:23@N        33311.504    
:24@N        23763.947    
:25@N        34387.713    
:26@N        23069.329    
:29@N        31328.299    
:31@N        31271.419    
:32@N        32851.455    
:33@N        34798.202    
:34@N        31112.133    
:35@N        29864.219    
:36@N        30235.206    
:37@N        33942.608    
:38@N        31757.892    
:39@N        34647.671    
:40@N        27645.398    
:41@N        30980.275    
:42@N        35928.316    
:43@N        35214.012    
:44@N        47662.762    
:45@N        26858.976    
:46@N        31922.752    
:47@N        32314.465    
:48@N        32037.09     
:49@N        40799.971    
:50@N        33009.785    
:51@N        32308.364    
:52@N        21254.47     
:53@N        23923.71     
:55@N        26356.81     
:56@N        35120.021    
:57@N        33094.377    
:58@N        37284.195    
:59@N        32795.126    
:60@N        31782.679    
:61@N        22312.18     
:62@N        40345.67     
:63@N        36246.49     
:64@N        23854.184    
:65@N        29709.057    
:66@N        41026.639    
:67@N        15402.599    
:70@N        15885.628    
:71@N        31792.844    
:72@N        15189.406    
:73@N        15887.294    

relax> relax_disp.exp_type(spectrum_id='500_66.667.in', exp_type='MQ CPMG')
Setting the '500_66.667.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_66.667.in', cpmg_frq=66.6666)
Setting the '500_66.667.in' spectrum CPMG frequency 66.6666 Hz.

relax> spectrometer.frequency(id='500_66.667.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_66.667.in', time=0.03)
Setting the '500_66.667.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/133.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_133.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/133.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         10761.746    
:2@N         35189.608    
:3@N         34386.782    
:4@N         49198.165    
:5@N         20658.284    
:6@N         5770.0454    
:7@N         47397.777    
:8@N         31539.594    
:10@N        30411.779    
:11@N        46551.977    
:12@N        34602.563    
:13@N        45555.624    
:14@N        34673.727    
:15@N        29082.064    
:16@N        40524.834    
:17@N        34674.498    
:18@N        32867.063    
:19@N        35725.976    
:20@N        27881.892    
:21@N        25271.765    
:22@N        34180.29     
:23@N        33711.569    
:24@N        23898.313    
:25@N        34467.956    
:26@N        23518.162    
:29@N        31480.986    
:31@N        31480.755    
:32@N        33305.656    
:33@N        34724.372    
:34@N        31186.862    
:35@N        29919.369    
:36@N        30288.367    
:37@N        33698.034    
:38@N        31698.505    
:39@N        34734.002    
:40@N        27647.328    
:41@N        31228.077    
:42@N        35868.98     
:43@N        35032.127    
:44@N        47280.704    
:45@N        26986.381    
:46@N        31716.724    
:47@N        32420.493    
:48@N        32150.538    
:49@N        41049.719    
:50@N        33248.614    
:51@N        32589.394    
:52@N        22159.391    
:53@N        24553.403    
:55@N        27185.427    
:56@N        35432.238    
:57@N        33135.283    
:58@N        37501.374    
:59@N        32863.949    
:60@N        31910.268    
:61@N        23045.149    
:62@N        40285.41     
:63@N        36900.213    
:64@N        24593.52     
:65@N        30107.657    
:66@N        41152.791    
:67@N        15388.144    
:70@N        16627.668    
:71@N        31972.777    
:72@N        15490.596    
:73@N        15466.502    

relax> relax_disp.exp_type(spectrum_id='500_133.33.in', exp_type='MQ CPMG')
Setting the '500_133.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_133.33.in', cpmg_frq=133.3333)
Setting the '500_133.33.in' spectrum CPMG frequency 133.3333 Hz.

relax> spectrometer.frequency(id='500_133.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_133.33.in', time=0.03)
Setting the '500_133.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/133.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_133.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/133.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         10237.749    
:2@N         35115.182    
:3@N         34483.566    
:4@N         49357.169    
:5@N         20858.677    
:6@N         5799.1615    
:7@N         47226.766    
:8@N         31616.322    
:10@N        30402.288    
:11@N        46563.217    
:12@N        34478.415    
:13@N        45699.013    
:14@N        34634.326    
:15@N        29270.708    
:16@N        40661.187    
:17@N        34832.147    
:18@N        33074.131    
:19@N        35694.532    
:20@N        27735.73     
:21@N        25312.011    
:22@N        34278.2      
:23@N        33696.919    
:24@N        23769.719    
:25@N        34478.802    
:26@N        23687.365    
:29@N        31553.164    
:31@N        31536.164    
:32@N        33141.571    
:33@N        34754.18     
:34@N        31526.214    
:35@N        29998.92     
:36@N        30661.446    
:37@N        34089.567    
:38@N        31611.156    
:39@N        34609.443    
:40@N        27502.562    
:41@N        31410.698    
:42@N        35821.846    
:43@N        34944.573    
:44@N        47517.543    
:45@N        26667.588    
:46@N        32116.166    
:47@N        32182.741    
:48@N        31991.169    
:49@N        40931.436    
:50@N        33075.9      
:51@N        32600.062    
:52@N        22125.916    
:53@N        24474.87     
:55@N        27007.014    
:56@N        35337.864    
:57@N        33296.04     
:58@N        37717.953    
:59@N        32995.944    
:60@N        32055.487    
:61@N        23094.687    
:62@N        40518.316    
:63@N        36779.928    
:64@N        24385.052    
:65@N        29733.432    
:66@N        41334.449    
:67@N        15688.498    
:70@N        16276.208    
:71@N        32117.182    
:72@N        15424.051    
:73@N        15564.511    

relax> relax_disp.exp_type(spectrum_id='500_133.33.in.bis', exp_type='MQ CPMG')
Setting the '500_133.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_133.33.in.bis', cpmg_frq=133.3333)
Setting the '500_133.33.in.bis' spectrum CPMG frequency 133.3333 Hz.

relax> spectrometer.frequency(id='500_133.33.in.bis', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_133.33.in.bis', time=0.03)
Setting the '500_133.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/200.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_200.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/200.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         10888.429    
:2@N         35467.932    
:3@N         34607.447    
:4@N         49361.759    
:5@N         21223.418    
:6@N         5717.5072    
:7@N         47197.448    
:8@N         31438.149    
:10@N        30261.119    
:11@N        46481.178    
:12@N        34871.209    
:13@N        45650.307    
:14@N        34960.732    
:15@N        29087.85     
:16@N        40717.951    
:17@N        34998.175    
:18@N        32995.257    
:19@N        35928.995    
:20@N        27880.153    
:21@N        25319.212    
:22@N        34197.384    
:23@N        33766.862    
:24@N        23267.587    
:25@N        34389.283    
:26@N        23971.962    
:29@N        31566.739    
:31@N        31611.202    
:32@N        34098.002    
:33@N        34954.805    
:34@N        31426.964    
:35@N        29904.048    
:36@N        30443.127    
:37@N        33809.693    
:38@N        31814.396    
:39@N        35078.168    
:40@N        27507.258    
:41@N        31174.9      
:42@N        36015.254    
:43@N        35144.294    
:44@N        47708.39     
:45@N        27016.343    
:46@N        31887.268    
:47@N        32211.815    
:48@N        31942.344    
:49@N        41070.773    
:50@N        33263.327    
:51@N        32613.384    
:52@N        22558.714    
:53@N        24618.299    
:55@N        27486.123    
:56@N        35098.489    
:57@N        32928.694    
:58@N        37517.605    
:59@N        32851.555    
:60@N        32138.366    
:61@N        23755.66     
:62@N        40743.725    
:63@N        37307.441    
:64@N        25034.009    
:65@N        30213.178    
:66@N        41591.461    
:67@N        16160.132    
:70@N        16710.653    
:71@N        32347.697    
:72@N        16024.446    
:73@N        15026.479    

relax> relax_disp.exp_type(spectrum_id='500_200.in', exp_type='MQ CPMG')
Setting the '500_200.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_200.in', cpmg_frq=200.0)
Setting the '500_200.in' spectrum CPMG frequency 200.0 Hz.

relax> spectrometer.frequency(id='500_200.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_200.in', time=0.03)
Setting the '500_200.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/266.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_266.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/266.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         11214.928    
:2@N         35356.294    
:3@N         34495.396    
:4@N         49169.489    
:5@N         22283.13     
:6@N         5663.9173    
:7@N         47364.502    
:8@N         31981.921    
:10@N        30516.955    
:11@N        46578.416    
:12@N        34661.264    
:13@N        45738.883    
:14@N        35221.11     
:15@N        29138.036    
:16@N        40723.683    
:17@N        34633.746    
:18@N        33001.016    
:19@N        35941.515    
:20@N        27830.59     
:21@N        25718.79     
:22@N        34176.508    
:23@N        33851.606    
:24@N        23500.503    
:25@N        34581.928    
:26@N        24222.222    
:29@N        31490.148    
:31@N        31928.404    
:32@N        34046.294    
:33@N        35157.286    
:34@N        31751.618    
:35@N        29916.243    
:36@N        30544.772    
:37@N        33767.862    
:38@N        31890.577    
:39@N        35300.884    
:40@N        27599.689    
:41@N        31387.481    
:42@N        36344.216    
:43@N        35243.913    
:44@N        47411.735    
:45@N        26917.319    
:46@N        31890.737    
:47@N        32337.651    
:48@N        32046.044    
:49@N        41110.72     
:50@N        33201.486    
:51@N        32858.066    
:52@N        23076.906    
:53@N        24545.609    
:55@N        28118.8      
:56@N        35387.219    
:57@N        33182.18     
:58@N        37615.397    
:59@N        33164.718    
:60@N        32409.32     
:61@N        24382.992    
:62@N        40796.258    
:63@N        37682.346    
:64@N        25554.872    
:65@N        30626.445    
:66@N        41674.944    
:67@N        16732.095    
:70@N        17581.482    
:71@N        32478.272    
:72@N        16854.22     
:73@N        15165.716    

relax> relax_disp.exp_type(spectrum_id='500_266.67.in', exp_type='MQ CPMG')
Setting the '500_266.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_266.67.in', cpmg_frq=266.6666)
Setting the '500_266.67.in' spectrum CPMG frequency 266.6666 Hz.

relax> spectrometer.frequency(id='500_266.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_266.67.in', time=0.03)
Setting the '500_266.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/333.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_333.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/333.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         11262.601    
:2@N         35348.147    
:3@N         34604.677    
:4@N         49239.453    
:5@N         22913.341    
:6@N         5616.949     
:7@N         47354.657    
:8@N         32122.346    
:10@N        30481.41     
:11@N        46442.264    
:12@N        34655.558    
:13@N        45588.346    
:14@N        35155.624    
:15@N        29278.907    
:16@N        40587.178    
:17@N        34618.898    
:18@N        33313.172    
:19@N        35947.064    
:20@N        28064.838    
:21@N        25662.331    
:22@N        34322.769    
:23@N        33933.046    
:24@N        23506.048    
:25@N        34402.485    
:26@N        24601.355    
:29@N        31663.805    
:31@N        32060.725    
:32@N        34449.932    
:33@N        35015.362    
:34@N        31633.005    
:35@N        29978.616    
:36@N        30490.347    
:37@N        33874.394    
:38@N        31981.225    
:39@N        35803.832    
:40@N        27520.901    
:41@N        31202.877    
:42@N        36274.12     
:43@N        34985.652    
:44@N        47510.978    
:45@N        26757.426    
:46@N        32202.767    
:47@N        32633.932    
:48@N        32296.502    
:49@N        41271.478    
:50@N        33208.906    
:51@N        32784.318    
:52@N        23878.487    
:53@N        24888.333    
:55@N        28283.422    
:56@N        35173.784    
:57@N        32972.922    
:58@N        37690.995    
:59@N        33232.859    
:60@N        32505.288    
:61@N        24784.761    
:62@N        40733.399    
:63@N        37572.393    
:64@N        26280.771    
:65@N        30800.157    
:66@N        41696.482    
:67@N        17481.087    
:70@N        17741.116    
:71@N        32488.116    
:72@N        17577.352    
:73@N        15437.358    

relax> relax_disp.exp_type(spectrum_id='500_333.33.in', exp_type='MQ CPMG')
Setting the '500_333.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_333.33.in', cpmg_frq=333.3333)
Setting the '500_333.33.in' spectrum CPMG frequency 333.3333 Hz.

relax> spectrometer.frequency(id='500_333.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_333.33.in', time=0.03)
Setting the '500_333.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/400.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_400.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/400.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         12383.442    
:2@N         35336.594    
:3@N         34669.264    
:4@N         49382.8      
:5@N         23153.625    
:6@N         5665.7332    
:7@N         47430.833    
:8@N         32284.123    
:10@N        30376.968    
:11@N        46425.353    
:12@N        34760.99     
:13@N        45532.87     
:14@N        34981.831    
:15@N        29077.479    
:16@N        40553.402    
:17@N        34704.842    
:18@N        32976.012    
:19@N        35895.805    
:20@N        27956.62     
:21@N        25918.648    
:22@N        34019.792    
:23@N        34162.806    
:24@N        23964.747    
:25@N        34472.847    
:26@N        24931.742    
:29@N        31678.03     
:31@N        32257.304    
:32@N        34641.158    
:33@N        34920.995    
:34@N        31698.964    
:35@N        30094.224    
:36@N        30569.033    
:37@N        33789.928    
:38@N        32029.135    
:39@N        35660.421    
:40@N        27465.122    
:41@N        31334.874    
:42@N        36348.691    
:43@N        35184.559    
:44@N        47581.979    
:45@N        27061.032    
:46@N        32385.033    
:47@N        32726.104    
:48@N        32377.757    
:49@N        41070.994    
:50@N        33358.212    
:51@N        32699.334    
:52@N        24557.264    
:53@N        24739.011    
:55@N        28764.564    
:56@N        35137.972    
:57@N        33236.963    
:58@N        37882.509    
:59@N        33195.542    
:60@N        32597.454    
:61@N        25378.129    
:62@N        40911.669    
:63@N        38315.531    
:64@N        26241.066    
:65@N        30681.602    
:66@N        41759.708    
:67@N        18228.587    
:70@N        18430.466    
:71@N        32799.529    
:72@N        17979.475    
:73@N        15219.128    

relax> relax_disp.exp_type(spectrum_id='500_400.in', exp_type='MQ CPMG')
Setting the '500_400.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_400.in', cpmg_frq=400.0)
Setting the '500_400.in' spectrum CPMG frequency 400.0 Hz.

relax> spectrometer.frequency(id='500_400.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_400.in', time=0.03)
Setting the '500_400.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/466.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_466.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/466.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         12868.106    
:2@N         35562.12     
:3@N         34612.37     
:4@N         49356.864    
:5@N         23704.213    
:6@N         5836.0014    
:7@N         47234.342    
:8@N         32470.039    
:10@N        30454.05     
:11@N        46422.804    
:12@N        35025.756    
:13@N        45629.497    
:14@N        35170.803    
:15@N        29193.404    
:16@N        40506.252    
:17@N        34605.678    
:18@N        33344.466    
:19@N        36023.125    
:20@N        28067.372    
:21@N        26130.517    
:22@N        34232.159    
:23@N        33994.553    
:24@N        23771.052    
:25@N        34479.224    
:26@N        25496.801    
:29@N        31341.912    
:31@N        32275.286    
:32@N        34908.256    
:33@N        34953.008    
:34@N        31816.595    
:35@N        30018.187    
:36@N        30612.704    
:37@N        33677.06     
:38@N        32259.521    
:39@N        35805.162    
:40@N        27770.911    
:41@N        31583.583    
:42@N        36156.365    
:43@N        35264.379    
:44@N        47422.972    
:45@N        27017.903    
:46@N        32440.694    
:47@N        32607.873    
:48@N        32160.275    
:49@N        41191.962    
:50@N        33092.055    
:51@N        33039.612    
:52@N        25093.487    
:53@N        25003.674    
:55@N        29134.084    
:56@N        35168.62     
:57@N        33079.058    
:58@N        37605.257    
:59@N        33509.232    
:60@N        32550.723    
:61@N        25789.316    
:62@N        40761.413    
:63@N        38073.21     
:64@N        26478.705    
:65@N        30848.596    
:66@N        41693.697    
:67@N        18815.334    
:70@N        18723.854    
:71@N        33034.747    
:72@N        19245.661    
:73@N        15467.302    

relax> relax_disp.exp_type(spectrum_id='500_466.67.in', exp_type='MQ CPMG')
Setting the '500_466.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_466.67.in', cpmg_frq=466.6666)
Setting the '500_466.67.in' spectrum CPMG frequency 466.6666 Hz.

relax> spectrometer.frequency(id='500_466.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_466.67.in', time=0.03)
Setting the '500_466.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/533.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_533.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/533.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         13080.323    
:2@N         35456.811    
:3@N         34688.595    
:4@N         49171.379    
:5@N         24066.833    
:6@N         5600.9486    
:7@N         47201.877    
:8@N         32169.933    
:10@N        30384.884    
:11@N        46508.976    
:12@N        34909.926    
:13@N        45627.022    
:14@N        35197.382    
:15@N        29317.401    
:16@N        40629.263    
:17@N        34680.042    
:18@N        32911.329    
:19@N        35841.246    
:20@N        27979.913    
:21@N        26252.021    
:22@N        34282.392    
:23@N        34355.465    
:24@N        23645.647    
:25@N        34595.258    
:26@N        25597.138    
:29@N        31885.397    
:31@N        31931.509    
:32@N        35110.471    
:33@N        35384.239    
:34@N        31941.206    
:35@N        30082.748    
:36@N        30501.993    
:37@N        33945.871    
:38@N        32132.462    
:39@N        36085.601    
:40@N        27857.873    
:41@N        31222.146    
:42@N        36268.327    
:43@N        35229.742    
:44@N        47800.196    
:45@N        26897.353    
:46@N        32461.564    
:47@N        32843.75     
:48@N        32399.986    
:49@N        41129.903    
:50@N        32982.9      
:51@N        32822.08     
:52@N        25683.853    
:53@N        24724.873    
:55@N        29095.966    
:56@N        35066.173    
:57@N        33156.124    
:58@N        37694.623    
:59@N        33658.376    
:60@N        32588.541    
:61@N        25992.519    
:62@N        40994.838    
:63@N        38333.657    
:64@N        26787.812    
:65@N        30716.478    
:66@N        41813.354    
:67@N        19815.216    
:70@N        18880.359    
:71@N        33277.779    
:72@N        19755.821    
:73@N        15755.719    

relax> relax_disp.exp_type(spectrum_id='500_533.33.in', exp_type='MQ CPMG')
Setting the '500_533.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_533.33.in', cpmg_frq=533.3333)
Setting the '500_533.33.in' spectrum CPMG frequency 533.3333 Hz.

relax> spectrometer.frequency(id='500_533.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_533.33.in', time=0.03)
Setting the '500_533.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/533.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_533.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/533.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         13292.562    
:2@N         35650.332    
:3@N         34638.464    
:4@N         49149.552    
:5@N         24124.315    
:6@N         5694.6442    
:7@N         47350.588    
:8@N         32310.403    
:10@N        30624.342    
:11@N        46656.375    
:12@N        34888.032    
:13@N        45600.494    
:14@N        35064.236    
:15@N        29015.287    
:16@N        40558.47     
:17@N        34609.385    
:18@N        33340.601    
:19@N        35904.81     
:20@N        28069.712    
:21@N        26256.884    
:22@N        34090.154    
:23@N        34188.923    
:24@N        23418.548    
:25@N        34524.197    
:26@N        25406.999    
:29@N        31766.355    
:31@N        32133.122    
:32@N        35050.809    
:33@N        35179.854    
:34@N        31772.845    
:35@N        30081.661    
:36@N        30527.138    
:37@N        33821.041    
:38@N        31840.738    
:39@N        36261.44     
:40@N        27605.157    
:41@N        31600.921    
:42@N        36497.767    
:43@N        35345.825    
:44@N        47551.741    
:45@N        27032.853    
:46@N        32458.525    
:47@N        32941.406    
:48@N        32353.805    
:49@N        41226.532    
:50@N        33159.085    
:51@N        32807.049    
:52@N        25300.67     
:53@N        25164.569    
:55@N        29191.126    
:56@N        35161.375    
:57@N        33047.868    
:58@N        37628.273    
:59@N        33443.466    
:60@N        32777.945    
:61@N        25963.875    
:62@N        40750.009    
:63@N        38340.677    
:64@N        26720.288    
:65@N        30927.0      
:66@N        41703.185    
:67@N        19351.832    
:70@N        19431.29     
:71@N        33369.196    
:72@N        19454.139    
:73@N        15872.749    

relax> relax_disp.exp_type(spectrum_id='500_533.33.in.bis', exp_type='MQ CPMG')
Setting the '500_533.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_533.33.in.bis', cpmg_frq=533.3333)
Setting the '500_533.33.in.bis' spectrum CPMG frequency 533.3333 Hz.

relax> spectrometer.frequency(id='500_533.33.in.bis', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_533.33.in.bis', time=0.03)
Setting the '500_533.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/600.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_600.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/600.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         13912.1      
:2@N         35718.033    
:3@N         34672.242    
:4@N         49335.18     
:5@N         24177.867    
:6@N         5589.361     
:7@N         47427.565    
:8@N         32299.3      
:10@N        30482.386    
:11@N        46644.39     
:12@N        34933.374    
:13@N        45570.036    
:14@N        35130.378    
:15@N        29248.188    
:16@N        40658.401    
:17@N        34561.466    
:18@N        33123.536    
:19@N        35913.208    
:20@N        27897.294    
:21@N        26439.687    
:22@N        34077.453    
:23@N        34038.24     
:24@N        23779.766    
:25@N        34557.056    
:26@N        25827.879    
:29@N        31663.611    
:31@N        32163.682    
:32@N        35274.247    
:33@N        35199.108    
:34@N        31812.031    
:35@N        30176.671    
:36@N        30451.177    
:37@N        33694.452    
:38@N        32269.365    
:39@N        36009.048    
:40@N        27589.479    
:41@N        31245.266    
:42@N        36401.566    
:43@N        35049.957    
:44@N        47703.947    
:45@N        27006.38     
:46@N        32692.58     
:47@N        32942.431    
:48@N        32254.382    
:49@N        41244.497    
:50@N        33118.073    
:51@N        32913.837    
:52@N        25784.075    
:53@N        25058.667    
:55@N        29395.198    
:56@N        35109.315    
:57@N        33067.853    
:58@N        37473.237    
:59@N        33554.267    
:60@N        32622.472    
:61@N        26551.497    
:62@N        40805.415    
:63@N        38471.528    
:64@N        26966.205    
:65@N        30891.321    
:66@N        41713.683    
:67@N        19843.784    
:70@N        19295.116    
:71@N        33330.505    
:72@N        19942.905    
:73@N        15787.241    

relax> relax_disp.exp_type(spectrum_id='500_600.in', exp_type='MQ CPMG')
Setting the '500_600.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_600.in', cpmg_frq=600.0)
Setting the '500_600.in' spectrum CPMG frequency 600.0 Hz.

relax> spectrometer.frequency(id='500_600.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_600.in', time=0.03)
Setting the '500_600.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/666.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_666.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/666.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14288.756    
:2@N         35584.558    
:3@N         34620.385    
:4@N         49247.787    
:5@N         24535.996    
:6@N         5746.7649    
:7@N         47315.793    
:8@N         32363.728    
:10@N        30543.031    
:11@N        46597.326    
:12@N        35022.677    
:13@N        45587.293    
:14@N        35187.979    
:15@N        29298.658    
:16@N        40565.389    
:17@N        34619.536    
:18@N        33070.39     
:19@N        35806.901    
:20@N        27911.742    
:21@N        26384.109    
:22@N        34147.312    
:23@N        34034.774    
:24@N        23595.508    
:25@N        34546.775    
:26@N        25749.158    
:29@N        31406.713    
:31@N        31975.356    
:32@N        35453.795    
:33@N        35114.798    
:34@N        31806.778    
:35@N        30044.435    
:36@N        30305.165    
:37@N        33854.818    
:38@N        31870.676    
:39@N        36245.743    
:40@N        27533.99     
:41@N        31419.365    
:42@N        36324.183    
:43@N        35402.431    
:44@N        47495.303    
:45@N        27036.604    
:46@N        32516.218    
:47@N        32620.515    
:48@N        32289.208    
:49@N        41119.696    
:50@N        33365.743    
:51@N        32798.792    
:52@N        26420.752    
:53@N        25063.476    
:55@N        29464.013    
:56@N        35068.269    
:57@N        33137.838    
:58@N        37655.524    
:59@N        33685.415    
:60@N        32649.679    
:61@N        26966.634    
:62@N        40616.46     
:63@N        38508.045    
:64@N        27458.225    
:65@N        30770.415    
:66@N        41737.588    
:67@N        20640.438    
:70@N        19615.342    
:71@N        33505.785    
:72@N        20695.265    
:73@N        15430.429    

relax> relax_disp.exp_type(spectrum_id='500_666.67.in', exp_type='MQ CPMG')
Setting the '500_666.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_666.67.in', cpmg_frq=666.6666)
Setting the '500_666.67.in' spectrum CPMG frequency 666.6666 Hz.

relax> spectrometer.frequency(id='500_666.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_666.67.in', time=0.03)
Setting the '500_666.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/733.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_733.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/733.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14648.043    
:2@N         35683.965    
:3@N         34660.584    
:4@N         49321.326    
:5@N         24731.379    
:6@N         5772.7748    
:7@N         47357.751    
:8@N         32517.478    
:10@N        30551.093    
:11@N        46713.196    
:12@N        35256.763    
:13@N        45497.86     
:14@N        35104.934    
:15@N        29212.28     
:16@N        40586.311    
:17@N        34508.61     
:18@N        33216.401    
:19@N        35906.894    
:20@N        27928.602    
:21@N        26309.097    
:22@N        34205.764    
:23@N        34188.159    
:24@N        23634.873    
:25@N        34836.605    
:26@N        25869.89     
:29@N        31452.378    
:31@N        32331.365    
:32@N        35567.515    
:33@N        35132.199    
:34@N        32210.084    
:35@N        30067.048    
:36@N        30534.073    
:37@N        33921.965    
:38@N        32348.51     
:39@N        36371.342    
:40@N        27546.585    
:41@N        31373.148    
:42@N        36346.829    
:43@N        35532.438    
:44@N        47758.532    
:45@N        27039.211    
:46@N        32334.318    
:47@N        33045.956    
:48@N        32422.613    
:49@N        41166.494    
:50@N        32964.242    
:51@N        32798.223    
:52@N        26491.603    
:53@N        25091.76     
:55@N        29994.141    
:56@N        35270.147    
:57@N        33261.429    
:58@N        37978.538    
:59@N        33481.097    
:60@N        32737.814    
:61@N        26838.689    
:62@N        40917.813    
:63@N        38800.407    
:64@N        27382.747    
:65@N        30919.311    
:66@N        41866.636    
:67@N        20948.089    
:70@N        19856.831    
:71@N        33364.821    
:72@N        20610.17     
:73@N        15347.914    

relax> relax_disp.exp_type(spectrum_id='500_733.33.in', exp_type='MQ CPMG')
Setting the '500_733.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_733.33.in', cpmg_frq=733.3333)
Setting the '500_733.33.in' spectrum CPMG frequency 733.3333 Hz.

relax> spectrometer.frequency(id='500_733.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_733.33.in', time=0.03)
Setting the '500_733.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/800.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_800.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/800.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14862.751    
:2@N         35585.882    
:3@N         34645.302    
:4@N         49272.485    
:5@N         24753.972    
:6@N         5684.3967    
:7@N         47417.168    
:8@N         32572.437    
:10@N        30492.265    
:11@N        46738.846    
:12@N        34925.041    
:13@N        45649.744    
:14@N        35183.435    
:15@N        29198.752    
:16@N        40481.55     
:17@N        34740.697    
:18@N        33165.331    
:19@N        35965.622    
:20@N        28175.782    
:21@N        26280.775    
:22@N        34015.135    
:23@N        34118.194    
:24@N        23750.68     
:25@N        34362.552    
:26@N        26043.71     
:29@N        31708.172    
:31@N        32469.882    
:32@N        35778.507    
:33@N        35133.099    
:34@N        32011.106    
:35@N        30194.357    
:36@N        30471.717    
:37@N        33984.533    
:38@N        31902.677    
:39@N        36577.61     
:40@N        27664.682    
:41@N        31317.994    
:42@N        36477.589    
:43@N        35602.425    
:44@N        47634.389    
:45@N        27072.862    
:46@N        32582.702    
:47@N        32737.528    
:48@N        32544.015    
:49@N        41187.081    
:50@N        33245.697    
:51@N        33017.969    
:52@N        26443.739    
:53@N        25114.104    
:55@N        30053.597    
:56@N        35171.821    
:57@N        33272.361    
:58@N        37729.843    
:59@N        33721.914    
:60@N        32819.816    
:61@N        26931.875    
:62@N        40778.459    
:63@N        38577.881    
:64@N        27398.616    
:65@N        31022.947    
:66@N        41783.735    
:67@N        21128.513    
:70@N        20053.047    
:71@N        33390.102    
:72@N        21181.203    
:73@N        15224.33     

relax> relax_disp.exp_type(spectrum_id='500_800.in', exp_type='MQ CPMG')
Setting the '500_800.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_800.in', cpmg_frq=800.0)
Setting the '500_800.in' spectrum CPMG frequency 800.0 Hz.

relax> spectrometer.frequency(id='500_800.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_800.in', time=0.03)
Setting the '500_800.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/866.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_866.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/866.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14834.205    
:2@N         35498.799    
:3@N         34562.25     
:4@N         49239.025    
:5@N         24904.093    
:6@N         5621.8655    
:7@N         47339.79     
:8@N         32436.473    
:10@N        30561.977    
:11@N        46558.757    
:12@N        35072.63     
:13@N        45744.752    
:14@N        35384.598    
:15@N        29346.411    
:16@N        40550.178    
:17@N        34563.462    
:18@N        32945.763    
:19@N        35909.677    
:20@N        28179.519    
:21@N        26450.648    
:22@N        34269.449    
:23@N        34261.676    
:24@N        23834.739    
:25@N        34687.574    
:26@N        26136.174    
:29@N        31820.056    
:31@N        32476.232    
:32@N        35716.163    
:33@N        35091.264    
:34@N        31842.027    
:35@N        30252.405    
:36@N        30586.775    
:37@N        33821.475    
:38@N        31966.293    
:39@N        36550.38     
:40@N        27585.742    
:41@N        31397.202    
:42@N        36455.002    
:43@N        35331.788    
:44@N        47555.874    
:45@N        27036.087    
:46@N        32595.161    
:47@N        32803.227    
:48@N        32431.374    
:49@N        41321.843    
:50@N        33056.042    
:51@N        33001.726    
:52@N        26866.862    
:53@N        25191.474    
:55@N        30084.088    
:56@N        35134.855    
:57@N        33112.569    
:58@N        37723.766    
:59@N        33508.787    
:60@N        32796.988    
:61@N        27273.578    
:62@N        40971.652    
:63@N        38615.637    
:64@N        27761.342    
:65@N        31238.101    
:66@N        41712.681    
:67@N        21476.374    
:70@N        19936.355    
:71@N        33362.913    
:72@N        21504.577    
:73@N        15418.535    

relax> relax_disp.exp_type(spectrum_id='500_866.67.in', exp_type='MQ CPMG')
Setting the '500_866.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_866.67.in', cpmg_frq=866.6666)
Setting the '500_866.67.in' spectrum CPMG frequency 866.6666 Hz.

relax> spectrometer.frequency(id='500_866.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_866.67.in', time=0.03)
Setting the '500_866.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/933.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_933.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/933.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14895.331    
:2@N         35558.6      
:3@N         34537.2      
:4@N         49294.717    
:5@N         24874.985    
:6@N         5723.1319    
:7@N         47207.529    
:8@N         32328.769    
:10@N        30461.063    
:11@N        46489.807    
:12@N        35191.454    
:13@N        45764.224    
:14@N        35497.281    
:15@N        29219.709    
:16@N        40589.924    
:17@N        34702.364    
:18@N        33290.11     
:19@N        35920.366    
:20@N        27992.753    
:21@N        26800.298    
:22@N        34161.92     
:23@N        34119.543    
:24@N        23868.983    
:25@N        34631.308    
:26@N        26133.906    
:29@N        31547.895    
:31@N        32403.592    
:32@N        35617.997    
:33@N        35109.75     
:34@N        32090.295    
:35@N        30302.147    
:36@N        30550.733    
:37@N        33872.826    
:38@N        32079.898    
:39@N        36455.548    
:40@N        27576.796    
:41@N        31474.554    
:42@N        36421.147    
:43@N        35539.076    
:44@N        47551.85     
:45@N        27259.748    
:46@N        32513.556    
:47@N        32961.585    
:48@N        32377.113    
:49@N        41291.014    
:50@N        33164.207    
:51@N        32969.653    
:52@N        26985.807    
:53@N        25056.988    
:55@N        30045.979    
:56@N        35325.281    
:57@N        33114.821    
:58@N        37912.568    
:59@N        33602.455    
:60@N        33003.711    
:61@N        27656.863    
:62@N        41155.803    
:63@N        38695.054    
:64@N        27894.602    
:65@N        30902.042    
:66@N        41719.71     
:67@N        21936.968    
:70@N        20182.933    
:71@N        33594.549    
:72@N        21420.534    
:73@N        15551.25     

relax> relax_disp.exp_type(spectrum_id='500_933.33.in', exp_type='MQ CPMG')
Setting the '500_933.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_933.33.in', cpmg_frq=933.3333)
Setting the '500_933.33.in' spectrum CPMG frequency 933.3333 Hz.

relax> spectrometer.frequency(id='500_933.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_933.33.in', time=0.03)
Setting the '500_933.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/933.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_933.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/933.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         15229.362    
:2@N         35613.376    
:3@N         34749.83     
:4@N         49229.692    
:5@N         24956.402    
:6@N         5643.1265    
:7@N         47131.601    
:8@N         32435.217    
:10@N        30422.563    
:11@N        46533.53     
:12@N        34942.655    
:13@N        45594.843    
:14@N        35069.502    
:15@N        29120.71     
:16@N        40614.679    
:17@N        34571.391    
:18@N        33167.946    
:19@N        35861.033    
:20@N        28017.402    
:21@N        26504.016    
:22@N        34266.075    
:23@N        34103.325    
:24@N        23736.228    
:25@N        34756.055    
:26@N        26045.027    
:29@N        31516.166    
:31@N        32446.023    
:32@N        35532.393    
:33@N        34915.682    
:34@N        31939.354    
:35@N        30223.588    
:36@N        30446.362    
:37@N        33963.351    
:38@N        32158.016    
:39@N        36331.365    
:40@N        27525.512    
:41@N        31327.511    
:42@N        36406.927    
:43@N        35176.551    
:44@N        47344.993    
:45@N        27016.338    
:46@N        32537.324    
:47@N        32865.426    
:48@N        32272.62     
:49@N        41379.769    
:50@N        33169.65     
:51@N        32884.827    
:52@N        27029.855    
:53@N        25049.972    
:55@N        30160.261    
:56@N        35247.235    
:57@N        33063.503    
:58@N        37803.247    
:59@N        33555.22     
:60@N        32926.579    
:61@N        27348.61     
:62@N        41026.941    
:63@N        38853.461    
:64@N        27898.98     
:65@N        31050.883    
:66@N        41857.417    
:67@N        21928.388    
:70@N        20069.04     
:71@N        33655.205    
:72@N        21097.418    
:73@N        15474.072    

relax> relax_disp.exp_type(spectrum_id='500_933.33.in.bis', exp_type='MQ CPMG')
Setting the '500_933.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_933.33.in.bis', cpmg_frq=933.3333)
Setting the '500_933.33.in.bis' spectrum CPMG frequency 933.3333 Hz.

relax> spectrometer.frequency(id='500_933.33.in.bis', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_933.33.in.bis', time=0.03)
Setting the '500_933.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/1000.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_1000.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/1000.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         15452.232    
:2@N         35656.747    
:3@N         34620.493    
:4@N         49310.788    
:5@N         25154.775    
:6@N         5683.8093    
:7@N         47286.883    
:8@N         32502.69     
:10@N        30457.495    
:11@N        46552.427    
:12@N        35111.286    
:13@N        45856.226    
:14@N        35217.464    
:15@N        29428.97     
:16@N        40510.311    
:17@N        34754.35     
:18@N        32922.56     
:19@N        35982.292    
:20@N        27959.017    
:21@N        26678.041    
:22@N        34017.798    
:23@N        34218.069    
:24@N        23783.367    
:25@N        34625.978    
:26@N        25904.439    
:29@N        31479.159    
:31@N        32501.4      
:32@N        35755.775    
:33@N        35196.513    
:34@N        31939.176    
:35@N        30083.413    
:36@N        30424.405    
:37@N        33967.504    
:38@N        32368.718    
:39@N        36545.499    
:40@N        27614.82     
:41@N        31255.557    
:42@N        36462.22     
:43@N        35131.589    
:44@N        47525.409    
:45@N        27222.561    
:46@N        32578.358    
:47@N        32818.585    
:48@N        32299.115    
:49@N        41330.568    
:50@N        33128.863    
:51@N        32855.971    
:52@N        27106.846    
:53@N        24939.166    
:55@N        30061.23     
:56@N        35006.044    
:57@N        33003.75     
:58@N        37491.939    
:59@N        33776.944    
:60@N        33021.396    
:61@N        27553.74     
:62@N        40742.053    
:63@N        38820.878    
:64@N        27900.325    
:65@N        30993.752    
:66@N        41943.503    
:67@N        22301.77     
:70@N        20229.099    
:71@N        33574.087    
:72@N        21461.571    
:73@N        15689.319    

relax> relax_disp.exp_type(spectrum_id='500_1000.in', exp_type='MQ CPMG')
Setting the '500_1000.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_1000.in', cpmg_frq=1000.0)
Setting the '500_1000.in' spectrum CPMG frequency 1000.0 Hz.

relax> spectrometer.frequency(id='500_1000.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_1000.in', time=0.03)
Setting the '500_1000.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/reference.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_reference.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/reference.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         55016.173     
:2@N         115841.42     
:3@N         111197.35     
:4@N         179861.72     
:5@N         87519.036     
:6@N         20670.274     
:7@N         172408.51     
:8@N         121952.51     
:10@N        107929.48     
:11@N        166994.27     
:12@N        116038.93     
:13@N        164314.74     
:14@N        131304.78     
:15@N        103341.21     
:16@N        153385.51     
:17@N        136442.29     
:18@N        118075.05     
:19@N        136547.8      
:20@N        96849.544     
:21@N        92449.456     
:22@N        132427.8      
:23@N        140639.77     
:24@N        92224.557     
:25@N        121067.54     
:26@N        95661.471     
:27@N        -20489.532    
:28@N        175932.89     
:29@N        116387.38     
:30@N        21519.171     
:31@N        126093.85     
:32@N        127022.63     
:33@N        133429.74     
:34@N        113965.83     
:35@N        108784.45     
:36@N        102854.35     
:37@N        136612.98     
:38@N        113315.55     
:39@N        134821.31     
:40@N        96946.32      
:41@N        117257.33     
:42@N        142016.32     
:43@N        118345.49     
:44@N        161349.18     
:45@N        94491.618     
:46@N        121918.87     
:47@N        126527.54     
:48@N        129155.52     
:49@N        148777.46     
:50@N        133566.63     
:51@N        121382.62     
:52@N        94240.554     
:53@N        83242.764     
:55@N        115334.6      
:56@N        132426.71     
:57@N        129314.32     
:58@N        140510.83     
:59@N        133253.5      
:60@N        134839.44     
:61@N        100740.64     
:62@N        131741.32     
:63@N        121281.79     
:64@N        96457.533     
:65@N        110857.49     
:66@N        152672.04     
:67@N        89722.502     
:70@N        75506.418     

relax> relax_disp.exp_type(spectrum_id='800_reference.in', exp_type='MQ CPMG')
Setting the '800_reference.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_reference.in', cpmg_frq=None)
Setting the '800_reference.in' spectrum CPMG frequency None Hz.

relax> spectrometer.frequency(id='800_reference.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_reference.in', time=0.03)
Setting the '800_reference.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/66.667.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_66.667.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/66.667.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         23035.747    
:2@N         99629.762    
:3@N         95663.137    
:4@N         170898.93    
:5@N         47323.876    
:6@N         20199.122    
:7@N         166554.88    
:8@N         90061.074    
:10@N        84726.204    
:11@N        150502.33    
:12@N        92998.531    
:13@N        163435.07    
:14@N        101373.01    
:15@N        83407.837    
:16@N        138191.26    
:17@N        110104.9     
:18@N        94324.035    
:19@N        111351.79    
:20@N        76339.41     
:21@N        62008.453    
:22@N        105904.04    
:23@N        106301.98    
:24@N        72996.32     
:25@N        95486.742    
:26@N        58067.989    
:27@N        -17168.51    
:28@N        168914.73    
:29@N        94038.555    
:30@N        21386.951    
:31@N        93982.899    
:32@N        86097.484    
:33@N        101943.37    
:34@N        85683.111    
:35@N        86985.768    
:36@N        86011.237    
:37@N        109840.97    
:38@N        87017.879    
:39@N        91682.649    
:40@N        76370.44     
:41@N        91393.531    
:42@N        110171.11    
:43@N        94552.366    
:44@N        128582.81    
:45@N        74583.525    
:46@N        92087.49     
:47@N        97507.255    
:48@N        100338.42    
:49@N        130483.05    
:50@N        105467.96    
:51@N        93099.697    
:52@N        46863.758    
:53@N        61055.806    
:55@N        68629.994    
:56@N        110055.52    
:57@N        105727.6     
:58@N        111769.5     
:59@N        98758.603    
:60@N        99517.201    
:61@N        54357.946    
:62@N        108999.78    
:63@N        84549.759    
:64@N        55014.55     
:65@N        80569.666    
:66@N        129366.1     
:67@N        36438.01     
:70@N        38763.157    

relax> relax_disp.exp_type(spectrum_id='800_66.667.in', exp_type='MQ CPMG')
Setting the '800_66.667.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_66.667.in', cpmg_frq=66.6666)
Setting the '800_66.667.in' spectrum CPMG frequency 66.6666 Hz.

relax> spectrometer.frequency(id='800_66.667.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_66.667.in', time=0.03)
Setting the '800_66.667.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/133.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_133.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/133.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         22894.885     
:2@N         100150.36     
:3@N         95906.834     
:4@N         170990.52     
:5@N         48550.561     
:6@N         19898.236     
:7@N         166298.89     
:8@N         91244.165     
:10@N        85721.984     
:11@N        151202.09     
:12@N        94337.569     
:13@N        163296.13     
:14@N        101879.73     
:15@N        83945.257     
:16@N        138192.78     
:17@N        109974.13     
:18@N        93946.229     
:19@N        111401.15     
:20@N        77037.149     
:21@N        63472.065     
:22@N        105859.41     
:23@N        106508.83     
:24@N        72641.885     
:25@N        95683.889     
:26@N        58919.208     
:27@N        -17210.185    
:28@N        168579.02     
:29@N        93901.156     
:30@N        21317.613     
:31@N        95517.758     
:32@N        88204.327     
:33@N        102713.88     
:34@N        86747.649     
:35@N        87721.413     
:36@N        85637.601     
:37@N        109727.03     
:38@N        87964.796     
:39@N        93475.606     
:40@N        76675.768     
:41@N        91354.427     
:42@N        111921.49     
:43@N        94210.77      
:44@N        128343.66     
:45@N        74354.332     
:46@N        93600.352     
:47@N        98760.693     
:48@N        101691.93     
:49@N        131138.24     
:50@N        105732.17     
:51@N        93887.296     
:52@N        48643.794     
:53@N        62448.011     
:55@N        70455.248     
:56@N        110516.43     
:57@N        106801.74     
:58@N        112022.84     
:59@N        99435.891     
:60@N        100341.33     
:61@N        53892.161     
:62@N        110187.73     
:63@N        85411.032     
:64@N        56560.609     
:65@N        81326.701     
:66@N        130469.89     
:67@N        37089.041     
:70@N        40007.044     

relax> relax_disp.exp_type(spectrum_id='800_133.33.in', exp_type='MQ CPMG')
Setting the '800_133.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_133.33.in', cpmg_frq=133.3333)
Setting the '800_133.33.in' spectrum CPMG frequency 133.3333 Hz.

relax> spectrometer.frequency(id='800_133.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_133.33.in', time=0.03)
Setting the '800_133.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/133.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_133.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/133.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         23431.581     
:2@N         100306.27     
:3@N         96166.008     
:4@N         170997.76     
:5@N         48956.05      
:6@N         20112.967     
:7@N         166406.37     
:8@N         91117.831     
:10@N        85470.791     
:11@N        151426.7      
:12@N        93685.309     
:13@N        163557.77     
:14@N        101814.42     
:15@N        83901.731     
:16@N        138482.51     
:17@N        109968.57     
:18@N        94318.243     
:19@N        111288.77     
:20@N        76842.26      
:21@N        63195.203     
:22@N        105997.25     
:23@N        106389.21     
:24@N        73205.203     
:25@N        95375.334     
:26@N        58665.233     
:27@N        -17215.423    
:28@N        168776.86     
:29@N        93770.941     
:30@N        21340.061     
:31@N        95648.306     
:32@N        88354.911     
:33@N        102912.83     
:34@N        86994.371     
:35@N        87097.668     
:36@N        85683.082     
:37@N        109997.53     
:38@N        87610.416     
:39@N        93572.559     
:40@N        76349.028     
:41@N        91096.708     
:42@N        111332.49     
:43@N        94558.52      
:44@N        128645.46     
:45@N        74991.508     
:46@N        93892.141     
:47@N        98662.815     
:48@N        102051.97     
:49@N        131442.13     
:50@N        105835.44     
:51@N        93808.334     
:52@N        49097.536     
:53@N        61882.84      
:55@N        70387.353     
:56@N        110595.3      
:57@N        105983.39     
:58@N        112222.9      
:59@N        99377.886     
:60@N        99936.482     
:61@N        54511.855     
:62@N        109820.57     
:63@N        85926.192     
:64@N        56397.873     
:65@N        80923.209     
:66@N        130290.37     
:67@N        37042.346     
:70@N        39866.015     

relax> relax_disp.exp_type(spectrum_id='800_133.33.in.bis', exp_type='MQ CPMG')
Setting the '800_133.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_133.33.in.bis', cpmg_frq=133.3333)
Setting the '800_133.33.in.bis' spectrum CPMG frequency 133.3333 Hz.

relax> spectrometer.frequency(id='800_133.33.in.bis', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_133.33.in.bis', time=0.03)
Setting the '800_133.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/200.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_200.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/200.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         24305.555    
:2@N         99866.425    
:3@N         95727.109    
:4@N         171598.73    
:5@N         50690.63     
:6@N         20134.273    
:7@N         166388.02    
:8@N         92489.917    
:10@N        85010.984    
:11@N        151105.36    
:12@N        94246.363    
:13@N        163528.06    
:14@N        102179.68    
:15@N        83736.305    
:16@N        138350.69    
:17@N        110684.1     
:18@N        94496.827    
:19@N        111801.77    
:20@N        76986.83     
:21@N        64522.053    
:22@N        106682.08    
:23@N        107776.2     
:24@N        73895.599    
:25@N        96000.368    
:26@N        60936.634    
:27@N        -17447.21    
:28@N        169370.69    
:29@N        94890.171    
:30@N        21929.152    
:31@N        96731.077    
:32@N        89485.573    
:33@N        103114.27    
:34@N        87345.273    
:35@N        88048.949    
:36@N        86028.338    
:37@N        110225.21    
:38@N        87611.186    
:39@N        95052.975    
:40@N        76612.649    
:41@N        91281.875    
:42@N        112257.56    
:43@N        94900.696    
:44@N        129586.77    
:45@N        75161.984    
:46@N        94990.178    
:47@N        99579.078    
:48@N        102634.31    
:49@N        131310.56    
:50@N        106535.97    
:51@N        94911.332    
:52@N        50486.848    
:53@N        63198.159    
:55@N        73151.964    
:56@N        111612.51    
:57@N        106992.73    
:58@N        112964.38    
:59@N        100205.98    
:60@N        101995.85    
:61@N        56149.345    
:62@N        110838.65    
:63@N        87055.23     
:64@N        58198.039    
:65@N        82127.959    
:66@N        130889.09    
:67@N        37463.24     
:70@N        40695.053    

relax> relax_disp.exp_type(spectrum_id='800_200.in', exp_type='MQ CPMG')
Setting the '800_200.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_200.in', cpmg_frq=200.0)
Setting the '800_200.in' spectrum CPMG frequency 200.0 Hz.

relax> spectrometer.frequency(id='800_200.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_200.in', time=0.03)
Setting the '800_200.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/266.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_266.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/266.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         24289.212     
:2@N         100591.42     
:3@N         96624.163     
:4@N         170741.44     
:5@N         52640.882     
:6@N         20084.813     
:7@N         166314.8      
:8@N         92743.312     
:10@N        85533.016     
:11@N        151407.64     
:12@N        95125.653     
:13@N        163617.94     
:14@N        103206.36     
:15@N        84391.168     
:16@N        138304.63     
:17@N        110797.63     
:18@N        95519.429     
:19@N        112303.08     
:20@N        77840.932     
:21@N        65538.096     
:22@N        106612.05     
:23@N        108479.74     
:24@N        73773.567     
:25@N        96382.989     
:26@N        62705.659     
:27@N        -17009.835    
:28@N        168507.43     
:29@N        94322.124     
:30@N        21536.032     
:31@N        97318.461     
:32@N        91602.642     
:33@N        103084.79     
:34@N        88259.59      
:35@N        87735.126     
:36@N        86131.115     
:37@N        109801.65     
:38@N        88219.192     
:39@N        96406.682     
:40@N        77046.214     
:41@N        92155.078     
:42@N        112264.21     
:43@N        94942.41      
:44@N        128748.1      
:45@N        75489.702     
:46@N        95245.605     
:47@N        99821.317     
:48@N        102636.08     
:49@N        131852.08     
:50@N        106020.96     
:51@N        95192.679     
:52@N        52427.773     
:53@N        64145.683     
:55@N        75767.739     
:56@N        111250.61     
:57@N        107758.48     
:58@N        113702.97     
:59@N        102250.57     
:60@N        104222.54     
:61@N        57804.811     
:62@N        111108.97     
:63@N        88602.166     
:64@N        60810.348     
:65@N        83698.895     
:66@N        131927.44     
:67@N        38957.75      
:70@N        41033.292     

relax> relax_disp.exp_type(spectrum_id='800_266.67.in', exp_type='MQ CPMG')
Setting the '800_266.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_266.67.in', cpmg_frq=266.6666)
Setting the '800_266.67.in' spectrum CPMG frequency 266.6666 Hz.

relax> spectrometer.frequency(id='800_266.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_266.67.in', time=0.03)
Setting the '800_266.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/333.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_333.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/333.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         25259.402     
:2@N         100770.35     
:3@N         96160.677     
:4@N         170855.52     
:5@N         54673.995     
:6@N         20101.939     
:7@N         166620.68     
:8@N         94852.414     
:10@N        85756.065     
:11@N        152104.65     
:12@N        95612.312     
:13@N        163711.53     
:14@N        103973.9      
:15@N        84380.946     
:16@N        138684.84     
:17@N        110866.7      
:18@N        95542.612     
:19@N        111618.16     
:20@N        77943.16      
:21@N        67208.122     
:22@N        107102.2      
:23@N        109659.66     
:24@N        73165.914     
:25@N        96587.68      
:26@N        64802.155     
:27@N        -17155.466    
:28@N        168997.54     
:29@N        94840.257     
:30@N        21672.704     
:31@N        98894.846     
:32@N        94053.515     
:33@N        103466.35     
:34@N        88719.561     
:35@N        88247.805     
:36@N        85687.442     
:37@N        110223.18     
:38@N        88971.811     
:39@N        97827.689     
:40@N        76123.679     
:41@N        92060.761     
:42@N        113234.62     
:43@N        94661.936     
:44@N        128829.38     
:45@N        75242.347     
:46@N        96212.27      
:47@N        99831.443     
:48@N        103234.9      
:49@N        132645.42     
:50@N        105901.72     
:51@N        95506.868     
:52@N        54418.174     
:53@N        64727.711     
:55@N        78076.094     
:56@N        111065.73     
:57@N        107474.14     
:58@N        114030.99     
:59@N        102440.83     
:60@N        104555.66     
:61@N        59072.272     
:62@N        112436.15     
:63@N        91614.185     
:64@N        63225.493     
:65@N        85388.161     
:66@N        132947.07     
:67@N        39630.564     
:70@N        42886.468     

relax> relax_disp.exp_type(spectrum_id='800_333.33.in', exp_type='MQ CPMG')
Setting the '800_333.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_333.33.in', cpmg_frq=333.3333)
Setting the '800_333.33.in' spectrum CPMG frequency 333.3333 Hz.

relax> spectrometer.frequency(id='800_333.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_333.33.in', time=0.03)
Setting the '800_333.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/400.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_400.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/400.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         26719.629     
:2@N         100851.91     
:3@N         95626.166     
:4@N         171184.09     
:5@N         56817.207     
:6@N         20069.164     
:7@N         166820.99     
:8@N         95197.147     
:10@N        86179.253     
:11@N        151917.21     
:12@N        96541.287     
:13@N        163407.81     
:14@N        104243.05     
:15@N        84587.694     
:16@N        138692.62     
:17@N        110569.22     
:18@N        95351.033     
:19@N        111991.74     
:20@N        78080.173     
:21@N        67849.967     
:22@N        107528.73     
:23@N        109901.03     
:24@N        73630.447     
:25@N        97054.414     
:26@N        66818.796     
:27@N        -17013.568    
:28@N        169154.4      
:29@N        94578.359     
:30@N        21502.985     
:31@N        99572.069     
:32@N        95105.722     
:33@N        103704.16     
:34@N        89259.675     
:35@N        88004.6       
:36@N        85827.151     
:37@N        110659.29     
:38@N        89374.073     
:39@N        98984.552     
:40@N        76626.79      
:41@N        92384.251     
:42@N        113581.06     
:43@N        95028.423     
:44@N        129055.05     
:45@N        75559.772     
:46@N        96701.777     
:47@N        100806.79     
:48@N        103199.14     
:49@N        132562.79     
:50@N        106526.61     
:51@N        96154.768     
:52@N        56424.46      
:53@N        65139.092     
:55@N        79367.202     
:56@N        111283.12     
:57@N        107629.8      
:58@N        114179.3      
:59@N        103393.31     
:60@N        105380.87     
:61@N        62234.568     
:62@N        113324.91     
:63@N        92947.406     
:64@N        65361.837     
:65@N        86325.701     
:66@N        133703.87     
:67@N        40183.814     
:70@N        43297.363     

relax> relax_disp.exp_type(spectrum_id='800_400.in', exp_type='MQ CPMG')
Setting the '800_400.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_400.in', cpmg_frq=400.0)
Setting the '800_400.in' spectrum CPMG frequency 400.0 Hz.

relax> spectrometer.frequency(id='800_400.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_400.in', time=0.03)
Setting the '800_400.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/466.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_466.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/466.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         27003.014     
:2@N         100905.9      
:3@N         96459.171     
:4@N         171251.59     
:5@N         59703.86      
:6@N         20322.452     
:7@N         166653.8      
:8@N         95689.59      
:10@N        86294.5       
:11@N        151799.56     
:12@N        96598.447     
:13@N        163641.15     
:14@N        104385.1      
:15@N        84583.503     
:16@N        138460.69     
:17@N        110571.6      
:18@N        95556.02      
:19@N        111914.37     
:20@N        78384.516     
:21@N        69167.308     
:22@N        107007.78     
:23@N        110425.23     
:24@N        73643.284     
:25@N        97125.674     
:26@N        68404.064     
:27@N        -17545.488    
:28@N        169098.12     
:29@N        95039.953     
:30@N        21506.447     
:31@N        100230.99     
:32@N        96780.416     
:33@N        103696.11     
:34@N        89992.531     
:35@N        87893.742     
:36@N        85851.373     
:37@N        110154.38     
:38@N        88875.864     
:39@N        99958.714     
:40@N        76670.552     
:41@N        92924.934     
:42@N        113879.51     
:43@N        94357.127     
:44@N        129346.92     
:45@N        75809.948     
:46@N        96859.188     
:47@N        101095.68     
:48@N        103869.88     
:49@N        133550.88     
:50@N        106336.79     
:51@N        96081.664     
:52@N        59800.1       
:53@N        65931.692     
:55@N        81465.831     
:56@N        111083.77     
:57@N        106866.28     
:58@N        114253.85     
:59@N        103317.59     
:60@N        105606.99     
:61@N        62828.977     
:62@N        113192.69     
:63@N        93478.73      
:64@N        67078.602     
:65@N        86904.584     
:66@N        134045.44     
:67@N        42248.407     
:70@N        44655.415     

relax> relax_disp.exp_type(spectrum_id='800_466.67.in', exp_type='MQ CPMG')
Setting the '800_466.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_466.67.in', cpmg_frq=466.6666)
Setting the '800_466.67.in' spectrum CPMG frequency 466.6666 Hz.

relax> spectrometer.frequency(id='800_466.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_466.67.in', time=0.03)
Setting the '800_466.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/533.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_533.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/533.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         29266.27      
:2@N         100721.68     
:3@N         96503.304     
:4@N         171507.2      
:5@N         61073.487     
:6@N         19933.56      
:7@N         166283.08     
:8@N         96075.588     
:10@N        86299.793     
:11@N        152036.24     
:12@N        96835.874     
:13@N        163568.22     
:14@N        104818.52     
:15@N        84676.468     
:16@N        138684.56     
:17@N        110662.64     
:18@N        96081.339     
:19@N        111830.94     
:20@N        78288.388     
:21@N        69283.278     
:22@N        107161.82     
:23@N        110547.99     
:24@N        74152.953     
:25@N        97344.153     
:26@N        69160.279     
:27@N        -17537.434    
:28@N        169061.19     
:29@N        94215.466     
:30@N        21496.752     
:31@N        100145.14     
:32@N        97823.625     
:33@N        103953.36     
:34@N        89674.759     
:35@N        88456.638     
:36@N        86577.259     
:37@N        110738.91     
:38@N        89530.576     
:39@N        100404.69     
:40@N        76869.96      
:41@N        92840.07      
:42@N        114052.91     
:43@N        94583.787     
:44@N        129167.4      
:45@N        75595.989     
:46@N        97502.23      
:47@N        101473.6      
:48@N        103997.64     
:49@N        133215.99     
:50@N        105808.07     
:51@N        96336.095     
:52@N        61196.991     
:53@N        65936.633     
:55@N        83415.155     
:56@N        110920.76     
:57@N        107254.57     
:58@N        114521.79     
:59@N        104470.58     
:60@N        106292.29     
:61@N        65094.634     
:62@N        113364.21     
:63@N        94335.839     
:64@N        68730.658     
:65@N        87054.383     
:66@N        134535.27     
:67@N        44126.852     
:70@N        46303.662     

relax> relax_disp.exp_type(spectrum_id='800_533.33.in', exp_type='MQ CPMG')
Setting the '800_533.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_533.33.in', cpmg_frq=533.3333)
Setting the '800_533.33.in' spectrum CPMG frequency 533.3333 Hz.

relax> spectrometer.frequency(id='800_533.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_533.33.in', time=0.03)
Setting the '800_533.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/533.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_533.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/533.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         28591.099     
:2@N         100998.15     
:3@N         96502.101     
:4@N         171584.43     
:5@N         62627.776     
:6@N         19925.142     
:7@N         166496.53     
:8@N         96735.096     
:10@N        86060.241     
:11@N        152052.79     
:12@N        97153.241     
:13@N        163634.94     
:14@N        104075.65     
:15@N        84571.417     
:16@N        138314.62     
:17@N        110612.79     
:18@N        95663.825     
:19@N        112023.6      
:20@N        78772.837     
:21@N        70120.022     
:22@N        106911.01     
:23@N        111207.0      
:24@N        73593.6       
:25@N        96695.458     
:26@N        69173.661     
:27@N        -17736.507    
:28@N        169196.37     
:29@N        94807.578     
:30@N        21555.453     
:31@N        100596.16     
:32@N        98756.097     
:33@N        104004.92     
:34@N        89897.601     
:35@N        88103.714     
:36@N        86237.686     
:37@N        110591.16     
:38@N        89905.492     
:39@N        101014.18     
:40@N        76691.85      
:41@N        92727.785     
:42@N        114070.74     
:43@N        95426.182     
:44@N        128820.93     
:45@N        75267.027     
:46@N        97064.311     
:47@N        101283.65     
:48@N        103817.37     
:49@N        133571.18     
:50@N        106329.47     
:51@N        95863.356     
:52@N        61228.776     
:53@N        65901.862     
:55@N        83313.832     
:56@N        111053.41     
:57@N        107549.04     
:58@N        114348.22     
:59@N        104449.04     
:60@N        106660.07     
:61@N        65571.583     
:62@N        113136.56     
:63@N        94361.474     
:64@N        68157.129     
:65@N        87085.891     
:66@N        134273.94     
:67@N        44030.662     
:70@N        47040.817     

relax> relax_disp.exp_type(spectrum_id='800_533.33.in.bis', exp_type='MQ CPMG')
Setting the '800_533.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_533.33.in.bis', cpmg_frq=533.3333)
Setting the '800_533.33.in.bis' spectrum CPMG frequency 533.3333 Hz.

relax> spectrometer.frequency(id='800_533.33.in.bis', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_533.33.in.bis', time=0.03)
Setting the '800_533.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/600.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_600.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/600.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         30802.391     
:2@N         100885.81     
:3@N         96437.96      
:4@N         170836.57     
:5@N         63928.673     
:6@N         19883.118     
:7@N         166377.19     
:8@N         97147.344     
:10@N        86424.112     
:11@N        151931.25     
:12@N        97029.574     
:13@N        163521.0      
:14@N        104767.3      
:15@N        84603.781     
:16@N        138606.78     
:17@N        110646.34     
:18@N        96040.13      
:19@N        112163.33     
:20@N        78466.856     
:21@N        69784.742     
:22@N        107039.64     
:23@N        111168.06     
:24@N        74032.19      
:25@N        97332.266     
:26@N        70909.404     
:27@N        -17412.791    
:28@N        169194.03     
:29@N        94494.847     
:30@N        21569.985     
:31@N        100694.08     
:32@N        99135.54      
:33@N        103976.67     
:34@N        90362.657     
:35@N        87951.445     
:36@N        85988.348     
:37@N        110380.5      
:38@N        89810.192     
:39@N        101590.27     
:40@N        76489.453     
:41@N        92987.85      
:42@N        114320.48     
:43@N        94523.698     
:44@N        129076.74     
:45@N        76069.495     
:46@N        97635.605     
:47@N        101495.85     
:48@N        103805.14     
:49@N        133192.6      
:50@N        106252.83     
:51@N        96509.258     
:52@N        63165.034     
:53@N        66369.554     
:55@N        84109.163     
:56@N        110512.08     
:57@N        106931.83     
:58@N        114376.0      
:59@N        104238.5      
:60@N        107315.39     
:61@N        66529.401     
:62@N        113134.71     
:63@N        94798.359     
:64@N        69467.908     
:65@N        87739.054     
:66@N        134608.19     
:67@N        45397.324     
:70@N        47902.702     

relax> relax_disp.exp_type(spectrum_id='800_600.in', exp_type='MQ CPMG')
Setting the '800_600.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_600.in', cpmg_frq=600.0)
Setting the '800_600.in' spectrum CPMG frequency 600.0 Hz.

relax> spectrometer.frequency(id='800_600.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_600.in', time=0.03)
Setting the '800_600.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/666.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_666.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/666.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         32227.062     
:2@N         101156.76     
:3@N         97026.979     
:4@N         171439.44     
:5@N         64604.267     
:6@N         20183.45      
:7@N         166581.3      
:8@N         97399.907     
:10@N        86203.026     
:11@N        151930.25     
:12@N        96829.484     
:13@N        163692.31     
:14@N        104557.99     
:15@N        84570.019     
:16@N        138476.38     
:17@N        110490.61     
:18@N        95563.948     
:19@N        112224.81     
:20@N        78566.021     
:21@N        70270.162     
:22@N        107176.93     
:23@N        111519.31     
:24@N        73966.113     
:25@N        97327.804     
:26@N        70860.81      
:27@N        -17321.528    
:28@N        169040.92     
:29@N        94370.82      
:30@N        21633.203     
:31@N        101746.81     
:32@N        100127.51     
:33@N        104134.93     
:34@N        90561.969     
:35@N        88254.435     
:36@N        85632.416     
:37@N        110272.8      
:38@N        89468.971     
:39@N        102231.73     
:40@N        76449.969     
:41@N        92686.384     
:42@N        114667.63     
:43@N        94716.971     
:44@N        129199.53     
:45@N        75282.058     
:46@N        98094.283     
:47@N        101664.6      
:48@N        103990.56     
:49@N        133771.05     
:50@N        106497.77     
:51@N        96296.232     
:52@N        65009.126     
:53@N        66630.449     
:55@N        85325.258     
:56@N        110834.05     
:57@N        107209.02     
:58@N        114757.07     
:59@N        104684.46     
:60@N        107508.0      
:61@N        68070.647     
:62@N        113762.71     
:63@N        95170.811     
:64@N        70748.035     
:65@N        87818.653     
:66@N        134348.02     
:67@N        47226.167     
:70@N        48972.729     

relax> relax_disp.exp_type(spectrum_id='800_666.67.in', exp_type='MQ CPMG')
Setting the '800_666.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_666.67.in', cpmg_frq=666.6666)
Setting the '800_666.67.in' spectrum CPMG frequency 666.6666 Hz.

relax> spectrometer.frequency(id='800_666.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_666.67.in', time=0.03)
Setting the '800_666.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/733.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_733.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/733.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         33403.914     
:2@N         101279.08     
:3@N         96884.706     
:4@N         171718.72     
:5@N         66621.889     
:6@N         20163.282     
:7@N         166543.59     
:8@N         97685.848     
:10@N        86644.692     
:11@N        151785.26     
:12@N        97253.257     
:13@N        163466.64     
:14@N        104836.9      
:15@N        85252.268     
:16@N        138309.52     
:17@N        110316.37     
:18@N        95764.368     
:19@N        111676.48     
:20@N        78550.748     
:21@N        70497.455     
:22@N        106951.45     
:23@N        111305.65     
:24@N        74212.606     
:25@N        96905.016     
:26@N        71679.019     
:27@N        -17503.659    
:28@N        169094.72     
:29@N        94466.606     
:30@N        21609.116     
:31@N        101693.67     
:32@N        100786.72     
:33@N        103825.26     
:34@N        90664.528     
:35@N        88233.258     
:36@N        85772.939     
:37@N        110543.71     
:38@N        89463.73      
:39@N        102249.34     
:40@N        76574.462     
:41@N        92987.44      
:42@N        114963.69     
:43@N        94662.558     
:44@N        128901.12     
:45@N        75819.394     
:46@N        98083.693     
:47@N        101223.68     
:48@N        104264.56     
:49@N        133520.58     
:50@N        106123.19     
:51@N        96697.272     
:52@N        66204.216     
:53@N        66828.483     
:55@N        85693.435     
:56@N        110709.33     
:57@N        107258.65     
:58@N        114647.7      
:59@N        104692.21     
:60@N        107831.26     
:61@N        68854.998     
:62@N        113833.08     
:63@N        95507.705     
:64@N        71842.427     
:65@N        87548.487     
:66@N        134840.54     
:67@N        48428.822     
:70@N        49560.47      

relax> relax_disp.exp_type(spectrum_id='800_733.33.in', exp_type='MQ CPMG')
Setting the '800_733.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_733.33.in', cpmg_frq=733.3333)
Setting the '800_733.33.in' spectrum CPMG frequency 733.3333 Hz.

relax> spectrometer.frequency(id='800_733.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_733.33.in', time=0.03)
Setting the '800_733.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/800.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_800.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/800.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         35769.45      
:2@N         101965.73     
:3@N         97133.544     
:4@N         171807.79     
:5@N         66694.061     
:6@N         20055.22      
:7@N         166358.59     
:8@N         97416.842     
:10@N        86370.127     
:11@N        152194.55     
:12@N        97224.315     
:13@N        163562.84     
:14@N        105150.03     
:15@N        84721.16      
:16@N        138091.88     
:17@N        110342.69     
:18@N        96067.809     
:19@N        112248.05     
:20@N        78625.762     
:21@N        70941.229     
:22@N        106857.08     
:23@N        111706.79     
:24@N        73697.676     
:25@N        96854.189     
:26@N        72038.068     
:27@N        -17456.997    
:28@N        169088.4      
:29@N        94577.741     
:30@N        21533.635     
:31@N        101393.33     
:32@N        100821.94     
:33@N        104162.93     
:34@N        90706.324     
:35@N        88148.948     
:36@N        86381.367     
:37@N        110606.71     
:38@N        90400.543     
:39@N        102823.43     
:40@N        76992.613     
:41@N        92800.19      
:42@N        114668.69     
:43@N        94153.077     
:44@N        129235.43     
:45@N        76735.032     
:46@N        97828.456     
:47@N        101600.59     
:48@N        104145.14     
:49@N        133163.11     
:50@N        106143.77     
:51@N        96524.738     
:52@N        67681.209     
:53@N        66221.377     
:55@N        86592.328     
:56@N        110676.94     
:57@N        107232.15     
:58@N        114508.07     
:59@N        105337.86     
:60@N        107728.36     
:61@N        69957.79      
:62@N        113699.32     
:63@N        95414.456     
:64@N        71915.44      
:65@N        88281.806     
:66@N        134560.46     
:67@N        49726.057     
:70@N        51244.752     

relax> relax_disp.exp_type(spectrum_id='800_800.in', exp_type='MQ CPMG')
Setting the '800_800.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_800.in', cpmg_frq=800.0)
Setting the '800_800.in' spectrum CPMG frequency 800.0 Hz.

relax> spectrometer.frequency(id='800_800.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_800.in', time=0.03)
Setting the '800_800.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/866.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_866.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/866.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         36732.29      
:2@N         101932.33     
:3@N         96846.259     
:4@N         171243.18     
:5@N         68334.54      
:6@N         19992.465     
:7@N         166199.8      
:8@N         97655.11      
:10@N        86130.443     
:11@N        151847.57     
:12@N        97278.054     
:13@N        163561.73     
:14@N        104736.5      
:15@N        84900.519     
:16@N        138274.83     
:17@N        110517.03     
:18@N        95549.771     
:19@N        111726.04     
:20@N        78416.552     
:21@N        71534.523     
:22@N        106426.96     
:23@N        111290.24     
:24@N        74265.739     
:25@N        97026.607     
:26@N        73034.4       
:27@N        -17953.528    
:28@N        168959.56     
:29@N        94581.365     
:30@N        21724.856     
:31@N        101412.28     
:32@N        101777.52     
:33@N        103835.54     
:34@N        90877.776     
:35@N        88869.04      
:36@N        85711.769     
:37@N        110221.52     
:38@N        90369.64      
:39@N        103348.58     
:40@N        76474.521     
:41@N        93163.04      
:42@N        114402.6      
:43@N        95101.625     
:44@N        128798.44     
:45@N        75871.028     
:46@N        97995.036     
:47@N        101421.57     
:48@N        104105.38     
:49@N        133943.12     
:50@N        106365.42     
:51@N        96328.724     
:52@N        68196.427     
:53@N        67459.866     
:55@N        87807.234     
:56@N        110484.04     
:57@N        107016.79     
:58@N        114756.53     
:59@N        105506.08     
:60@N        107813.95     
:61@N        70926.809     
:62@N        113671.78     
:63@N        96100.032     
:64@N        72655.89      
:65@N        88726.662     
:66@N        134836.63     
:67@N        50940.835     
:70@N        51656.057     

relax> relax_disp.exp_type(spectrum_id='800_866.67.in', exp_type='MQ CPMG')
Setting the '800_866.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_866.67.in', cpmg_frq=866.6666)
Setting the '800_866.67.in' spectrum CPMG frequency 866.6666 Hz.

relax> spectrometer.frequency(id='800_866.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_866.67.in', time=0.03)
Setting the '800_866.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/933.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_933.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/933.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         37352.107     
:2@N         101838.61     
:3@N         97262.363     
:4@N         171060.7      
:5@N         68222.732     
:6@N         20088.537     
:7@N         166355.51     
:8@N         97676.938     
:10@N        86660.169     
:11@N        152109.7      
:12@N        97436.125     
:13@N        163660.18     
:14@N        105466.26     
:15@N        85150.422     
:16@N        138511.09     
:17@N        110684.56     
:18@N        96062.157     
:19@N        111818.41     
:20@N        78711.9       
:21@N        71510.106     
:22@N        107233.29     
:23@N        111662.98     
:24@N        74340.412     
:25@N        97347.572     
:26@N        72862.516     
:27@N        -17619.079    
:28@N        169118.7      
:29@N        94498.223     
:30@N        21270.593     
:31@N        101917.78     
:32@N        101829.27     
:33@N        104549.45     
:34@N        90954.056     
:35@N        88224.733     
:36@N        85913.559     
:37@N        110333.33     
:38@N        90167.703     
:39@N        103414.21     
:40@N        76686.597     
:41@N        93485.345     
:42@N        114966.64     
:43@N        94737.239     
:44@N        128869.43     
:45@N        76347.827     
:46@N        98545.539     
:47@N        102004.24     
:48@N        104512.27     
:49@N        134048.56     
:50@N        106310.79     
:51@N        96641.586     
:52@N        68978.026     
:53@N        67069.548     
:55@N        88405.135     
:56@N        110638.23     
:57@N        107389.06     
:58@N        114968.93     
:59@N        105256.93     
:60@N        108336.76     
:61@N        71200.721     
:62@N        113746.75     
:63@N        96652.783     
:64@N        73245.215     
:65@N        89046.351     
:66@N        134784.98     
:67@N        52397.977     
:70@N        51189.967     

relax> relax_disp.exp_type(spectrum_id='800_933.33.in', exp_type='MQ CPMG')
Setting the '800_933.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_933.33.in', cpmg_frq=933.3333)
Setting the '800_933.33.in' spectrum CPMG frequency 933.3333 Hz.

relax> spectrometer.frequency(id='800_933.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_933.33.in', time=0.03)
Setting the '800_933.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/933.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_933.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/933.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         36472.306     
:2@N         101971.18     
:3@N         97304.184     
:4@N         171275.37     
:5@N         68376.479     
:6@N         20274.779     
:7@N         166284.12     
:8@N         97865.185     
:10@N        86344.88      
:11@N        152173.14     
:12@N        97337.27      
:13@N        163829.54     
:14@N        105100.2      
:15@N        85430.264     
:16@N        138420.99     
:17@N        110479.21     
:18@N        96317.914     
:19@N        111991.61     
:20@N        78391.994     
:21@N        71222.633     
:22@N        106994.18     
:23@N        111652.24     
:24@N        74342.65      
:25@N        96755.951     
:26@N        73652.165     
:27@N        -17236.668    
:28@N        169276.79     
:29@N        94679.506     
:30@N        21581.121     
:31@N        101978.64     
:32@N        102126.23     
:33@N        104309.82     
:34@N        90830.978     
:35@N        88574.97      
:36@N        86177.138     
:37@N        110783.13     
:38@N        90542.095     
:39@N        103704.42     
:40@N        76803.343     
:41@N        92692.069     
:42@N        114917.9      
:43@N        94831.133     
:44@N        128916.93     
:45@N        76338.028     
:46@N        98569.965     
:47@N        101516.67     
:48@N        104431.68     
:49@N        133543.94     
:50@N        105956.67     
:51@N        96336.905     
:52@N        68526.764     
:53@N        66968.694     
:55@N        87857.057     
:56@N        110981.69     
:57@N        106948.0      
:58@N        115054.04     
:59@N        105662.04     
:60@N        108468.61     
:61@N        70975.442     
:62@N        114396.45     
:63@N        96601.462     
:64@N        73202.381     
:65@N        88584.552     
:66@N        135045.56     
:67@N        52383.105     
:70@N        52254.914     

relax> relax_disp.exp_type(spectrum_id='800_933.33.in.bis', exp_type='MQ CPMG')
Setting the '800_933.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_933.33.in.bis', cpmg_frq=933.3333)
Setting the '800_933.33.in.bis' spectrum CPMG frequency 933.3333 Hz.

relax> spectrometer.frequency(id='800_933.33.in.bis', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_933.33.in.bis', time=0.03)
Setting the '800_933.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/1000.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_1000.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/1000.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         37940.861     
:2@N         101823.6      
:3@N         96963.681     
:4@N         171198.06     
:5@N         69560.678     
:6@N         20136.298     
:7@N         165964.18     
:8@N         97567.34      
:10@N        86358.552     
:11@N        151683.52     
:12@N        97128.786     
:13@N        163119.07     
:14@N        104893.27     
:15@N        84841.741     
:16@N        138139.88     
:17@N        110103.1      
:18@N        95557.729     
:19@N        111635.93     
:20@N        78545.039     
:21@N        71815.958     
:22@N        106590.94     
:23@N        111543.8      
:24@N        74312.504     
:25@N        96468.295     
:26@N        73500.144     
:27@N        -17383.767    
:28@N        168511.68     
:29@N        93831.803     
:30@N        21459.529     
:31@N        101803.65     
:32@N        102836.68     
:33@N        104488.9      
:34@N        90594.906     
:35@N        88639.484     
:36@N        85506.897     
:37@N        110550.11     
:38@N        90662.286     
:39@N        103826.26     
:40@N        76427.289     
:41@N        93457.325     
:42@N        114415.55     
:43@N        95065.867     
:44@N        128326.98     
:45@N        76056.732     
:46@N        97626.449     
:47@N        101722.71     
:48@N        104343.86     
:49@N        133504.99     
:50@N        105803.2      
:51@N        96253.587     
:52@N        70152.557     
:53@N        66816.081     
:55@N        88771.278     
:56@N        110373.6      
:57@N        106636.75     
:58@N        114424.37     
:59@N        105406.04     
:60@N        108733.15     
:61@N        72179.713     
:62@N        113829.53     
:63@N        96976.905     
:64@N        73992.686     
:65@N        88811.831     
:66@N        134954.84     
:67@N        54060.722     
:70@N        52727.575     

relax> relax_disp.exp_type(spectrum_id='800_1000.in', exp_type='MQ CPMG')
Setting the '800_1000.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_1000.in', cpmg_frq=1000.0)
Setting the '800_1000.in' spectrum CPMG frequency 1000.0 Hz.

relax> spectrometer.frequency(id='800_1000.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_1000.in', time=0.03)
Setting the '800_1000.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.replicated(spectrum_ids=['500_133.33.in', '500_133.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['500_533.33.in', '500_533.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['500_933.33.in', '500_933.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['800_133.33.in', '800_133.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['800_533.33.in', '800_533.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['800_933.33.in', '800_933.33.in.bis'])

relax> spectrum.error_analysis(subset=['500_reference.in', '500_66.667.in', '500_133.33.in', '500_133.33.in.bis', '500_200.in', '500_266.67.in', '500_333.33.in', '500_400.in', '500_466.67.in', '500_533.33.in', '500_533.33.in.bis', '500_600.in', '500_666.67.in', '500_733.33.in', '500_800.in', '500_866.67.in', '500_933.33.in', '500_933.33.in.bis', '500_1000.in'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Replicated spectra:  ['500_133.33.in', '500_133.33.in.bis']
Standard deviation:  132.165166899

Replicated spectra:  ['500_533.33.in', '500_533.33.in.bis']
Standard deviation:  139.49874291

Replicated spectra:  ['500_933.33.in', '500_933.33.in.bis']
Standard deviation:  103.633969846

Variance averaging over all spectra.
Standard deviation for all spins:  126.05227793927868

relax> spectrum.error_analysis(subset=['800_reference.in', '800_66.667.in', '800_133.33.in', '800_133.33.in.bis', '800_200.in', '800_266.67.in', '800_333.33.in', '800_400.in', '800_466.67.in', '800_533.33.in', '800_533.33.in.bis', '800_600.in', '800_666.67.in', '800_733.33.in', '800_800.in', '800_866.67.in', '800_933.33.in', '800_933.33.in.bis', '800_1000.in'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Replicated spectra:  ['800_133.33.in', '800_133.33.in.bis']
Standard deviation:  226.967929887

Replicated spectra:  ['800_533.33.in', '800_533.33.in.bis']
Standard deviation:  306.07281816

Replicated spectra:  ['800_933.33.in', '800_933.33.in.bis']
Standard deviation:  246.494959217

Variance averaging over all spectra.
Standard deviation for all spins:  168.97383359147142

relax> deselect.read(file='unresolved', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz', spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, boolean='AND', change_all=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/unresolved' for reading.
The following spins were deselected:
:9@N
:27@N
:28@N
:30@N
:54@N
:68@N
:69@N

relax> deselect.read(file='unresolved', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz', spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, boolean='AND', change_all=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/unresolved' for reading.
The following spins were deselected:
:9@N
:54@N
:68@N
:69@N

relax> select.spin(spin_id=':70-71', boolean='OR', change_all=True)

relax> pipe.copy(pipe_from='base pipe', pipe_to='R2eff', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='R2eff')

relax> relax_disp.select_model(model='R2eff')
R2eff/R1rho value and error determination.

relax> calc(verbosity=1)
Calculating the R2eff/R1rho values for fixed relaxation time period data.
Spin ':70@N'.
Spin ':71@N'.

relax> pipe.copy(pipe_from='base pipe', pipe_to='MQ CR72', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='MQ CR72')

relax> relax_disp.select_model(model='MQ CR72')
The Carver and Richards (1972) 2-site model for all time scales expanded for MQ CPMG data by Korzhnev et al., 2004.

relax> value.copy(pipe_from='R2eff', pipe_to='MQ CR72', param='r2eff')

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [         0.7011,          0.9465,           5.577,               0,            0.99,       0.1765993]    fk: 84.7936676381       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~
RelaxWarning: invalid value encountered in sqrt
RelaxWarning: invalid value encountered in sqrt

	k: 0        xk: [         0.7011,          0.9465,           5.577,         0.00025,            0.99,       0.1765993]    fk: 84.8219934861       
	k: 100      xk: [   0.6980351578,      0.94570156,     5.608502283, 0.0003498448775,    0.9897462962,      0.17505706]    fk: 55.0574455162       
	k: 200      xk: [   0.6934512512,    0.9385550803,     5.643832054, 0.0003622355116,    0.9896984379,    0.1738942605]    fk: 54.4591053181       
	k: 300      xk: [   0.6928610685,    0.9356369028,     5.662959332, 0.0002261080468,    0.9897252392,    0.1748232598]    fk: 54.3235281087       
	k: 400      xk: [   0.6929993953,    0.9340762842,     5.674016018, 0.0001128109729,    0.9897557454,    0.1757113411]    fk: 54.283686027        

	Parameter values: [0.69606234566032099, 0.9394701537053548, 5.6733155903105237, 0.00038782124459553014, 0.98971661473195449, 0.1719425532312889]
	Function value:   54.087263446145705
	Iterations:       500
	Function calls:   798
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.6960623457,    0.9394701537,      5.67331559, 0.0003878212446,    0.9897166147,    0.1719425532]    fk: 54.0637222352       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960623457,    0.9394701537,      5.67331559, 0.0004072123068,    0.9897166147,    0.1719425532]    fk: 54.0635942575       
	k: 100      xk: [   0.6961733289,     0.939440561,     5.672389008,  0.000403330236,    0.9897185356,     0.172079672]    fk: 54.0631899462       
	k: 200      xk: [   0.6946383333,    0.9372949935,     5.677189452,    0.1670857825,    0.9897234346,     0.172091326]    fk: 53.82865457         
	k: 300      xk: [   0.6902415017,    0.9328304963,     5.622722977,    0.2888833811,    0.9895906211,    0.1727552668]    fk: 53.328810169        
	k: 400      xk: [   0.6898792171,    0.9295711718,      5.62940218,    0.3175518509,    0.9895166675,    0.1715154067]    fk: 52.9719768886       

	Parameter values: [0.68754655087708105, 0.91483447247706717, 5.5864640978088644, 0.40841589439878634, 0.98944448311457656, 0.1770795226677363]
	Function value:   52.423298598265639
	Iterations:       500
	Function calls:   775
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.6875465509,    0.9148344725,     5.586464098,    0.4084158944,    0.9894444831,    0.1770795227]    fk: 52.4313931438       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6875465509,    0.9148344725,     5.586464098,    0.4084158944,    0.9894444831,    0.1770795227]    fk: 52.4237511852       
	k: 100      xk: [   0.6826234682,    0.9121113189,     5.654283395,    0.4082629318,    0.9894709386,    0.1735926646]    fk: 51.7783099612       
	k: 200      xk: [   0.6834972895,    0.9154930677,     5.641999435,    0.4083081512,    0.9894250426,    0.1715210327]    fk: 51.7213275887       
	k: 300      xk: [   0.6836668185,    0.9153478011,     5.639174326,     0.410089474,    0.9894222181,    0.1716451301]    fk: 51.7029292651       
	k: 400      xk: [   0.6834897735,    0.9153213806,      5.64063522,    0.4100955804,    0.9894232615,    0.1716078023]    fk: 51.7022723155       

	Parameter values: [0.68346672805611641, 0.9153493976177578, 5.6405494361808479, 0.4100954356708757, 0.98942270834440205, 0.17157773523862341]
	Function value:   51.702215113184707
	Iterations:       500
	Function calls:   821
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.6834667281,    0.9153493976,     5.640549436,    0.4100954357,    0.9894227083,    0.1715777352]    fk: 51.7022196638       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834667281,    0.9153493976,     5.640549436,    0.4100954357,    0.9894227083,    0.1715777352]    fk: 51.7022196183       
	k: 100      xk: [   0.6835174713,    0.9153824604,     5.640563595,    0.4100961413,    0.9894221697,    0.1715373796]    fk: 51.7020847216       
	k: 200      xk: [   0.6835203522,     0.915423797,     5.640580496,    0.4100961319,    0.9894211558,    0.1714846534]    fk: 51.7020478909       
	k: 300      xk: [   0.6835205287,    0.9154227518,     5.640580206,     0.410096136,    0.9894211657,    0.1714854307]    fk: 51.7020478747       
	k: 400      xk: [   0.6835205321,    0.9154227838,     5.640580211,    0.4100961359,    0.9894211656,    0.1714854142]    fk: 51.7020478747       

	Parameter values: [0.68352053205294716, 0.91542278376273711, 5.6405802109920504, 0.4100961359102886, 0.98942116563650151, 0.17148541420418212]
	Function value:   51.702047874673177
	Iterations:       420
	Function calls:   841
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.6835205321,    0.9154227838,     5.640580211,    0.4100961359,    0.9894211656,    0.1714854142]    fk: 51.7020479202       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835205321,    0.9154227838,     5.640580211,    0.4100961359,    0.9894211656,    0.1714854142]    fk: 51.7020479197       
	k: 100      xk: [   0.6835205321,    0.9154227838,     5.640580211,    0.4100961359,    0.9894211656,    0.1714854142]    fk: 51.7020479197       
	k: 200      xk: [   0.6835217239,     0.915422027,     5.640580347,    0.4100961397,     0.989421185,    0.1714861436]    fk: 51.7020478587       
	k: 300      xk: [   0.6835223156,    0.9154222259,     5.640580394,    0.4100961403,    0.9894211881,    0.1714862197]    fk: 51.7020478499       
	k: 400      xk: [   0.6835223128,     0.915422229,     5.640580393,    0.4100961403,     0.989421188,     0.171486218]    fk: 51.7020478499       

	Parameter values: [0.68352231283409326, 0.91542222895823488, 5.6405803934430656, 0.41009614029686681, 0.98942118802922718, 0.17148621803603892]
	Function value:   51.702047849883343
	Iterations:       430
	Function calls:   867
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6835223128,     0.915422229,     5.640580393,    0.4100961403,     0.989421188,     0.171486218]    fk: 51.7020478504       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835223128,     0.915422229,     5.640580393,    0.4100961403,     0.989421188,     0.171486218]    fk: 51.7020478503       
	k: 100      xk: [   0.6835223128,     0.915422229,     5.640580393,    0.4100961403,     0.989421188,     0.171486218]    fk: 51.7020478503       
	k: 200      xk: [   0.6835209784,    0.9154200585,     5.640580431,    0.4100961462,    0.9894212023,    0.1714877132]    fk: 51.7020477842       
	k: 300      xk: [   0.6835206739,    0.9154187997,     5.640580523,    0.4100961491,    0.9894212053,    0.1714885039]    fk: 51.7020477672       

	Parameter values: [0.68352067901475477, 0.91541880778047569, 5.6405805231249779, 0.4100961490783529, 0.98942120524499111, 0.17148850040878619]
	Function value:   51.702047767228514
	Iterations:       390
	Function calls:   784
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    0.683520679,    0.9154188078,     5.640580523,    0.4100961491,    0.9894212052,    0.1714885004]    fk: 51.7020477673       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.683520679,    0.9154188078,     5.640580523,    0.4100961491,    0.9894212052,    0.1714885004]    fk: 51.7020477672       
	k: 100      xk: [    0.683520679,    0.9154188078,     5.640580523,    0.4100961491,    0.9894212052,    0.1714885004]    fk: 51.7020477672       
	k: 200      xk: [   0.6835202401,    0.9154177202,     5.640580622,    0.4100961526,     0.989421216,    0.1714893393]    fk: 51.7020477572       
	k: 300      xk: [   0.6835201528,    0.9154175283,     5.640580637,    0.4100961533,     0.989421218,    0.1714894867]    fk: 51.7020477569       

	Parameter values: [0.68352015284509093, 0.91541752832207157, 5.6405806371907765, 0.41009615329186655, 0.9894212179835371, 0.17148948673703895]
	Function value:   51.702047756904591
	Iterations:       336
	Function calls:   721
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6835201528,    0.9154175283,     5.640580637,    0.4100961533,     0.989421218,    0.1714894867]    fk: 51.7020477569       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835201528,    0.9154175283,     5.640580637,    0.4100961533,     0.989421218,    0.1714894867]    fk: 51.7020477569       
	k: 100      xk: [   0.6835201528,    0.9154175283,     5.640580637,    0.4100961533,     0.989421218,    0.1714894867]    fk: 51.7020477569       
	k: 200      xk: [   0.6835210763,    0.9154183794,     5.640580708,    0.4100961527,    0.9894212237,    0.1714891903]    fk: 51.702047733        
	k: 300      xk: [   0.6835213364,    0.9154186045,     5.640580732,    0.4100961528,    0.9894212262,    0.1714891278]    fk: 51.7020477303       

	Parameter values: [0.68352133641673563, 0.91541860446324896, 5.6405807318046559, 0.41009615276909006, 0.98942122615115291, 0.17148912777085945]
	Function value:   51.702047730348603
	Iterations:       370
	Function calls:   757
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6835213364,    0.9154186045,     5.640580732,    0.4100961528,    0.9894212262,    0.1714891278]    fk: 51.7020477304       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835213364,    0.9154186045,     5.640580732,    0.4100961528,    0.9894212262,    0.1714891278]    fk: 51.7020477303       
	k: 100      xk: [   0.6835213364,    0.9154186045,     5.640580732,    0.4100961528,    0.9894212262,    0.1714891278]    fk: 51.7020477303       
	k: 200      xk: [   0.6835216125,      0.91541824,     5.640580816,    0.4100961528,    0.9894212246,    0.1714891907]    fk: 51.7020477274       
	k: 300      xk: [   0.6835215765,    0.9154182711,     5.640580807,    0.4100961528,    0.9894212247,    0.1714891876]    fk: 51.702047727        

	Parameter values: [0.68352157651306356, 0.91541827105805607, 5.6405808071462147, 0.41009615283700374, 0.98942122471430693, 0.17148918760756812]
	Function value:   51.702047727026333
	Iterations:       351
	Function calls:   754
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.6835215765,    0.9154182711,     5.640580807,    0.4100961528,    0.9894212247,    0.1714891876]    fk: 51.702047727        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835215765,    0.9154182711,     5.640580807,    0.4100961528,    0.9894212247,    0.1714891876]    fk: 51.702047727        
	k: 100      xk: [   0.6835215765,    0.9154182711,     5.640580807,    0.4100961528,    0.9894212247,    0.1714891876]    fk: 51.702047727        
	k: 200      xk: [   0.6835213702,    0.9154180467,     5.640580804,    0.4100961538,    0.9894212278,    0.1714894205]    fk: 51.7020477252       
	k: 300      xk: [   0.6835213719,    0.9154181079,     5.640580802,    0.4100961539,    0.9894212286,     0.171489431]    fk: 51.702047725        

	Parameter values: [0.68352137190368856, 0.91541810789770262, 5.6405808018971246, 0.41009615394148791, 0.98942122860244552, 0.17148943095397789]
	Function value:   51.70204772497398
	Iterations:       350
	Function calls:   733
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [   0.6835213719,    0.9154181079,     5.640580802,    0.4100961539,    0.9894212286,     0.171489431]    fk: 51.702047725        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835213719,    0.9154181079,     5.640580802,    0.4100961539,    0.9894212286,     0.171489431]    fk: 51.702047725        
	k: 100      xk: [   0.6835213719,    0.9154181079,     5.640580802,    0.4100961539,    0.9894212286,     0.171489431]    fk: 51.702047725        
	k: 200      xk: [   0.6835213719,    0.9154181079,     5.640580802,    0.4100961539,    0.9894212286,     0.171489431]    fk: 51.702047725        
	k: 300      xk: [   0.6835213077,    0.9154180315,     5.640580801,    0.4100961541,    0.9894212286,    0.1714894798]    fk: 51.7020477249       

	Parameter values: [0.68352130769296948, 0.91541803154315848, 5.640580801226637, 0.41009615410306677, 0.9894212286362386, 0.17148947977181561]
	Function value:   51.702047724855134
	Iterations:       367
	Function calls:   772
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [   0.6835213077,    0.9154180315,     5.640580801,    0.4100961541,    0.9894212286,    0.1714894798]    fk: 51.7020477249       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835213077,    0.9154180315,     5.640580801,    0.4100961541,    0.9894212286,    0.1714894798]    fk: 51.7020477249       
	k: 100      xk: [   0.6835213077,    0.9154180315,     5.640580801,    0.4100961541,    0.9894212286,    0.1714894798]    fk: 51.7020477249       
	k: 200      xk: [   0.6835213734,     0.915417939,     5.640580827,    0.4100961544,    0.9894212298,    0.1714895537]    fk: 51.7020477237       
	k: 300      xk: [   0.6835215302,    0.9154176196,     5.640580903,    0.4100961554,    0.9894212323,    0.1714897802]    fk: 51.7020477223       

	Parameter values: [0.68352153022083062, 0.91541761958834511, 5.6405809029336318, 0.41009615535416044, 0.98942123225697332, 0.17148978016111113]
	Function value:   51.702047722305196
	Iterations:       385
	Function calls:   801
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [   0.6835215302,    0.9154176196,     5.640580903,    0.4100961554,    0.9894212323,    0.1714897802]    fk: 51.7020477223       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835215302,    0.9154176196,     5.640580903,    0.4100961554,    0.9894212323,    0.1714897802]    fk: 51.7020477223       
	k: 100      xk: [   0.6835215302,    0.9154176196,     5.640580903,    0.4100961554,    0.9894212323,    0.1714897802]    fk: 51.7020477223       
	k: 200      xk: [   0.6835214804,     0.915417691,     5.640580896,     0.410096156,    0.9894212366,    0.1714898704]    fk: 51.7020477221       
	k: 300      xk: [   0.6835214709,      0.91541761,     5.640580899,    0.4100961559,    0.9894212354,    0.1714898649]    fk: 51.7020477217       

	Parameter values: [0.68352147093199522, 0.91541760999587074, 5.6405808989177952, 0.41009615588059856, 0.98942123535215054, 0.17148986485564838]
	Function value:   51.70204772170959
	Iterations:       334
	Function calls:   728
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [   0.6835214709,      0.91541761,     5.640580899,    0.4100961559,    0.9894212354,    0.1714898649]    fk: 51.7020477217       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835214709,      0.91541761,     5.640580899,    0.4100961559,    0.9894212354,    0.1714898649]    fk: 51.7020477217       
	k: 100      xk: [   0.6835214709,      0.91541761,     5.640580899,    0.4100961559,    0.9894212354,    0.1714898649]    fk: 51.7020477217       
	k: 200      xk: [   0.6835214609,    0.9154174548,     5.640580909,    0.4100961557,    0.9894212333,    0.1714898524]    fk: 51.7020477214       
	k: 300      xk: [    0.683521472,      0.91541746,     5.640580912,    0.4100961557,    0.9894212336,    0.1714898605]    fk: 51.7020477214       

	Parameter values: [0.68352147199506463, 0.9154174599608127, 5.6405809115532293, 0.41009615572425029, 0.98942123361235113, 0.17148986045612791]
	Function value:   51.702047721344293
	Iterations:       328
	Function calls:   733
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 14       xk: [    0.683521472,      0.91541746,     5.640580912,    0.4100961557,    0.9894212336,    0.1714898605]    fk: 51.7020477213       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.683521472,      0.91541746,     5.640580912,    0.4100961557,    0.9894212336,    0.1714898605]    fk: 51.7020477213       
	k: 100      xk: [    0.683521472,      0.91541746,     5.640580912,    0.4100961557,    0.9894212336,    0.1714898605]    fk: 51.7020477213       
	k: 200      xk: [    0.683521475,    0.9154175837,     5.640580907,     0.410096156,    0.9894212357,    0.1714898851]    fk: 51.7020477211       
	k: 300      xk: [   0.6835214664,    0.9154175602,     5.640580908,    0.4100961559,     0.989421235,    0.1714898804]    fk: 51.7020477209       

	Parameter values: [0.68352146642596279, 0.91541756023917875, 5.6405809077660098, 0.41009615590144743, 0.98942123499708456, 0.17148988044649249]
	Function value:   51.702047720900104
	Iterations:       346
	Function calls:   758
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 15       xk: [   0.6835214664,    0.9154175602,     5.640580908,    0.4100961559,     0.989421235,    0.1714898804]    fk: 51.7020477209       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835214664,    0.9154175602,     5.640580908,    0.4100961559,     0.989421235,    0.1714898804]    fk: 51.7020477209       
	k: 100      xk: [   0.6835214664,    0.9154175602,     5.640580908,    0.4100961559,     0.989421235,    0.1714898804]    fk: 51.7020477209       
	k: 200      xk: [   0.6835214664,    0.9154175602,     5.640580908,    0.4100961559,     0.989421235,    0.1714898804]    fk: 51.7020477209       
	k: 300      xk: [   0.6835213415,    0.9154175732,       5.6405809,    0.4100961562,     0.989421236,    0.1714899395]    fk: 51.7020477201       
	k: 400      xk: [   0.6835213546,    0.9154176037,       5.6405809,    0.4100961562,    0.9894212362,    0.1714899315]    fk: 51.7020477201       

	Parameter values: [0.68352135459959218, 0.9154176037182129, 5.6405808997856095, 0.41009615616755668, 0.9894212362360324, 0.17148993151281816]
	Function value:   51.702047720051866
	Iterations:       420
	Function calls:   831
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 16       xk: [   0.6835213546,    0.9154176037,       5.6405809,    0.4100961562,    0.9894212362,    0.1714899315]    fk: 51.7020477201       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835213546,    0.9154176037,       5.6405809,    0.4100961562,    0.9894212362,    0.1714899315]    fk: 51.7020477201       
	k: 100      xk: [   0.6835213546,    0.9154176037,       5.6405809,    0.4100961562,    0.9894212362,    0.1714899315]    fk: 51.7020477201       
	k: 200      xk: [   0.6835212266,    0.9154173418,     5.640580909,    0.4100961566,    0.9894212371,    0.1714900433]    fk: 51.702047719        
	k: 300      xk: [   0.6835212613,    0.9154173525,      5.64058091,    0.4100961564,    0.9894212366,    0.1714900006]    fk: 51.7020477187       

	Parameter values: [0.68352126128875756, 0.91541735253335421, 5.6405809095085999, 0.41009615642416586, 0.98942123664787474, 0.17149000059427305]
	Function value:   51.702047718673214
	Iterations:       339
	Function calls:   738
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 17       xk: [   0.6835212613,    0.9154173525,      5.64058091,    0.4100961564,    0.9894212366,    0.1714900006]    fk: 51.7020477187       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835212613,    0.9154173525,      5.64058091,    0.4100961564,    0.9894212366,    0.1714900006]    fk: 51.7020477187       
	k: 100      xk: [   0.6835212613,    0.9154173525,      5.64058091,    0.4100961564,    0.9894212366,    0.1714900006]    fk: 51.7020477187       
	k: 200      xk: [   0.6835213002,    0.9154171539,     5.640580944,    0.4100961569,     0.989421238,    0.1714901193]    fk: 51.7020477184       
	k: 300      xk: [   0.6835212579,    0.9154170715,     5.640580946,    0.4100961569,    0.9894212374,    0.1714901386]    fk: 51.7020477182       

	Parameter values: [0.68352125785364004, 0.91541707149006923, 5.6405809456880664, 0.41009615692737811, 0.98942123739679122, 0.17149013860315909]
	Function value:   51.702047718202778
	Iterations:       339
	Function calls:   733
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 18       xk: [   0.6835212579,    0.9154170715,     5.640580946,    0.4100961569,    0.9894212374,    0.1714901386]    fk: 51.7020477182       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835212579,    0.9154170715,     5.640580946,    0.4100961569,    0.9894212374,    0.1714901386]    fk: 51.7020477182       
	k: 100      xk: [   0.6835212579,    0.9154170715,     5.640580946,    0.4100961569,    0.9894212374,    0.1714901386]    fk: 51.7020477182       
	k: 200      xk: [   0.6835212579,    0.9154170715,     5.640580946,    0.4100961569,    0.9894212374,    0.1714901386]    fk: 51.7020477182       
	k: 300      xk: [   0.6835212665,    0.9154171008,     5.640580944,    0.4100961569,    0.9894212373,    0.1714901257]    fk: 51.7020477182       

	Parameter values: [0.68352126648715217, 0.91541710081237826, 5.6405809436122745, 0.41009615687393192, 0.98942123725674413, 0.17149012569066299]
	Function value:   51.702047718167591
	Iterations:       350
	Function calls:   769
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 19       xk: [   0.6835212665,    0.9154171008,     5.640580944,    0.4100961569,    0.9894212373,    0.1714901257]    fk: 51.7020477182       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835212665,    0.9154171008,     5.640580944,    0.4100961569,    0.9894212373,    0.1714901257]    fk: 51.7020477182       
	k: 100      xk: [   0.6835212665,    0.9154171008,     5.640580944,    0.4100961569,    0.9894212373,    0.1714901257]    fk: 51.7020477182       
	k: 200      xk: [   0.6835212665,    0.9154171008,     5.640580944,    0.4100961569,    0.9894212373,    0.1714901257]    fk: 51.7020477182       
	k: 300      xk: [   0.6835212727,    0.9154170989,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       

	Parameter values: [0.6835212726813058, 0.91541709893050671, 5.6405809451849063, 0.41009615687016276, 0.98942123714605557, 0.17149012743148456]
	Function value:   51.702047718145415
	Iterations:       315
	Function calls:   683
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 20       xk: [   0.6835212727,    0.9154170989,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477182       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835212727,    0.9154170989,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       
	k: 100      xk: [   0.6835212727,    0.9154170989,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       
	k: 200      xk: [   0.6835212727,    0.9154170989,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       
	k: 300      xk: [   0.6835212727,    0.9154170993,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       

	Parameter values: [0.68352127266373541, 0.91541709931436843, 5.640580945145679, 0.41009615687015222, 0.98942123714791297, 0.17149012738171387]
	Function value:   51.702047718131723
	Iterations:       351
	Function calls:   730
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 21       xk: [   0.6835212727,    0.9154170993,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835212727,    0.9154170993,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       
	k: 100      xk: [   0.6835212727,    0.9154170993,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       
	k: 200      xk: [   0.6835212727,    0.9154170993,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       
	k: 300      xk: [   0.6835212727,    0.9154170993,     5.640580945,    0.4100961569,    0.9894212371,    0.1714901274]    fk: 51.7020477181       

	Parameter values: [0.68352127266373541, 0.91541709931436843, 5.640580945145679, 0.41009615687015222, 0.98942123714791297, 0.17149012738171387]
	Function value:   51.702047718131723
	Iterations:       332
	Function calls:   708
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.68352127266373541, 0.91541709931436843, 5.640580945145679, 0.41009615687015222, 0.98942123714791297, 0.17149012738171387]
Function value:   51.702047718131723
Iterations:       8353
Function calls:   16835
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.835212726637354
r2 (800.000 MHz):            9.154170993143683
dw:                          5.640580945145679
dwH:                         0.410096156870152
pA:                          0.989421237147913
kex:                      1714.901273817138645


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [         0.4978,               1,            4.46,               0,           0.997,       0.1879584]    fk: 11.5396575216       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [         0.4978,               1,            4.46,         0.00025,           0.997,       0.1879584]    fk: 11.5842966509       
	k: 100      xk: [   0.4981008958,     1.009600894,     4.536939232, 0.0002272208653,    0.9967525993,      0.18666952]    fk: 5.52872434865       
	k: 200      xk: [   0.4984199835,     1.006573568,     4.661744299, 0.0004269353361,    0.9968947805,    0.1822798402]    fk: 5.52493021827       
	k: 300      xk: [   0.4988036738,     1.493971273,     4.520057131,  0.005463089049,     0.996758491,     0.184346012]    fk: 5.49675897483       
	k: 400      xk: [   0.4979611016,     13.88958585,     4.514843212,    0.1402616713,    0.9967279555,    0.1863362475]    fk: 5.44846162005       

	Parameter values: [0.49796154940703485, 13.872684152992477, 4.5133172062785327, 0.14007518796418794, 0.99672627176358741, 0.18636793076492586]
	Function value:   5.4484609414590954
	Iterations:       500
	Function calls:   798
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4979615494,     13.87268415,     4.513317206,     0.140075188,    0.9967262718,    0.1863679308]    fk: 5.48299327689       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979615494,     13.87268415,     4.513317206,    0.1470789474,    0.9967262718,    0.1863679308]    fk: 5.48258909723       
	k: 100      xk: [   0.4976063475,     1.871341618,     4.560632323,    0.2279961048,    0.9967752802,    0.1842843181]    fk: 5.4814046336        
	k: 200      xk: [   0.4913198372,     2.272812487,     4.363913935,    0.6236762443,    0.9964491327,    0.1874953964]    fk: 5.47020649494       
	k: 300      xk: [   0.4903866372,     5.248180028,     4.387405999,    0.6578868466,    0.9964626224,    0.1855438227]    fk: 5.46543608966       
	k: 400      xk: [   0.4907056415,     19.11368119,      4.43065591,    0.6584899949,    0.9965238715,     0.183406747]    fk: 5.46388155654       

	Parameter values: [0.49069186877930027, 19.19026428868375, 4.4310911136878133, 0.65862327938545739, 0.99652416875982475, 0.18343304408018279]
	Function value:   5.4638712598669716
	Iterations:       500
	Function calls:   815
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4906918688,     19.19026429,     4.431091114,    0.6586232794,    0.9965241688,    0.1834330441]    fk: 5.46420253989       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4906918688,     19.19026429,     4.431091114,    0.6586232794,    0.9965241688,    0.1834330441]    fk: 5.46419922709       
	k: 100      xk: [   0.4908543755,     19.22188871,      4.43105809,    0.6586000613,    0.9965301756,    0.1830234078]    fk: 5.46385284326       
	k: 200      xk: [   0.4909021899,     19.20373635,     4.431065168,    0.6586128646,    0.9965314783,    0.1828955486]    fk: 5.46384081257       
	k: 300      xk: [    0.490900263,     19.20280291,     4.431067428,    0.6586130228,    0.9965314424,    0.1829029649]    fk: 5.46384077051       
	k: 400      xk: [   0.4909003745,     19.18979758,      4.43107779,     0.658612899,    0.9965314813,    0.1829013956]    fk: 5.46384056418       

	Parameter values: [0.49086101615088429, 0.44909598529980777, 4.4430667710453484, 0.65851620975235492, 0.99654439477633527, 0.18267453451369337]
	Function value:   5.4636297770158446
	Iterations:       500
	Function calls:   802
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.4908610162,    0.4490959853,     4.443066771,    0.6585162098,    0.9965443948,    0.1826745345]    fk: 5.46360530415       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4908610162,    0.4715507846,     4.443066771,    0.6585162098,    0.9965443948,    0.1826745345]    fk: 5.46363248408       
	k: 100      xk: [   0.4909489665,    0.4620071302,     4.443067474,    0.6585180862,    0.9965468159,    0.1825090612]    fk: 5.4635874759        
	k: 200      xk: [   0.4909402146,    0.5958377594,     4.443124115,     0.658514311,    0.9965466309,    0.1825408833]    fk: 5.46358650907       
	k: 300      xk: [   0.4909741073,     19.91634703,     4.451353476,    0.6579949883,    0.9965568778,     0.182329137]    fk: 5.46345961927       
	k: 400      xk: [   0.4909841266,     19.99822293,     4.451394483,    0.6579926412,     0.996557255,    0.1822760155]    fk: 5.46345796789       

	Parameter values: [0.49098345208566285, 19.996477758428938, 4.4514048386981244, 0.65799196933364712, 0.99655725392732553, 0.18227927170457592]
	Function value:   5.4634578061962227
	Iterations:       500
	Function calls:   800
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.4909834521,     19.99647776,     4.451404839,    0.6579919693,    0.9965572539,    0.1822792717]    fk: 5.46345779158       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4909834521,     19.99647776,     4.451404839,    0.6579919693,    0.9965572539,    0.1822792717]    fk: 5.46345778545       
	k: 100      xk: [   0.4912558131,     19.97789477,     4.549861435,    0.6577245455,    0.9966738086,    0.1794334453]    fk: 5.46259804712       
	k: 200      xk: [   0.4912808185,     19.97925436,     4.542811385,    0.6577427026,    0.9966670416,    0.1794296789]    fk: 5.46257266823       
	k: 300      xk: [   0.4912709903,     19.99969577,     4.543141276,    0.6580292477,    0.9966672163,    0.1794341145]    fk: 5.46255201862       
	k: 400      xk: [   0.4912704085,     19.99999974,     4.542882702,    0.6580337251,    0.9966669264,    0.1794320071]    fk: 5.46255161127       

	Parameter values: [0.49127050133467576, 19.999999908928114, 4.5429089966040976, 0.65803371567778757, 0.99666695749930323, 0.17943110125977546]
	Function value:   5.4625516111058081
	Iterations:       500
	Function calls:   953
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 5        xk: [   0.4912705013,     19.99999991,     4.542908997,    0.6580337157,    0.9966669575,    0.1794311013]    fk: 5.46255160985       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912705013,     19.99999991,     4.542908997,    0.6580337157,    0.9966669575,    0.1794311013]    fk: 5.46255160985       
	k: 100      xk: [   0.4912705013,     19.99999991,     4.542908997,    0.6580337157,    0.9966669575,    0.1794311013]    fk: 5.46255160985       
	k: 200      xk: [   0.4912693218,              20,      4.54295724,    0.6580340179,    0.9966669866,    0.1794343984]    fk: 5.46255159855       
	k: 300      xk: [   0.4912762568,     19.99983829,     4.544320645,    0.6580455112,    0.9966686558,    0.1793769506]    fk: 5.46255103407       
	k: 400      xk: [   0.4912793638,     19.99970885,     4.545605163,    0.6580554819,    0.9966700896,     0.179342794]    fk: 5.46255080028       

	Parameter values: [0.4912910159342434, 19.999998715260929, 4.5488649572286164, 0.65815834376601512, 0.99667388776836097, 0.1792395423600614]
	Function value:   5.4625468500762535
	Iterations:       500
	Function calls:   835
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 6        xk: [   0.4912910159,     19.99999872,     4.548864957,    0.6581583438,    0.9966738878,    0.1792395424]    fk: 5.46254699639       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912910159,     19.99999872,     4.548864957,    0.6581583438,    0.9966738878,    0.1792395424]    fk: 5.46254685007       
	k: 100      xk: [   0.4912818869,     19.99998119,     4.548219673,    0.6581584148,    0.9966730157,    0.1792736826]    fk: 5.46254576916       
	k: 200      xk: [    0.491275887,     19.99998744,     4.544502079,    0.6581537707,    0.9966688725,    0.1793834119]    fk: 5.46254348579       
	k: 300      xk: [   0.4912679163,     19.99999999,     4.543373208,    0.6581539983,    0.9966674245,    0.1794183988]    fk: 5.46254295326       
	k: 400      xk: [   0.4912680175,              20,     4.543331058,    0.6581539139,    0.9966673817,    0.1794192985]    fk: 5.46254295275       

	Parameter values: [0.49126801745173276, 19.999999997605563, 4.5433310577890289, 0.6581539139192456, 0.99666738166213453, 0.17941929852178812]
	Function value:   5.4625429527476008
	Iterations:       500
	Function calls:   996
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 7        xk: [   0.4912680175,              20,     4.543331058,    0.6581539139,    0.9966673817,    0.1794192985]    fk: 5.46254295275       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912680175,              20,     4.543331058,    0.6581539139,    0.9966673817,    0.1794192985]    fk: 5.46254295275       
	k: 100      xk: [   0.4912686502,     19.99999762,     4.543346857,    0.6581539129,    0.9966674138,    0.1794174376]    fk: 5.46254294808       
	k: 200      xk: [   0.4912688352,     19.99999634,      4.54352953,    0.6581545406,     0.996667614,    0.1794123682]    fk: 5.46254292377       
	k: 300      xk: [   0.4912714805,     19.99999972,      4.54410289,    0.6581567577,    0.9966683066,     0.179391072]    fk: 5.46254286096       
	k: 400      xk: [   0.4912719775,              20,     4.544162118,    0.6581569719,    0.9966683808,    0.1793882841]    fk: 5.46254285934       

	Parameter values: [0.49127197749937912, 19.999999998437175, 4.5441621176144356, 0.65815697194261435, 0.99666838084951981, 0.17938828408403407]
	Function value:   5.4625428593384537
	Iterations:       469
	Function calls:   931
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4912719775,              20,     4.544162118,    0.6581569719,    0.9966683808,    0.1793882841]    fk: 5.46254285934       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912719775,              20,     4.544162118,    0.6581569719,    0.9966683808,    0.1793882841]    fk: 5.46254285934       
	k: 100      xk: [   0.4912719775,              20,     4.544162118,    0.6581569719,    0.9966683808,    0.1793882841]    fk: 5.46254285934       
	k: 200      xk: [   0.4912715277,              20,       4.5441511,    0.6581569558,    0.9966683593,    0.1793899941]    fk: 5.46254285859       

	Parameter values: [0.49127152778508459, 19.999999998565613, 4.5441510994330985, 0.65815695583164135, 0.99666835928345487, 0.17938999424074575]
	Function value:   5.4625428585936069
	Iterations:       290
	Function calls:   677
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4912715278,              20,     4.544151099,    0.6581569558,    0.9966683593,    0.1793899942]    fk: 5.4625428586        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912715278,              20,     4.544151099,    0.6581569558,    0.9966683593,    0.1793899942]    fk: 5.46254285859       
	k: 100      xk: [   0.4912715278,              20,     4.544151099,    0.6581569558,    0.9966683593,    0.1793899942]    fk: 5.46254285859       
	k: 200      xk: [   0.4912726057,              20,     4.544068328,    0.6581568701,    0.9966682913,    0.1793890327]    fk: 5.46254284783       
	k: 300      xk: [   0.4912726006,              20,     4.544068774,    0.6581568707,    0.9966682916,    0.1793890184]    fk: 5.46254284782       

	Parameter values: [0.49127260062162625, 19.999999997830535, 4.5440687739245398, 0.65815687073014151, 0.99666829162067128, 0.17938901843488358]
	Function value:   5.4625428478217772
	Iterations:       320
	Function calls:   703
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [   0.4912726006,              20,     4.544068774,    0.6581568707,    0.9966682916,    0.1793890184]    fk: 5.46254284783       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912726006,              20,     4.544068774,    0.6581568707,    0.9966682916,    0.1793890184]    fk: 5.46254284782       
	k: 100      xk: [   0.4912726006,              20,     4.544068774,    0.6581568707,    0.9966682916,    0.1793890184]    fk: 5.46254284782       
	k: 200      xk: [   0.4912702487,     19.99999987,     4.543938011,    0.6581567521,     0.996668102,     0.179400747]    fk: 5.46254283295       
	k: 300      xk: [   0.4912699573,              20,      4.54390646,    0.6581567678,    0.9966680497,    0.1794000985]    fk: 5.46254282161       
	k: 400      xk: [   0.4912699705,              20,     4.543907497,    0.6581567681,    0.9966680514,    0.1794000516]    fk: 5.4625428216        

	Parameter values: [0.49126997052207139, 19.999999998709384, 4.543907497373004, 0.65815676810168544, 0.99666805138439241, 0.17940005163395978]
	Function value:   5.4625428215984666
	Iterations:       428
	Function calls:   880
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [   0.4912699705,              20,     4.543907497,    0.6581567681,    0.9966680514,    0.1794000516]    fk: 5.4625428216        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912699705,              20,     4.543907497,    0.6581567681,    0.9966680514,    0.1794000516]    fk: 5.4625428216        
	k: 100      xk: [   0.4912699705,              20,     4.543907497,    0.6581567681,    0.9966680514,    0.1794000516]    fk: 5.4625428216        
	k: 200      xk: [   0.4912711393,     19.99999731,     4.543607327,    0.6581567619,    0.9966677482,    0.1794049104]    fk: 5.46254278015       
	k: 300      xk: [   0.4912682487,     19.99999182,      4.54297441,    0.6581568859,    0.9966670075,     0.179426241]    fk: 5.46254271792       

	Parameter values: [0.49126824870270192, 19.999991820401632, 4.542974410112957, 0.65815688590701671, 0.99666700749423487, 0.17942624100183099]
	Function value:   5.4625427179238253
	Iterations:       385
	Function calls:   809
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [   0.4912682487,     19.99999182,      4.54297441,    0.6581568859,    0.9966670075,     0.179426241]    fk: 5.46254271793       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912682487,     19.99999182,      4.54297441,    0.6581568859,    0.9966670075,     0.179426241]    fk: 5.46254271792       
	k: 100      xk: [   0.4912683431,     19.99999972,     4.542937218,    0.6581569876,     0.996666966,    0.1794270979]    fk: 5.46254271159       
	k: 200      xk: [   0.4912611837,     19.99970813,     4.541890079,    0.6581637981,    0.9966656735,    0.1794651027]    fk: 5.4625424811        
	k: 300      xk: [   0.4912622052,     19.99968375,     4.541544337,    0.6581646708,    0.9966653237,    0.1794717973]    fk: 5.46254243776       
	k: 400      xk: [   0.4912582655,     19.99999988,      4.54108071,    0.6581716483,    0.9966647269,    0.1794933568]    fk: 5.4625421785        

	Parameter values: [0.4912580579214334, 19.999999993845549, 4.5410261807741685, 0.65817198006468658, 0.99666466186429625, 0.17949529104164236]
	Function value:   5.4625421779363306
	Iterations:       500
	Function calls:   884
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 13       xk: [   0.4912580579,     19.99999999,     4.541026181,    0.6581719801,    0.9966646619,     0.179495291]    fk: 5.46254217794       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912580579,     19.99999999,     4.541026181,    0.6581719801,    0.9966646619,     0.179495291]    fk: 5.46254217794       
	k: 100      xk: [   0.4912638971,     19.99992094,     4.541381813,    0.6581711637,    0.9966651879,     0.179470289]    fk: 5.46254200693       
	k: 200      xk: [   0.4912679651,      19.9999988,     4.543330836,    0.6581752721,     0.996667382,    0.1794178355]    fk: 5.4625414077        
	k: 300      xk: [   0.4912694497,     19.99999999,     4.543491089,     0.658175522,    0.9966675923,    0.1794099058]    fk: 5.46254139877       
	k: 400      xk: [   0.4912694426,              20,     4.543497158,    0.6581755313,    0.9966675985,    0.1794097099]    fk: 5.46254139873       

	Parameter values: [0.49126944257842076, 19.999999999089475, 4.5434971581196226, 0.65817553130826201, 0.99666759851063003, 0.17940970988400351]
	Function value:   5.4625413987338671
	Iterations:       445
	Function calls:   912
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [   0.4912694426,              20,     4.543497158,    0.6581755313,    0.9966675985,    0.1794097099]    fk: 5.46254139875       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912694426,              20,     4.543497158,    0.6581755313,    0.9966675985,    0.1794097099]    fk: 5.46254139873       
	k: 100      xk: [   0.4912694426,              20,     4.543497158,    0.6581755313,    0.9966675985,    0.1794097099]    fk: 5.46254139873       
	k: 200      xk: [   0.4912697853,              20,     4.543474015,    0.6581755156,    0.9966675836,    0.1794086121]    fk: 5.46254139727       
	k: 300      xk: [   0.4912697853,              20,     4.543474017,    0.6581755156,    0.9966675836,    0.1794086117]    fk: 5.46254139726       

	Parameter values: [0.49126978533032445, 19.999999997529013, 4.5434740165806824, 0.65817551559983256, 0.99666758357768226, 0.1794086117434211]
	Function value:   5.4625413972647525
	Iterations:       303
	Function calls:   680
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 15       xk: [   0.4912697853,              20,     4.543474017,    0.6581755156,    0.9966675836,    0.1794086117]    fk: 5.46254139727       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912697853,              20,     4.543474017,    0.6581755156,    0.9966675836,    0.1794086117]    fk: 5.46254139726       
	k: 100      xk: [   0.4912697853,              20,     4.543474017,    0.6581755156,    0.9966675836,    0.1794086117]    fk: 5.46254139726       
	k: 200      xk: [   0.4912696122,              20,     4.543475331,    0.6581755156,    0.9966675843,    0.1794094646]    fk: 5.4625413963        

	Parameter values: [0.49126961160036614, 19.999999999295376, 4.5434753324320383, 0.65817551560520604, 0.99666758426362523, 0.17940946672966004]
	Function value:   5.4625413962926572
	Iterations:       289
	Function calls:   677
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 16       xk: [   0.4912696116,              20,     4.543475332,    0.6581755156,    0.9966675843,    0.1794094667]    fk: 5.4625413963        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912696116,              20,     4.543475332,    0.6581755156,    0.9966675843,    0.1794094667]    fk: 5.46254139629       
	k: 100      xk: [   0.4912696116,              20,     4.543475332,    0.6581755156,    0.9966675843,    0.1794094667]    fk: 5.46254139629       
	k: 200      xk: [   0.4912694905,     19.99999999,     4.543477148,    0.6581755538,    0.9966675783,    0.1794097332]    fk: 5.4625413948        
	k: 300      xk: [   0.4912699341,      19.9999998,     4.543477065,    0.6581756204,    0.9966675946,    0.1794089805]    fk: 5.46254139058       
	k: 400      xk: [   0.4912544745,     19.99936335,     4.544303099,    0.6584245563,     0.996668364,    0.1794134553]    fk: 5.46252658636       

	Parameter values: [0.49126599668495341, 19.999345409504627, 4.5444274619710612, 0.65843369174426591, 0.99666858521978474, 0.17937630285353362]
	Function value:   5.4625229529336616
	Iterations:       500
	Function calls:   842
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 17       xk: [   0.4912659967,     19.99934541,     4.544427462,    0.6584336917,    0.9966685852,    0.1793763029]    fk: 5.46252295323       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912659967,     19.99934541,     4.544427462,    0.6584336917,    0.9966685852,    0.1793763029]    fk: 5.46252295293       
	k: 100      xk: [   0.4912659888,     19.99936639,      4.54442744,    0.6584337032,    0.9966685817,    0.1793769043]    fk: 5.46252295128       
	k: 200      xk: [   0.4912659656,     19.99938593,     4.544427431,    0.6584337078,    0.9966685804,    0.1793770942]    fk: 5.46252295113       

	Parameter values: [0.49126596560360303, 19.99938592972655, 4.5444274305919823, 0.65843370784859345, 0.9966685804312807, 0.17937709421762105]
	Function value:   5.4625229511272977
	Iterations:       234
	Function calls:   621
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 18       xk: [   0.4912659656,     19.99938593,     4.544427431,    0.6584337078,    0.9966685804,    0.1793770942]    fk: 5.46252295113       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912659656,     19.99938593,     4.544427431,    0.6584337078,    0.9966685804,    0.1793770942]    fk: 5.46252295113       
	k: 100      xk: [   0.4912659656,     19.99938593,     4.544427431,    0.6584337078,    0.9966685804,    0.1793770942]    fk: 5.46252295113       
	k: 200      xk: [   0.4912659656,     19.99938593,     4.544427431,    0.6584337078,    0.9966685804,    0.1793770942]    fk: 5.46252295113       

	Parameter values: [0.49126596560360325, 19.999385929755647, 4.5444274305919823, 0.65843370784859356, 0.9966685804312807, 0.17937709421762105]
	Function value:   5.4625229511259601
	Iterations:       205
	Function calls:   571
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 19       xk: [   0.4912659656,     19.99938593,     4.544427431,    0.6584337078,    0.9966685804,    0.1793770942]    fk: 5.46252295113       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912659656,     19.99938593,     4.544427431,    0.6584337078,    0.9966685804,    0.1793770942]    fk: 5.46252295113       
	k: 100      xk: [   0.4912659656,     19.99938593,     4.544427431,    0.6584337078,    0.9966685804,    0.1793770942]    fk: 5.46252295113       
	k: 200      xk: [   0.4912659656,     19.99938593,     4.544427431,    0.6584337078,    0.9966685804,    0.1793770942]    fk: 5.46252295113       

	Parameter values: [0.49126596560360325, 19.999385929755647, 4.5444274305919823, 0.65843370784859356, 0.9966685804312807, 0.17937709421762105]
	Function value:   5.4625229511259601
	Iterations:       217
	Function calls:   606
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.49126596560360325, 19.999385929755647, 4.5444274305919823, 0.65843370784859356, 0.9966685804312807, 0.17937709421762105]
Function value:   5.4625229511259601
Iterations:       8085
Function calls:   15792
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.912659656036032
r2 (800.000 MHz):          199.993859297556469
dw:                          4.544427430591982
dwH:                         0.658433707848594
pA:                          0.996668580431281
kex:                      1793.770942176210383

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.6835212727,    0.9154170993,     5.640580945,               0,    0.9894212371,    0.1714901274]    fk: 69.4617296469       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835212727,    0.9154170993,     5.640580945,         0.00025,    0.9894212371,    0.1714901274]    fk: 69.4902401723       
	k: 100      xk: [    0.675006475,    0.9166539345,     5.738744026, 0.0005991600877,    0.9894067674,    0.1670911703]    fk: 64.9282790247       
	k: 200      xk: [   0.6842635515,     0.927942649,     5.699978536, 4.172379048e-06,    0.9897358213,    0.1760489323]    fk: 55.5081055527       
	k: 300      xk: [   0.6933034255,    0.9304079812,     5.680300948, 8.199532429e-06,    0.9897787491,    0.1775882028]    fk: 54.4036370707       
	k: 400      xk: [   0.6926665993,    0.9298990193,     5.700238102, 0.0001328653475,    0.9897775729,    0.1762859613]    fk: 54.3275106794       

	Parameter values: [0.69652031282818472, 0.94000218283828252, 5.667890036673132, 0.0003362738638464102, 0.98971480376075083, 0.17189313629966557]
	Function value:   54.095889139349964
	Iterations:       500
	Function calls:   803
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.6965203128,    0.9400021828,     5.667890037, 0.0003362738638,    0.9897148038,    0.1718931363]    fk: 54.0750308554       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6965203128,    0.9400021828,     5.667890037,  0.000353087557,    0.9897148038,    0.1718931363]    fk: 54.0708090612       
	k: 100      xk: [    0.696174421,    0.9394495863,     5.672351217, 0.0003457111968,    0.9897185063,    0.1720773525]    fk: 54.0632051678       
	k: 200      xk: [   0.6961764975,    0.9394509496,     5.672372639, 0.0003506318048,    0.9897185245,    0.1720764215]    fk: 54.0632041436       
	k: 300      xk: [   0.6961894618,    0.9395262722,     5.672350066, 0.0008260580549,     0.989718385,    0.1720437878]    fk: 54.0631344318       
	k: 400      xk: [   0.6972273738,    0.9428424979,     5.670597936,    0.1107618286,    0.9896783776,    0.1694198855]    fk: 54.0027104476       

	Parameter values: [0.69557446516581312, 0.94008956250270792, 5.678757192544996, 0.16501787876020002, 0.98967087370429407, 0.16965432029923]
	Function value:   53.853780036467526
	Iterations:       500
	Function calls:   776
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.6955744652,    0.9400895625,     5.678757193,    0.1650178788,    0.9896708737,    0.1696543203]    fk: 53.8650645521       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6955744652,    0.9400895625,     5.678757193,    0.1650178788,    0.9896708737,    0.1696543203]    fk: 53.8541418639       
	k: 100      xk: [   0.6797720762,    0.9086303822,     5.683812395,    0.3919086975,    0.9895419674,    0.1759147894]    fk: 52.2133072135       
	k: 200      xk: [   0.6789560216,    0.9055417442,     5.668142172,    0.4101106929,    0.9895046486,    0.1768694372]    fk: 52.0419979991       
	k: 300      xk: [   0.6790564351,    0.9056313626,     5.668864486,    0.4101036156,    0.9895081156,    0.1768960357]    fk: 52.0414850249       
	k: 400      xk: [   0.6790623265,    0.9056357176,     5.671141395,    0.4101167229,    0.9895110273,    0.1768301799]    fk: 52.0397888944       

	Parameter values: [0.67905702944030111, 0.90561141396084577, 5.6724139217988796, 0.41011693395839732, 0.98951197111666778, 0.17678673620060881]
	Function value:   52.039265478153297
	Iterations:       500
	Function calls:   800
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.6790570294,     0.905611414,     5.672413922,     0.410116934,    0.9895119711,    0.1767867362]    fk: 52.0392702769       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6790570294,     0.905611414,     5.672413922,     0.410116934,    0.9895119711,    0.1767867362]    fk: 52.039269994        
	k: 100      xk: [   0.6812652646,    0.9119380367,     5.673003029,     0.410057613,    0.9894550809,    0.1718966787]    fk: 51.783823235        
	k: 200      xk: [   0.6814286267,    0.9125805658,     5.670792149,    0.4090559246,    0.9894522767,    0.1716940894]    fk: 51.7824137409       
	k: 300      xk: [   0.6816360366,    0.9127947302,     5.669434536,    0.4084450338,    0.9894515134,     0.171670209]    fk: 51.7821352908       
	k: 400      xk: [   0.6818879485,    0.9131811509,     5.665868073,    0.4075225312,    0.9894502117,    0.1717769046]    fk: 51.7778128621       

	Parameter values: [0.68331784082205216, 0.9155609439978849, 5.6446410077037061, 0.41007771352564237, 0.98941915017155124, 0.17126184757893459]
	Function value:   51.715575031582929
	Iterations:       500
	Function calls:   809
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.6833178408,     0.915560944,     5.644641008,    0.4100777135,    0.9894191502,    0.1712618476]    fk: 51.7164529015       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6833178408,     0.915560944,     5.644641008,    0.4100777135,    0.9894191502,    0.1712618476]    fk: 51.7155750766       
	k: 100      xk: [     0.68345992,    0.9154840894,     5.641388272,    0.4100495649,    0.9894203544,    0.1713763769]    fk: 51.7025930011       
	k: 200      xk: [   0.6834436124,    0.9153242927,     5.641485924,    0.4100954655,    0.9894205827,     0.171456456]    fk: 51.7020621566       
	k: 300      xk: [   0.6834155224,    0.9152907411,     5.641853115,    0.4100960609,    0.9894222284,    0.1714948359]    fk: 51.7019555535       
	k: 400      xk: [   0.6834145004,    0.9152897598,     5.641887124,    0.4100960745,    0.9894223367,    0.1714963269]    fk: 51.7019551232       

	Parameter values: [0.6834149742952591, 0.91529125663078359, 5.6418811070752213, 0.41009607374614654, 0.98942233201579111, 0.17149598366270868]
	Function value:   51.701955112080263
	Iterations:       500
	Function calls:   822
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 5        xk: [   0.6834149743,    0.9152912566,     5.641881107,    0.4100960737,     0.989422332,    0.1714959837]    fk: 51.7019551129       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834149743,    0.9152912566,     5.641881107,    0.4100960737,     0.989422332,    0.1714959837]    fk: 51.7019551125       
	k: 100      xk: [   0.6834221936,    0.9152938332,     5.641881677,     0.410096043,    0.9894222548,    0.1714891889]    fk: 51.7019473668       
	k: 200      xk: [   0.6834245325,    0.9152977863,     5.641882207,    0.4100960314,    0.9894222294,    0.1714854824]    fk: 51.7019467487       
	k: 300      xk: [   0.6834245839,    0.9152983156,     5.641882262,    0.4100960307,    0.9894222299,    0.1714852507]    fk: 51.7019467466       
	k: 400      xk: [   0.6834245826,    0.9152983122,     5.641882262,    0.4100960307,    0.9894222299,     0.171485253]    fk: 51.7019467466       

	Parameter values: [0.68342458258605499, 0.91529831223746816, 5.6418822617298652, 0.41009603071832557, 0.98942222988945072, 0.17148525298119799]
	Function value:   51.70194674660199
	Iterations:       429
	Function calls:   885
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6834245826,    0.9152983122,     5.641882262,    0.4100960307,    0.9894222299,     0.171485253]    fk: 51.7019467466       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834245826,    0.9152983122,     5.641882262,    0.4100960307,    0.9894222299,     0.171485253]    fk: 51.7019467466       
	k: 100      xk: [   0.6834245826,    0.9152983122,     5.641882262,    0.4100960307,    0.9894222299,     0.171485253]    fk: 51.7019467466       
	k: 200      xk: [   0.6834289622,    0.9152970876,      5.64188289,     0.410096069,    0.9894224451,    0.1714920979]    fk: 51.7019449939       
	k: 300      xk: [   0.6834305691,    0.9152933552,     5.641883042,    0.4100960777,    0.9894224545,    0.1714942047]    fk: 51.7019447511       
	k: 400      xk: [   0.6834305533,    0.9152933066,     5.641883042,    0.4100960777,    0.9894224541,    0.1714942239]    fk: 51.7019447509       

	Parameter values: [0.68343055325980262, 0.91529330658836627, 5.6418830420431121, 0.41009607772823697, 0.98942245414094476, 0.17149422392710584]
	Function value:   51.701944750946872
	Iterations:       439
	Function calls:   879
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6834305533,    0.9152933066,     5.641883042,    0.4100960777,    0.9894224541,    0.1714942239]    fk: 51.701944751        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834305533,    0.9152933066,     5.641883042,    0.4100960777,    0.9894224541,    0.1714942239]    fk: 51.7019447509       
	k: 100      xk: [   0.6834305533,    0.9152933066,     5.641883042,    0.4100960777,    0.9894224541,    0.1714942239]    fk: 51.7019447509       
	k: 200      xk: [   0.6834305533,    0.9152933066,     5.641883042,    0.4100960777,    0.9894224541,    0.1714942239]    fk: 51.7019447509       
	k: 300      xk: [    0.683430566,    0.9152934714,     5.641883028,    0.4100960775,    0.9894224539,    0.1714941686]    fk: 51.7019447505       

	Parameter values: [0.68343056603042407, 0.91529347137646044, 5.6418830281613666, 0.41009607752731647, 0.9894224538513976, 0.17149416858437699]
	Function value:   51.701944750533436
	Iterations:       334
	Function calls:   740
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [    0.683430566,    0.9152934714,     5.641883028,    0.4100960775,    0.9894224539,    0.1714941686]    fk: 51.7019447505       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.683430566,    0.9152934714,     5.641883028,    0.4100960775,    0.9894224539,    0.1714941686]    fk: 51.7019447505       
	k: 100      xk: [    0.683430566,    0.9152934714,     5.641883028,    0.4100960775,    0.9894224539,    0.1714941686]    fk: 51.7019447505       
	k: 200      xk: [    0.683430566,    0.9152934714,     5.641883028,    0.4100960775,    0.9894224539,    0.1714941686]    fk: 51.7019447505       
	k: 300      xk: [   0.6834305887,    0.9152935262,     5.641883026,    0.4100960774,     0.989422454,    0.1714941413]    fk: 51.7019447504       

	Parameter values: [0.68343058866532425, 0.91529352619538762, 5.6418830257296984, 0.41009607744842441, 0.98942245395426587, 0.17149414128466894]
	Function value:   51.701944750428218
	Iterations:       328
	Function calls:   738
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.6834305887,    0.9152935262,     5.641883026,    0.4100960774,     0.989422454,    0.1714941413]    fk: 51.7019447504       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834305887,    0.9152935262,     5.641883026,    0.4100960774,     0.989422454,    0.1714941413]    fk: 51.7019447504       
	k: 100      xk: [   0.6834305887,    0.9152935262,     5.641883026,    0.4100960774,     0.989422454,    0.1714941413]    fk: 51.7019447504       
	k: 200      xk: [   0.6834305887,    0.9152935262,     5.641883026,    0.4100960774,     0.989422454,    0.1714941413]    fk: 51.7019447504       
	k: 300      xk: [   0.6834305887,    0.9152935262,     5.641883026,    0.4100960774,     0.989422454,    0.1714941413]    fk: 51.7019447504       

	Parameter values: [0.68343058866532425, 0.91529352619538762, 5.6418830257296984, 0.41009607744842441, 0.98942245395426587, 0.17149414128466894]
	Function value:   51.701944750428218
	Iterations:       333
	Function calls:   745
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.68343058866532425, 0.91529352619538762, 5.6418830257296984, 0.41009607744842441, 0.98942245395426587, 0.17149414128466894]
Function value:   51.701944750428218
Iterations:       4363
Function calls:   7997
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.834305886653242
r2 (800.000 MHz):            9.152935261953877
dw:                          5.641883025729698
dwH:                         0.410096077448424
pA:                          0.989422453954266
kex:                      1714.941412846689445


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4912659656,     19.99938593,     4.544427431,               0,    0.9966685804,    0.1793770942]    fk: 7.20757316721       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912659656,     19.99938593,     4.544427431,         0.00025,    0.9966685804,    0.1793770942]    fk: 7.32502055062       
	k: 100      xk: [   0.4989184921,     19.97957357,     4.604074324, 0.0001084646849,    0.9968466921,    0.1821300783]    fk: 5.57639826335       
	k: 200      xk: [   0.4993850979,     19.94501015,     4.758519721, 0.0003157301559,    0.9970065156,    0.1761777425]    fk: 5.56419387579       
	k: 300      xk: [    0.497879959,     19.93786115,     4.485641526,  0.001315951033,     0.996687997,    0.1882895206]    fk: 5.53891361942       
	k: 400      xk: [   0.4973480047,     19.74593215,     4.184010118,   0.01227395541,    0.9962669487,    0.1979425891]    fk: 5.51269468262       

	Parameter values: [0.49690262642205918, 18.160829707312143, 3.8938605131153867, 0.074971637803385158, 0.995763729644638, 0.20510148421286875]
	Function value:   5.494437935192896
	Iterations:       500
	Function calls:   801
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4969026264,     18.16082971,     3.893860513,    0.0749716378,    0.9957637296,    0.2051014842]    fk: 5.51728604213       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4969026264,     18.16082971,     3.893860513,   0.07872021969,    0.9957637296,    0.2051014842]    fk: 5.51516092071       
	k: 100      xk: [   0.4966893039,    0.2144345801,     4.135129158,    0.1183407698,    0.9961740142,     0.199943028]    fk: 5.49928292497       
	k: 200      xk: [   0.4978254779,     1.214690253,     4.508217366,    0.2226399267,    0.9967248718,    0.1854719323]    fk: 5.48228902195       
	k: 300      xk: [   0.4975301189,     1.355681856,     4.562413258,    0.2452251465,    0.9967773744,    0.1837765237]    fk: 5.48107006318       
	k: 400      xk: [   0.4963475116,    0.3975623891,     4.598236553,    0.3616121553,    0.9967982503,    0.1828766814]    fk: 5.47887842315       

	Parameter values: [0.49087843127064201, 0.13114636737452318, 4.4977144034831822, 0.65578524320087295, 0.99660066517553203, 0.1814619840620077]
	Function value:   5.4653623802464306
	Iterations:       500
	Function calls:   777
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4908784313,    0.1311463674,     4.497714403,    0.6557852432,    0.9966006652,    0.1814619841]    fk: 5.46584659976       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4908784313,    0.1377036857,     4.497714403,    0.6557852432,    0.9966006652,    0.1814619841]    fk: 5.46551135043       
	k: 100      xk: [   0.4912973626,    0.1355078845,     4.539328223,    0.6558014663,    0.9966634798,    0.1795555951]    fk: 5.46272294062       
	k: 200      xk: [   0.4913214223,    0.1353941438,     4.542910663,    0.6558023406,     0.996667698,    0.1794731574]    fk: 5.46271070279       
	k: 300      xk: [   0.4913349944,    0.1073423592,     4.543710328,    0.6558769839,    0.9966690144,    0.1793774924]    fk: 5.46270813954       
	k: 400      xk: [   0.4913121209,  0.004303117102,     4.542996589,    0.6561507065,    0.9966676522,    0.1794690267]    fk: 5.46268913768       

	Parameter values: [0.49131346040699764, 0.0052403466931577915, 4.5429389612761195, 0.65614819707803829, 0.99666761423351091, 0.17946683037266603]
	Function value:   5.462689104564169
	Iterations:       500
	Function calls:   836
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.4913134604,  0.005240346693,     4.542938961,    0.6561481971,    0.9966676142,    0.1794668304]    fk: 5.46268737682       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4913134604,  0.005502364028,     4.542938961,    0.6561481971,    0.9966676142,    0.1794668304]    fk: 5.4626873936        
	k: 100      xk: [   0.4913118727,  0.005439345227,     4.542394191,    0.6561495431,    0.9966670003,    0.1794846019]    fk: 5.46268733607       
	k: 200      xk: [    0.491312196,  2.43969523e-05,     4.543096907,    0.6561697878,    0.9966677708,    0.1794608394]    fk: 5.46268594267       
	k: 300      xk: [   0.4913165722, 0.0003736687398,     4.544322895,    0.6561864444,     0.996669136,    0.1794227086]    fk: 5.46268507248       
	k: 400      xk: [   0.4913061271, 0.0001660696399,     4.556632688,    0.6583967714,    0.9966824073,    0.1789760276]    fk: 5.46254957228       

	Parameter values: [0.49130426728577725, 3.3383942455250591e-06, 4.5551652300892442, 0.65841746624204767, 0.99668070963646227, 0.17902649687731453]
	Function value:   5.4625469164285292
	Iterations:       500
	Function calls:   824
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.4913042673, 3.338394246e-06,      4.55516523,    0.6584174662,    0.9966807096,    0.1790264969]    fk: 5.46254682522       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4913042673, 3.505313958e-06,      4.55516523,    0.6584174662,    0.9966807096,    0.1790264969]    fk: 5.46254682647       
	k: 100      xk: [   0.4912979521, 3.422941818e-06,     4.555165208,     0.658417625,    0.9966809131,    0.1790571029]    fk: 5.4625409747        
	k: 200      xk: [   0.4912989458,  3.40053964e-06,     4.555165162,    0.6584176185,    0.9966809007,    0.1790386938]    fk: 5.46254067643       
	k: 300      xk: [   0.4912989506, 3.400531514e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.46254067641       

	Parameter values: [0.49129895058229078, 3.4005315143076814e-06, 4.5551651616330089, 0.65841761858959624, 0.99668090075163107, 0.17903869650859899]
	Function value:   5.4625406764069515
	Iterations:       336
	Function calls:   730
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [   0.4912989506, 3.400531514e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.46254067551       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912989506,  3.57055809e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.46254067551       
	k: 100      xk: [   0.4912989506,  3.57055809e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.46254067551       
	k: 200      xk: [   0.4912989506,  3.57055809e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.46254067551       

	Parameter values: [0.49129895058229078, 3.5705580849558785e-06, 4.5551651616330098, 0.65841761858959635, 0.99668090075163107, 0.17903869650859902]
	Function value:   5.4625406755091648
	Iterations:       286
	Function calls:   655
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.46254067552       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
	k: 100      xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
	k: 200      xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        

	Parameter values: [0.49129895058229078, 3.5705580849558785e-06, 4.5551651616330098, 0.65841761858959635, 0.99668090075163107, 0.17903869650859902]
	Function value:   5.4625406755002341
	Iterations:       284
	Function calls:   637
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
	k: 100      xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
	k: 200      xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        

	Parameter values: [0.49129895058229078, 3.5705580849558785e-06, 4.5551651616330098, 0.65841761858959635, 0.99668090075163107, 0.17903869650859902]
	Function value:   5.4625406755001453
	Iterations:       284
	Function calls:   637
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
	k: 100      xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
	k: 200      xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        

	Parameter values: [0.49129895058229078, 3.5705580849558785e-06, 4.5551651616330098, 0.65841761858959635, 0.99668090075163107, 0.17903869650859902]
	Function value:   5.4625406755001444
	Iterations:       284
	Function calls:   637
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
	k: 100      xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        
	k: 200      xk: [   0.4912989506, 3.570558085e-06,     4.555165162,    0.6584176186,    0.9966809008,    0.1790386965]    fk: 5.4625406755        

	Parameter values: [0.49129895058229078, 3.5705580849558785e-06, 4.5551651616330098, 0.65841761858959635, 0.99668090075163107, 0.17903869650859902]
	Function value:   5.4625406755001444
	Iterations:       284
	Function calls:   637
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.49129895058229078, 3.5705580849558785e-06, 4.5551651616330098, 0.65841761858959635, 0.99668090075163107, 0.17903869650859902]
Function value:   5.4625406755001444
Iterations:       3758
Function calls:   7171
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.912989505822908
r2 (800.000 MHz):            0.000035705580850
dw:                          4.555165161633010
dwH:                         0.658417618589596
pA:                          0.996680900751631
kex:                      1790.386965085990141

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/dw.agr' for writing.

relax> value.write(param='dwH', file='dwH.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/dwH.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dwH', spin_id=None, plot_data='value', file='dwH.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/dwH.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/MQ CR72/results.bz2' for writing.

