


                                  relax repository checkout r21156
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'relax_disp.py'
----------------------------------------------------------------------------------------------------
"""Script for CPMG relaxation dispersion curve fitting using Dr. Flemming Hansen's data from http://dx.doi.org/10.1021/jp074793o.

To run:

$ ../../../../../relax --tee relax_disp.log relax_disp.py
"""


# Python module imports.
from os import sep

# relax module imports.
from auto_analyses.relax_disp import Relax_disp
from data_store import Relax_data_store; ds = Relax_data_store()
from status import Status; status = Status()


# The dispersion models.
MODELS = ['No Rex', 'LM63', 'LM63 3-site', 'CR72', 'CR72 full', 'IT99', 'NS CPMG 2-site 3D', 'NS CPMG 2-site expanded', 'NS CPMG 2-site star']

# The grid search size (the number of increments per dimension).
GRID_INC = 11

# The number of Monte Carlo simulations to be used for error analysis at the end of the analysis.
MC_NUM = 50



# Create the data pipe.
pipe_name = 'base pipe'
pipe_bundle = 'relax_disp'
pipe.create(pipe_name=pipe_name, bundle=pipe_bundle, pipe_type='relax_disp')

# The path to the data files.
data_path = status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'Hansen'

# Load the saved base pipe
results.read(data_path+sep+'base_pipe')

# Set the nuclear isotope data.
spin.isotope('15N')

# Create the R2eff data pipe and load the results.
pipe.create(pipe_name='R2eff', bundle=pipe_bundle, pipe_type='relax_disp')
pipe.switch(pipe_name='R2eff')
results.read(data_path+sep+'r2eff_pipe')


# Auto-analysis execution.
##########################

# Do not change!
Relax_disp(pipe_name=pipe_name, pipe_bundle=pipe_bundle, models=MODELS, grid_inc=GRID_INC, mc_sim_num=MC_NUM)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='base pipe', pipe_type='relax_disp', bundle='relax_disp')

relax> results.read(file='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/base_pipe', dir=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/base_pipe.bz2' for reading.

relax> spin.isotope(isotope='15N', spin_id=None, force=False)

relax> pipe.create(pipe_name='R2eff', pipe_type='relax_disp', bundle='relax_disp')

relax> pipe.switch(pipe_name='R2eff')

relax> results.read(file='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/r2eff_pipe', dir=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/r2eff_pipe.bz2' for reading.




=======================================
= Relaxation dispersion auto-analysis =
=======================================

Skipping the error analysis as it has already been performed.



----------------------
- The 'No Rex' model -
----------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='No Rex', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='No Rex')

relax> relax_disp.select_model(model='No Rex')
The model for no chemical exchange relaxation.

relax> value.copy(pipe_from='R2eff', pipe_to='No Rex', param='r2eff')

relax> grid_search(lower=None, upper=None, inc=11, constraints=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------

Unconstrained grid search size: 121 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 121 grid nodes.
k: 0        xk: [            0.1,             0.1]    fk: 58690.3836395       
k: 1        xk: [           0.49,             0.1]    fk: 54077.5310766       
k: 2        xk: [           0.88,             0.1]    fk: 51836.7423585       
k: 11       xk: [            0.1,            0.49]    fk: 36765.2033243       
k: 12       xk: [           0.49,            0.49]    fk: 32152.3507614       
k: 13       xk: [           0.88,            0.49]    fk: 29911.5620433       
k: 22       xk: [            0.1,            0.88]    fk: 21336.9870945       
k: 23       xk: [           0.49,            0.88]    fk: 16724.1345316       
k: 24       xk: [           0.88,            0.88]    fk: 14483.3458134       
k: 33       xk: [            0.1,            1.27]    fk: 12405.7349501       
k: 34       xk: [           0.49,            1.27]    fk: 7792.8823872        
k: 35       xk: [           0.88,            1.27]    fk: 5552.09366906       
k: 45       xk: [           0.49,            1.66]    fk: 5358.59432823       
k: 46       xk: [           0.88,            1.66]    fk: 3117.80561009       

Optimised parameter values:
r2 (500.000 MHz):            8.800000000000001
r2 (800.000 MHz):           16.600000000000001


Fitting to the spin block [':71@N']
-----------------------------------

Unconstrained grid search size: 121 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 121 grid nodes.
k: 0        xk: [            0.1,             0.1]    fk: 5170.80869563       
k: 1        xk: [           0.49,             0.1]    fk: 263.063937419       

Optimised parameter values:
r2 (500.000 MHz):            4.900000000000000
r2 (800.000 MHz):            1.000000000000000

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           0.88,            1.66]    fk: 3117.80561009       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [          0.924,            1.66]    fk: 3013.84092409       

	Parameter values: [1.053417133532534, 1.6111256642229836]
	Function value:   2832.2217982147436
	Iterations:       64
	Function calls:   135
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    1.053417134,     1.611125664]    fk: 2832.28562163       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    1.053417134,     1.611125664]    fk: 2832.2849834        

	Parameter values: [1.0534165738331365, 1.6111255339017498]
	Function value:   2832.2849833958408
	Iterations:       51
	Function calls:   104
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    1.053416574,     1.611125534]    fk: 2832.28562163       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    1.053416574,     1.611125534]    fk: 2832.28561525       

	Parameter values: [1.0534165537167397, 1.6111255312354289]
	Function value:   2832.285615247622
	Iterations:       56
	Function calls:   119
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    1.053416554,     1.611125531]    fk: 2832.28562163       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    1.053416554,     1.611125531]    fk: 2832.28562157       

	Parameter values: [1.0534165537167397, 1.6111255312354289]
	Function value:   2832.28562156614
	Iterations:       51
	Function calls:   105
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [    1.053416554,     1.611125531]    fk: 2832.28562163       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    1.053416554,     1.611125531]    fk: 2832.28562163       

	Parameter values: [1.0534165537167397, 1.6111255312354289]
	Function value:   2832.2856216293253
	Iterations:       51
	Function calls:   105
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [    1.053416554,     1.611125531]    fk: 2832.28562163       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    1.053416554,     1.611125531]    fk: 2832.28562163       

	Parameter values: [1.0534165537167397, 1.6111255312354289]
	Function value:   2832.2856216299574
	Iterations:       51
	Function calls:   105
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [    1.053416554,     1.611125531]    fk: 2832.28562163       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    1.053416554,     1.611125531]    fk: 2832.28562163       

	Parameter values: [1.0534165537167397, 1.6111255312354289]
	Function value:   2832.2856216299633
	Iterations:       51
	Function calls:   105
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [    1.053416554,     1.611125531]    fk: 2832.28562163       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    1.053416554,     1.611125531]    fk: 2832.28562163       

	Parameter values: [1.0534165537167397, 1.6111255312354289]
	Function value:   2832.2856216299633
	Iterations:       51
	Function calls:   105
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [1.0534165537167397, 1.6111255312354289]
Function value:   2832.2856216299633
Iterations:       426
Function calls:   883
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):           10.534165537167397
r2 (800.000 MHz):           16.111255312354288


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           0.49,             0.1]    fk: 263.063937419       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [         0.5145,             0.1]    fk: 176.480506141       
	k: 100      xk: [   0.5831429448,     9.999999592]    fk: 73.5515943058       

	Parameter values: [0.58314294482134077, 9.999999591956712]
	Function value:   73.551594305758613
	Iterations:       120
	Function calls:   274
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [   0.5831429448,     9.999999592]    fk: 73.6219141944       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5831429448,     9.999999592]    fk: 73.6212109955       

	Parameter values: [0.58314256726560676, 10.000013755325501]
	Function value:   73.621210992370052
	Iterations:       52
	Function calls:   113
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [   0.5831425673,     10.00001376]    fk: 73.6219141912       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5831425673,     10.00001376]    fk: 73.6219071592       

	Parameter values: [0.5831425632649333, 10.00034584150745]
	Function value:   73.621907159204838
	Iterations:       40
	Function calls:   85
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [   0.5831425633,     10.00034584]    fk: 73.6219141912       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5831425633,     10.00034584]    fk: 73.6219141209       

	Parameter values: [0.5831425632649333, 10.00034584150745]
	Function value:   73.621914120873157
	Iterations:       37
	Function calls:   76
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.5831425633,     10.00034584]    fk: 73.6219141912       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5831425633,     10.00034584]    fk: 73.6219141905       

	Parameter values: [0.5831425632649333, 10.00034584150745]
	Function value:   73.621914190489861
	Iterations:       28
	Function calls:   60
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [   0.5831425633,     10.00034584]    fk: 73.6219141912       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5831425633,     10.00034584]    fk: 73.6219141912       

	Parameter values: [0.58314256337355208, 10.062848002085516]
	Function value:   73.621914191186008
	Iterations:       34
	Function calls:   83
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [   0.5831425634,       10.062848]    fk: 73.6219141912       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5831425634,       10.062848]    fk: 73.6219141912       

	Parameter values: [0.58314256337355208, 10.062848002085516]
	Function value:   73.621914191192957
	Iterations:       34
	Function calls:   83
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [   0.5831425634,       10.062848]    fk: 73.6219141912       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5831425634,       10.062848]    fk: 73.6219141912       

	Parameter values: [0.58314256337355208, 10.062848002085516]
	Function value:   73.621914191193042
	Iterations:       34
	Function calls:   83
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [   0.5831425634,       10.062848]    fk: 73.6219141912       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5831425634,       10.062848]    fk: 73.6219141912       

	Parameter values: [0.58314256337355208, 10.062848002085516]
	Function value:   73.621914191193042
	Iterations:       34
	Function calls:   83
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.58314256337355208, 10.062848002085516]
Function value:   73.621914191193042
Iterations:       413
Function calls:   940
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            5.831425633735520
r2 (800.000 MHz):          100.628480020855164

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex/grace2images.py' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex/results.bz2' for writing.



--------------------
- The 'LM63' model -
--------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='LM63', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='LM63')

relax> relax_disp.select_model(model='LM63')
The Luz and Meiboom (1963) 2-site fast exchange model.

relax> value.copy(pipe_from='R2eff', pipe_to='LM63', param='r2eff')

relax> grid_search(lower=None, upper=None, inc=11, constraints=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------

Unconstrained grid search size: 14641 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 14641 grid nodes.
k: 0        xk: [            0.1,             0.1,               0,          0.0001]    fk: 58690.3836395       
k: 1        xk: [           0.49,             0.1,               0,          0.0001]    fk: 54077.5310766       
k: 2        xk: [           0.88,             0.1,               0,          0.0001]    fk: 51836.7423585       
k: 11       xk: [            0.1,            0.49,               0,          0.0001]    fk: 36765.2033243       
k: 12       xk: [           0.49,            0.49,               0,          0.0001]    fk: 32152.3507614       
k: 13       xk: [           0.88,            0.49,               0,          0.0001]    fk: 29911.5620433       
k: 22       xk: [            0.1,            0.88,               0,          0.0001]    fk: 21336.9870945       
k: 23       xk: [           0.49,            0.88,               0,          0.0001]    fk: 16724.1345316       
k: 24       xk: [           0.88,            0.88,               0,          0.0001]    fk: 14483.3458134       
k: 33       xk: [            0.1,            1.27,               0,          0.0001]    fk: 12405.7349501       
k: 34       xk: [           0.49,            1.27,               0,          0.0001]    fk: 7792.8823872        
k: 35       xk: [           0.88,            1.27,               0,          0.0001]    fk: 5552.09366906       
k: 45       xk: [           0.49,            1.66,               0,          0.0001]    fk: 5358.59432823       
k: 46       xk: [           0.88,            1.66,               0,          0.0001]    fk: 3117.80561009       
k: 167      xk: [           0.88,            1.66,               1,          0.0001]    fk: 2895.84147207       
k: 288      xk: [           0.88,            1.66,               2,          0.0001]    fk: 2711.20040277       
k: 409      xk: [           0.88,            1.66,               3,          0.0001]    fk: 2563.88240218       
k: 530      xk: [           0.88,            1.66,               4,          0.0001]    fk: 2453.88747031       
k: 651      xk: [           0.88,            1.66,               5,          0.0001]    fk: 2381.21560715       
k: 772      xk: [           0.88,            1.66,               6,          0.0001]    fk: 2345.86681271       
k: 2795     xk: [           0.49,            0.49,               1,         2.00008]    fk: 1930.40198174       

Optimised parameter values:
r2 (500.000 MHz):            4.900000000000000
r2 (800.000 MHz):            4.900000000000000
phi_ex:                      1.000000000000000
kex:                     20000.799999999999272


Fitting to the spin block [':71@N']
-----------------------------------

Unconstrained grid search size: 14641 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 14641 grid nodes.
k: 0        xk: [            0.1,             0.1,               0,          0.0001]    fk: 5170.80869563       
k: 1        xk: [           0.49,             0.1,               0,          0.0001]    fk: 263.063937419       
k: 122      xk: [           0.49,             0.1,               1,          0.0001]    fk: 226.236125584       
k: 243      xk: [           0.49,             0.1,               2,          0.0001]    fk: 196.244251909       
k: 364      xk: [           0.49,             0.1,               3,          0.0001]    fk: 173.088316396       
k: 485      xk: [           0.49,             0.1,               4,          0.0001]    fk: 156.768319044       
k: 606      xk: [           0.49,             0.1,               5,          0.0001]    fk: 147.284259853       
k: 727      xk: [           0.49,             0.1,               6,          0.0001]    fk: 144.636138823       
k: 2783     xk: [            0.1,             0.1,               1,         2.00008]    fk: 43.1765839951       

Optimised parameter values:
r2 (500.000 MHz):            1.000000000000000
r2 (800.000 MHz):            1.000000000000000
phi_ex:                      1.000000000000000
kex:                     20000.799999999999272

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           0.49,            0.49,               1,         2.00008]    fk: 1930.40198174       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [         0.5145,            0.49,               1,         2.00008]    fk: 1891.80945771       
	k: 100      xk: [   0.5049701247,    0.2263290363,      0.52283992,    0.6406148526]    fk: 151.013107753       
	k: 200      xk: [   0.6774921191,    0.6653291786,    0.3080410972,    0.4642215529]    fk: 137.561734116       
	k: 300      xk: [   0.6772771679,    0.6650189553,    0.3082033525,    0.4644059285]    fk: 137.561605588       

	Parameter values: [0.67727716788524128, 0.66501895534738797, 0.3082033525080497, 0.46440592846481432]
	Function value:   137.56160558762465
	Iterations:       383
	Function calls:   751
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 1        xk: [   0.6772771679,    0.6650189553,    0.3082033525,    0.4644059285]    fk: 137.646381429       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6772771679,    0.6650189553,    0.3082033525,    0.4644059285]    fk: 137.645533671       
	k: 100      xk: [   0.6772791072,    0.6650259427,    0.3081999973,    0.4644020463]    fk: 137.645533636       
	k: 200      xk: [   0.6772796629,    0.6650273371,    0.3081993444,    0.4644013689]    fk: 137.645533636       

	Parameter values: [0.67727966293510744, 0.66502733710019102, 0.30819934443214214, 0.46440136885513633]
	Function value:   137.64553363593924
	Iterations:       206
	Function calls:   464
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [   0.6772796629,    0.6650273371,    0.3081993444,    0.4644013689]    fk: 137.646381394       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6772796629,    0.6650273371,    0.3081993444,    0.4644013689]    fk: 137.646372916       
	k: 100      xk: [   0.6772796629,    0.6650273371,    0.3081993444,    0.4644013689]    fk: 137.646372916       
	k: 200      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646372916       

	Parameter values: [0.67727969141681854, 0.66502742854205277, 0.30819930101076254, 0.46440131968981047]
	Function value:   137.64637291606888
	Iterations:       220
	Function calls:   446
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381309       
	k: 100      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381309       
	k: 200      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381309       

	Parameter values: [0.67727969141681854, 0.66502742854205277, 0.30819930101076254, 0.46440131968981047]
	Function value:   137.64638130887013
	Iterations:       222
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381393       
	k: 100      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381393       
	k: 200      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381393       

	Parameter values: [0.67727969141681854, 0.66502742854205277, 0.30819930101076254, 0.46440131968981047]
	Function value:   137.64638139279813
	Iterations:       222
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
	k: 100      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
	k: 200      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       

	Parameter values: [0.67727969141681854, 0.66502742854205277, 0.30819930101076254, 0.46440131968981047]
	Function value:   137.64638139363743
	Iterations:       222
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
	k: 100      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
	k: 200      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       

	Parameter values: [0.67727969141681854, 0.66502742854205277, 0.30819930101076254, 0.46440131968981047]
	Function value:   137.64638139364578
	Iterations:       222
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
	k: 100      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
	k: 200      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       

	Parameter values: [0.67727969141681854, 0.66502742854205277, 0.30819930101076254, 0.46440131968981047]
	Function value:   137.6463813936459
	Iterations:       222
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
	k: 100      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       
	k: 200      xk: [   0.6772796914,    0.6650274285,     0.308199301,    0.4644013197]    fk: 137.646381394       

	Parameter values: [0.67727969141681854, 0.66502742854205277, 0.30819930101076254, 0.46440131968981047]
	Function value:   137.6463813936459
	Iterations:       222
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.67727969141681854, 0.66502742854205277, 0.30819930101076254, 0.46440131968981047]
Function value:   137.6463813936459
Iterations:       2141
Function calls:   4373
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.772796914168185
r2 (800.000 MHz):            6.650274285420528
phi_ex:                      0.308199301010763
kex:                      4644.013196898104979


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [            0.1,             0.1,               1,         2.00008]    fk: 43.1765839951       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [            0.1,             0.1,            1.05,         2.00008]    fk: 22.6035631917       
	k: 100      xk: [   0.1672873868,     0.168794845,     0.556009732,     1.090223526]    fk: 8.67269337303       
	k: 200      xk: [   0.4449282665,    0.4544468366,    0.1019925053,    0.3972843655]    fk: 4.04448328049       
	k: 300      xk: [   0.4929654057,    0.5137305268,   0.05958614545,     0.256748446]    fk: 2.2574088579        
	k: 400      xk: [   0.4926614758,    0.5991771295,    0.0598374096,    0.2573464506]    fk: 2.25620835826       

	Parameter values: [0.49295757932089967, 10.000570550332743, 0.059592030917081984, 0.25676981224278073]
	Function value:   2.2343936031660627
	Iterations:       500
	Function calls:   857
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4929575793,     10.00057055,   0.05959203092,    0.2567698122]    fk: 2.31425197897       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4929575793,     10.00057055,   0.05959203092,    0.2567698122]    fk: 2.31345339521       
	k: 100      xk: [   0.4930277193,     10.00146172,   0.05953516511,    0.2565526116]    fk: 2.31344516279       
	k: 200      xk: [   0.4930277786,     9.999991334,   0.05953511114,    0.2565524407]    fk: 2.31344516278       

	Parameter values: [0.49302777861757441, 9.999991333920196, 0.059535111141502867, 0.25655244073488115]
	Function value:   2.3134451627775729
	Iterations:       211
	Function calls:   456
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [   0.4930277786,     9.999991334,   0.05953511114,    0.2565524407]    fk: 2.31424358027       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930277786,     9.999991334,   0.05953511114,    0.2565524407]    fk: 2.3142355961        
	k: 100      xk: [   0.4930284795,     9.999933744,    0.0595345429,    0.2565502725]    fk: 2.31423559527       

	Parameter values: [0.49302848163768725, 9.9997515866418762, 0.059534541506973085, 0.25655026668435343]
	Function value:   2.3142355952729363
	Iterations:       182
	Function calls:   467
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.4930284816,     9.999751587,   0.05953454151,    0.2565502667]    fk: 2.31424357943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930284816,     9.999751587,   0.05953454151,    0.2565502667]    fk: 2.31424349959       
	k: 100      xk: [    0.493028489,     9.998622969,   0.05953453564,    0.2565502437]    fk: 2.31424349959       

	Parameter values: [0.49302848877008099, 10.00033158083793, 0.059534535832639797, 0.2565502443313093]
	Function value:   2.3142434995895798
	Iterations:       183
	Function calls:   469
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357863       
	k: 100      xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357863       

	Parameter values: [0.49302848877008099, 10.00033158083793, 0.059534535832639797, 0.2565502443313093]
	Function value:   2.3142435786327447
	Iterations:       189
	Function calls:   502
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357942       
	k: 100      xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357942       

	Parameter values: [0.49302848877008099, 10.00033158083793, 0.059534535832639797, 0.2565502443313093]
	Function value:   2.3142435794231759
	Iterations:       135
	Function calls:   335
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
	k: 100      xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       

	Parameter values: [0.49302848877008099, 10.00033158083793, 0.059534535832639797, 0.2565502443313093]
	Function value:   2.3142435794310812
	Iterations:       135
	Function calls:   335
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
	k: 100      xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       

	Parameter values: [0.49302848877008099, 10.00033158083793, 0.059534535832639797, 0.2565502443313093]
	Function value:   2.3142435794311593
	Iterations:       135
	Function calls:   335
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
	k: 100      xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       

	Parameter values: [0.49302848877008099, 10.00033158083793, 0.059534535832639797, 0.2565502443313093]
	Function value:   2.3142435794311607
	Iterations:       135
	Function calls:   335
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       
	k: 100      xk: [   0.4930284888,     10.00033158,   0.05953453583,    0.2565502443]    fk: 2.31424357943       

	Parameter values: [0.49302848877008099, 10.00033158083793, 0.059534535832639797, 0.2565502443313093]
	Function value:   2.3142435794311607
	Iterations:       135
	Function calls:   335
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.49302848877008099, 10.00033158083793, 0.059534535832639797, 0.2565502443313093]
Function value:   2.3142435794311607
Iterations:       1940
Function calls:   4426
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.930284887700810
r2 (800.000 MHz):          100.003315808379298
phi_ex:                      0.059534535832640
kex:                      2565.502443313092954

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/grace2images.py' for writing.

relax> value.write(param='phi_ex', file='phi_ex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/phi_ex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex', spin_id=None, plot_data='value', file='phi_ex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/phi_ex.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/k_AB.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/results.bz2' for writing.



---------------------------
- The 'LM63 3-site' model -
---------------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='LM63 3-site', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='LM63 3-site')

relax> relax_disp.select_model(model='LM63 3-site')
The Luz and Meiboom (1963) 3-site fast exchange model.

relax> value.copy(pipe_from='R2eff', pipe_to='LM63 3-site', param='r2eff')

relax> grid_search(lower=None, upper=None, inc=11, constraints=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------

Unconstrained grid search size: 1771561 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 1771561 grid nodes.
k: 0        xk: [            0.1,             0.1,               0,               0,          0.0001,          0.0001]    fk: 58690.3836395       
k: 1        xk: [           0.49,             0.1,               0,               0,          0.0001,          0.0001]    fk: 54077.5310766       
k: 2        xk: [           0.88,             0.1,               0,               0,          0.0001,          0.0001]    fk: 51836.7423585       
k: 11       xk: [            0.1,            0.49,               0,               0,          0.0001,          0.0001]    fk: 36765.2033243       
k: 12       xk: [           0.49,            0.49,               0,               0,          0.0001,          0.0001]    fk: 32152.3507614       
k: 13       xk: [           0.88,            0.49,               0,               0,          0.0001,          0.0001]    fk: 29911.5620433       
k: 22       xk: [            0.1,            0.88,               0,               0,          0.0001,          0.0001]    fk: 21336.9870945       
k: 23       xk: [           0.49,            0.88,               0,               0,          0.0001,          0.0001]    fk: 16724.1345316       
k: 24       xk: [           0.88,            0.88,               0,               0,          0.0001,          0.0001]    fk: 14483.3458134       
k: 33       xk: [            0.1,            1.27,               0,               0,          0.0001,          0.0001]    fk: 12405.7349501       
k: 34       xk: [           0.49,            1.27,               0,               0,          0.0001,          0.0001]    fk: 7792.8823872        
k: 35       xk: [           0.88,            1.27,               0,               0,          0.0001,          0.0001]    fk: 5552.09366906       
k: 45       xk: [           0.49,            1.66,               0,               0,          0.0001,          0.0001]    fk: 5358.59432823       
k: 46       xk: [           0.88,            1.66,               0,               0,          0.0001,          0.0001]    fk: 3117.80561009       
k: 29415    xk: [           0.49,            0.49,               1,               0,         2.00008,          0.0001]    fk: 1930.35692519       
k: 411401   xk: [           0.49,             0.1,               1,               1,         6.00004,         2.00008]    fk: 1798.81879326       
k: 426042   xk: [           0.49,             0.1,               1,               1,         7.00003,         2.00008]    fk: 1747.41589984       
k: 1158092  xk: [           0.49,             0.1,               1,               1,         2.00008,         7.00003]    fk: 1747.41589984       

Optimised parameter values:
r2 (500.000 MHz):            4.900000000000000
r2 (800.000 MHz):            1.000000000000000
phi_ex_B:                    1.000000000000000
phi_ex_C:                    1.000000000000000
kB:                      20000.799999999999272
kC:                      70000.300000000002910


Fitting to the spin block [':71@N']
-----------------------------------

Unconstrained grid search size: 1771561 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 1771561 grid nodes.
k: 0        xk: [            0.1,             0.1,               0,               0,          0.0001,          0.0001]    fk: 5170.80869563       
k: 1        xk: [           0.49,             0.1,               0,               0,          0.0001,          0.0001]    fk: 263.063937419       
k: 29403    xk: [            0.1,             0.1,               1,               0,         2.00008,          0.0001]    fk: 43.1772624931       
k: 572451   xk: [            0.1,             0.1,               1,               1,         6.00004,         3.00007]    fk: 41.6915188017       
k: 1011681  xk: [            0.1,             0.1,               1,               1,         3.00007,         6.00004]    fk: 41.6915188017       

Optimised parameter values:
r2 (500.000 MHz):            1.000000000000000
r2 (800.000 MHz):            1.000000000000000
phi_ex_B:                    1.000000000000000
phi_ex_C:                    1.000000000000000
kB:                      30000.700000000004366
kC:                      60000.400000000001455

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           0.49,             0.1,               1,               1,         2.00008,         7.00003]    fk: 1747.41589984       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           0.49,           0.105,               1,               1,         2.00008,         7.00003]    fk: 1747.18824793       
	k: 100      xk: [   0.6292525065,   0.01365523335,    0.8169405817,  0.007851740728,    0.9972917048,     14.25118722]    fk: 822.814764934       
	k: 200      xk: [   0.5469683943, 1.654629726e-05,    0.8836020249,  0.001491535632,     1.106310002,     15.97332531]    fk: 734.808017478       
	k: 300      xk: [   0.5434440302, 4.299027629e-05,    0.8865853466, 8.531383019e-05,     1.110937124,     16.02104129]    fk: 734.025303345       
	k: 400      xk: [   0.5407008429, 1.470103707e-06,    0.8887097794, 1.817238165e-05,     1.112584045,     16.07166285]    fk: 733.751471952       

	Parameter values: [0.54153429599942271, 2.3891999772093452e-06, 0.88425288080134257, 7.6970548058648042e-05, 1.1114829481978887, 16.311474584675153]
	Function value:   724.11452119128649
	Iterations:       500
	Function calls:   811
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [    0.541534296, 2.389199977e-06,    0.8842528808, 7.697054806e-05,     1.111482948,     16.31147458]    fk: 724.076666827       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.541534296, 2.389199977e-06,    0.8842528808, 7.697054806e-05,     1.111482948,     17.12704831]    fk: 724.075956249       
	k: 100      xk: [   0.4173155958, 3.548551226e-06,    0.6777439775, 9.542248477e-05,    0.7634973727,     8.814731376]    fk: 179.472327984       
	k: 200      xk: [   0.4173426862, 3.547924882e-06,    0.6778568133,  9.54106228e-05,    0.7637464411,      8.82090604]    fk: 179.47168015        
	k: 300      xk: [   0.4173391734, 3.521096346e-06,    0.6778584354, 9.632137532e-05,    0.7637452131,     8.938809419]    fk: 179.471679368       
	k: 400      xk: [   0.4173414807, 2.030227302e-06,    0.6778594428, 0.0001468800924,    0.7637477521,     15.48127485]    fk: 179.471640126       

	Parameter values: [0.41734205720922801, 2.0357034221762605e-06, 0.67785938188900952, 0.00014669429012068941, 0.76374766351567436, 15.457281060542176]
	Function value:   179.47164012269721
	Iterations:       500
	Function calls:   816
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4173420572, 2.035703422e-06,    0.6778593819, 0.0001466942901,    0.7637476635,     15.45728106]    fk: 179.471215804       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4173420572, 2.137488593e-06,    0.6778593819, 0.0001466942901,    0.7637476635,     15.45728106]    fk: 179.471219999       
	k: 100      xk: [   0.4173390214, 1.085832599e-05,    0.6778509477, 0.0007406866643,    0.7637453088,     66.53693853]    fk: 179.471216554       
	k: 200      xk: [   0.4173550885, 3.665646516e-05,    0.6778301691,  0.002418294688,    0.7637306367,     154.0552333]    fk: 179.471213542       
	k: 300      xk: [   0.4181722402,  0.002139213808,    0.6751760773,    0.1650531602,    0.7622354733,     174.1483665]    fk: 179.471205879       
	k: 400      xk: [   0.4220590361,   0.01208660724,    0.6625806826,    0.9350046098,    0.7551047308,     172.1840035]    fk: 179.471202412       

	Parameter values: [0.42745948270368694, 0.025905238418848585, 0.64498698606578997, 2.005150181807223, 0.7450225052813646, 169.17805939029029]
	Function value:   179.47120057190978
	Iterations:       500
	Function calls:   784
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.4274594827,   0.02590523842,    0.6449869861,     2.005150182,    0.7450225053,     169.1780594]    fk: 179.471215973       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4274594827,   0.02590523842,    0.6449869861,     2.005150182,    0.7450225053,     169.1780594]    fk: 179.471215701       
	k: 100      xk: [   0.4275154673,   0.02604606593,    0.6449064978,     2.013489978,     0.744974495,     169.8944729]    fk: 179.471215652       
	k: 200      xk: [   0.4275158066,   0.02604677447,    0.6449060732,     2.013535296,     0.744974237,     169.8983049]    fk: 179.471215652       

	Parameter values: [0.42751580657005661, 0.026046774470019643, 0.64490607321987292, 2.0135352961446635, 0.74497423696309206, 169.89830486450649]
	Function value:   179.4712156517185
	Iterations:       257
	Function calls:   657
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.4275158066,   0.02604677447,    0.6449060732,     2.013535296,     0.744974237,     169.8983049]    fk: 179.471215804       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4275158066,   0.02604677447,    0.6449060732,     2.013535296,     0.744974237,     169.8983049]    fk: 179.471215803       
	k: 100      xk: [   0.4275158066,   0.02604677447,    0.6449060732,     2.013535296,     0.744974237,     169.8983049]    fk: 179.471215803       
	k: 200      xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215803       

	Parameter values: [0.42751575072638959, 0.026046631489205409, 0.64490615337214252, 2.013526992295454, 0.74497428341719707, 169.8975845974096]
	Function value:   179.47121580291255
	Iterations:       279
	Function calls:   701
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
	k: 100      xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
	k: 200      xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       

	Parameter values: [0.42751575072646103, 0.026046631489407727, 0.64490615337203572, 2.0135269923069408, 0.74497428341713712, 169.89758459843208]
	Function value:   179.47121580442445
	Iterations:       256
	Function calls:   687
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
	k: 100      xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
	k: 200      xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       

	Parameter values: [0.42751575072646103, 0.026046631489407727, 0.64490615337203572, 2.0135269923069408, 0.74497428341713712, 169.89758459843208]
	Function value:   179.47121580443959
	Iterations:       245
	Function calls:   675
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
	k: 100      xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
	k: 200      xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       

	Parameter values: [0.42751575072646103, 0.026046631489407727, 0.64490615337203572, 2.0135269923069408, 0.74497428341713712, 169.89758459843208]
	Function value:   179.47121580443977
	Iterations:       245
	Function calls:   675
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
	k: 100      xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       
	k: 200      xk: [   0.4275157507,   0.02604663149,    0.6449061534,     2.013526992,    0.7449742834,     169.8975846]    fk: 179.471215804       

	Parameter values: [0.42751575072646103, 0.026046631489407727, 0.64490615337203572, 2.0135269923069408, 0.74497428341713712, 169.89758459843208]
	Function value:   179.47121580443977
	Iterations:       245
	Function calls:   675
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.42751575072646103, 0.026046631489407727, 0.64490615337203572, 2.0135269923069408, 0.74497428341713712, 169.89758459843208]
Function value:   179.47121580443977
Iterations:       3027
Function calls:   6481
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.275157507264610
r2 (800.000 MHz):            0.260466314894077
phi_ex_B:                    0.644906153372036
phi_ex_C:                    2.013526992306941
kB:                       7449.742834171371214
kC:                    1698975.845984320854768


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [            0.1,             0.1,               1,               1,         3.00007,         6.00004]    fk: 41.6915188017       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [            0.1,             0.1,               1,            1.05,         3.00007,         6.00004]    fk: 40.5299133844       
	k: 100      xk: [ 0.000716776116,    0.0367424847,     1.381104155,   0.03006591317,     2.167191746,     4.006368338]    fk: 18.6676298021       
	k: 200      xk: [0.0001002925883,   0.03486925902,     1.381553451,  0.001124402423,      2.16035062,     3.923299469]    fk: 17.6387447511       
	k: 300      xk: [0.0003208316613, 0.0003233661813,     1.342481934, 0.0004357293384,     2.088512489,     2.878427539]    fk: 16.6066644882       
	k: 400      xk: [0.0001821069037, 0.0003344990501,     1.342809145, 0.0004884738765,     2.088320732,      2.88268265]    fk: 16.60469324         

	Parameter values: [0.00018452357830311044, 0.00032621898206914093, 1.342791079413038, 0.00048195920289841748, 2.0883368426178657, 2.882307851371225]
	Function value:   16.604685384665835
	Iterations:       500
	Function calls:   833
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [0.0001845235783, 0.0003262189821,     1.342791079, 0.0004819592029,     2.088336843,     2.882307851]    fk: 16.5485787207       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [0.0001845235783, 0.0003262189821,     1.342791079, 0.0004819592029,     2.088336843,     3.026423244]    fk: 16.5489466533       
	k: 100      xk: [3.100300397e-05, 0.0004339417126,     0.978682865,  0.001332143364,     1.450480935,     7.213216989]    fk: 8.93571690232       
	k: 200      xk: [  3.1812325e-05, 0.0004309175179,    0.9761929108,  0.001340955369,     1.445990657,      7.26141633]    fk: 8.93485421407       
	k: 300      xk: [0.0003255115565, 0.0001804046733,    0.9754521034,  0.001559531971,     1.445430493,     10.75005116]    fk: 8.93465634302       
	k: 400      xk: [0.0003213252128,  0.000184289091,    0.9754732834,  0.001555743703,     1.445453677,     10.69798362]    fk: 8.93465620714       

	Parameter values: [0.0008726132471471716, 0.00030095662800828297, 0.97413790860261362, 0.00069941043350216616, 1.44443272976189, 12.924888879299548]
	Function value:   8.9345698017471022
	Iterations:       500
	Function calls:   792
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [0.0008726132471,  0.000300956628,    0.9741379086, 0.0006994104335,      1.44443273,     12.92488888]    fk: 8.93426948363       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [0.0008726132471,  0.000300956628,    0.9741379086, 0.0006994104335,      1.44443273,     13.57113332]    fk: 8.93427230954       
	k: 100      xk: [0.0007008910308, 0.0009848638456,    0.9741808107,  0.002238633511,     1.444487274,     10.16796652]    fk: 8.93427064409       
	k: 200      xk: [0.0003236753954,  0.002336599032,    0.9744839801,  0.005463760461,     1.444762398,      10.7985296]    fk: 8.93426940847       
	k: 300      xk: [0.0009060555667,  0.002201958376,    0.9728256278,  0.004304325358,     1.443553466,     8.328076835]    fk: 8.93426892996       
	k: 400      xk: [ 0.001050266166,  0.007790872889,     0.969633329,    0.0139775787,     1.441453123,     8.760435963]    fk: 8.93426719203       

	Parameter values: [0.0038147842516615864, 0.096482531267142596, 0.9151925246025665, 0.16552062082313151, 1.4034936549982682, 8.4967641258480491]
	Function value:   8.9342601744818744
	Iterations:       500
	Function calls:   784
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [ 0.003814784252,   0.09648253127,    0.9151925246,    0.1655206208,     1.403493655,     8.496764126]    fk: 8.93426947062       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [ 0.003814784252,    0.1013066578,    0.9151925246,    0.1655206208,     1.403493655,     8.496764126]    fk: 8.93426929855       
	k: 100      xk: [ 0.003819563085,   0.09928426768,    0.9152270557,    0.1655463209,     1.403515817,     8.507195266]    fk: 8.9342692573        
	k: 200      xk: [ 0.003513170497,     2.318263142,    0.9168739726,    0.1609103066,     1.404774979,     8.392307717]    fk: 8.93426922842       
	k: 300      xk: [ 0.003207695572,     4.855452398,    0.9189739764,    0.1557226591,     1.406322303,     8.327631578]    fk: 8.93426922368       
	k: 400      xk: [ 0.002902457376,     7.825341355,    0.9216766665,    0.1498155504,     1.408255585,     8.333159746]    fk: 8.93426922238       

	Parameter values: [0.0030501645541895269, 7.0363742632425073, 0.92123324462622547, 0.15163060084926067, 1.4078743551938153, 8.4377625947849246]
	Function value:   8.9342692221176012
	Iterations:       500
	Function calls:   803
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [ 0.003050164554,     7.036374263,    0.9212332446,    0.1516306008,     1.407874355,     8.437762595]    fk: 8.93426934986       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [ 0.003050164554,     7.388192976,    0.9212332446,    0.1516306008,     1.407874355,     8.437762595]    fk: 8.93426934853       
	k: 100      xk: [ 0.003050914554,     7.303301424,    0.9212381008,    0.1516182783,      1.40787787,     8.438302607]    fk: 8.93426934849       
	k: 200      xk: [ 0.003052740045,      10.0508244,    0.9212505327,    0.1515822675,     1.407885636,     8.439596837]    fk: 8.93426934849       
	k: 300      xk: [ 0.003052739987,     10.05070026,    0.9212505323,    0.1515822687,     1.407885635,     8.439596792]    fk: 8.93426934849       

	Parameter values: [0.0030527399874156927, 10.05070025915964, 0.92125053226797871, 0.15158226873047667, 1.4078856354707707, 8.4395967922014101]
	Function value:   8.9342693484869216
	Iterations:       321
	Function calls:   807
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [ 0.003052739987,     10.05070026,    0.9212505323,    0.1515822687,     1.407885635,     8.439596792]    fk: 8.93426934977       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [ 0.003052739987,     10.05070026,    0.9212505323,    0.1515822687,     1.407885635,     8.439596792]    fk: 8.93426934976       
	k: 100      xk: [ 0.003052739987,     10.05070026,    0.9212505323,    0.1515822687,     1.407885635,     8.439596792]    fk: 8.93426934976       
	k: 200      xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934976       

	Parameter values: [0.0030527119662192284, 10.176380291414103, 0.92125084434121429, 0.15158182897372269, 1.4078858480043492, 8.4396168895770067]
	Function value:   8.9342693497602426
	Iterations:       205
	Function calls:   556
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       
	k: 100      xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       
	k: 200      xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       

	Parameter values: [0.0030527119662192301, 10.17638029236185, 0.9212508443412144, 0.15158182897372274, 1.4078858480043492, 8.4396168895770067]
	Function value:   8.9342693497729684
	Iterations:       202
	Function calls:   546
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       
	k: 100      xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       
	k: 200      xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       

	Parameter values: [0.0030527119662192301, 10.17638029236185, 0.9212508443412144, 0.15158182897372274, 1.4078858480043492, 8.4396168895770067]
	Function value:   8.9342693497730981
	Iterations:       201
	Function calls:   543
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       
	k: 100      xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       
	k: 200      xk: [ 0.003052711966,     10.17638029,    0.9212508443,     0.151581829,     1.407885848,      8.43961689]    fk: 8.93426934977       

	Parameter values: [0.0030527119662192301, 10.17638029236185, 0.9212508443412144, 0.15158182897372274, 1.4078858480043492, 8.4396168895770067]
	Function value:   8.9342693497730981
	Iterations:       201
	Function calls:   543
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.0030527119662192301, 10.17638029236185, 0.9212508443412144, 0.15158182897372274, 1.4078858480043492, 8.4396168895770067]
Function value:   8.9342693497730981
Iterations:       3130
Function calls:   6207
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            0.030527119662192
r2 (800.000 MHz):          101.763802923618499
phi_ex_B:                    0.921250844341214
phi_ex_C:                    0.151581828973723
kB:                      14078.858480043492818
kC:                      84396.168895770068048

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/grace2images.py' for writing.

relax> value.write(param='phi_ex_B', file='phi_ex_B.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/phi_ex_B.out' for writing.

relax> value.write(param='phi_ex_C', file='phi_ex_C.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/phi_ex_C.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex_B', spin_id=None, plot_data='value', file='phi_ex_B.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/phi_ex_B.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex_C', spin_id=None, plot_data='value', file='phi_ex_C.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/phi_ex_C.agr' for writing.

relax> value.write(param='kB', file='kB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/kB.out' for writing.

relax> value.write(param='kC', file='kC.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/kC.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kB', spin_id=None, plot_data='value', file='kB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/kB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kC', spin_id=None, plot_data='value', file='kC.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/kC.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/results.bz2' for writing.



--------------------
- The 'CR72' model -
--------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='CR72', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='CR72')

relax> relax_disp.select_model(model='CR72')
The reduced Carver and Richards (1972) 2-site model for all time scales, whereby the simplification R20A = R20B is assumed.

relax> value.copy(pipe_from='R2eff', pipe_to='CR72', param='r2eff')

relax> grid_search(lower=None, upper=None, inc=11, constraints=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------

Unconstrained grid search size: 161051 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 161051 grid nodes.
k: 0        xk: [            0.1,             0.1,               0,             0.5,          0.0001]    fk: 58690.3836395       
k: 1        xk: [           0.49,             0.1,               0,             0.5,          0.0001]    fk: 54077.5310766       
k: 2        xk: [           0.88,             0.1,               0,             0.5,          0.0001]    fk: 51836.7423585       
k: 11       xk: [            0.1,            0.49,               0,             0.5,          0.0001]    fk: 36765.2033243       
k: 12       xk: [           0.49,            0.49,               0,             0.5,          0.0001]    fk: 32152.3507614       
k: 13       xk: [           0.88,            0.49,               0,             0.5,          0.0001]    fk: 29911.5620433       
k: 22       xk: [            0.1,            0.88,               0,             0.5,          0.0001]    fk: 21336.9870945       
k: 23       xk: [           0.49,            0.88,               0,             0.5,          0.0001]    fk: 16724.1345316       
k: 24       xk: [           0.88,            0.88,               0,             0.5,          0.0001]    fk: 14483.3458134       
k: 33       xk: [            0.1,            1.27,               0,             0.5,          0.0001]    fk: 12405.7349501       
k: 34       xk: [           0.49,            1.27,               0,             0.5,          0.0001]    fk: 7792.8823872        
k: 35       xk: [           0.88,            1.27,               0,             0.5,          0.0001]    fk: 5552.09366905       
k: 45       xk: [           0.49,            1.66,               0,             0.5,          0.0001]    fk: 5358.59432823       
k: 46       xk: [           0.88,            1.66,               0,             0.5,          0.0001]    fk: 3117.80561008       
k: 167      xk: [           0.88,            1.66,               1,             0.5,          0.0001]    fk: 3065.74686209       
k: 288      xk: [           0.88,            1.66,               2,             0.5,          0.0001]    fk: 2993.71549833       
k: 409      xk: [           0.88,            1.66,               3,             0.5,          0.0001]    fk: 2936.87641936       
k: 530      xk: [           0.88,            1.66,               4,             0.5,          0.0001]    fk: 2914.3172496        
k: 651      xk: [           0.88,            1.66,               5,             0.5,          0.0001]    fk: 2879.73149046       
k: 772      xk: [           0.88,            1.66,               6,             0.5,          0.0001]    fk: 2878.75370197       
k: 14797    xk: [           0.88,            1.27,               1,             0.5,         1.00009]    fk: 2371.05041649       
k: 16128    xk: [           0.88,            1.27,               1,            0.55,         1.00009]    fk: 2345.59348172       
k: 17459    xk: [           0.88,            1.27,               1,             0.6,         1.00009]    fk: 2276.19549134       
k: 18790    xk: [           0.88,            1.27,               1,            0.65,         1.00009]    fk: 2183.76505289       
k: 20121    xk: [           0.88,            1.27,               1,             0.7,         1.00009]    fk: 2103.11709459       
k: 20207    xk: [            0.1,             0.1,               2,             0.7,         1.00009]    fk: 1681.86926937       
k: 20208    xk: [           0.49,             0.1,               2,             0.7,         1.00009]    fk: 1095.63350359       
k: 21539    xk: [           0.49,             0.1,               2,            0.75,         1.00009]    fk: 532.150984193       

Optimised parameter values:
r2 (500.000 MHz):            4.900000000000000
r2 (800.000 MHz):            1.000000000000000
dw:                          2.000000000000000
pA:                          0.750000000000000
kex:                     10000.900000000001455


Fitting to the spin block [':71@N']
-----------------------------------

Unconstrained grid search size: 161051 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 161051 grid nodes.
k: 0        xk: [            0.1,             0.1,               0,             0.5,          0.0001]    fk: 5170.80869563       
k: 1        xk: [           0.49,             0.1,               0,             0.5,          0.0001]    fk: 263.063937419       
k: 122      xk: [           0.49,             0.1,               1,             0.5,          0.0001]    fk: 253.714678554       
k: 243      xk: [           0.49,             0.1,               2,             0.5,          0.0001]    fk: 232.471472444       
k: 364      xk: [           0.49,             0.1,               3,             0.5,          0.0001]    fk: 216.565307086       
k: 485      xk: [           0.49,             0.1,               4,             0.5,          0.0001]    fk: 205.014250184       
k: 606      xk: [           0.49,             0.1,               5,             0.5,          0.0001]    fk: 187.385546071       
k: 727      xk: [           0.49,             0.1,               6,             0.5,          0.0001]    fk: 180.526060328       
k: 848      xk: [           0.49,             0.1,               7,             0.5,          0.0001]    fk: 172.696938829       
k: 969      xk: [           0.49,             0.1,               8,             0.5,          0.0001]    fk: 161.943407893       
k: 1090     xk: [           0.49,             0.1,               9,             0.5,          0.0001]    fk: 157.262101233       
k: 1211     xk: [           0.49,             0.1,              10,             0.5,          0.0001]    fk: 148.950736539       
k: 21418    xk: [           0.49,             0.1,               1,            0.75,         1.00009]    fk: 101.433251807       
k: 22749    xk: [           0.49,             0.1,               1,             0.8,         1.00009]    fk: 62.8440957442       
k: 22869    xk: [            0.1,             0.1,               2,             0.8,         1.00009]    fk: 32.0257070392       

Optimised parameter values:
r2 (500.000 MHz):            1.000000000000000
r2 (800.000 MHz):            1.000000000000000
dw:                          2.000000000000000
pA:                          0.800000000000000
kex:                     10000.900000000001455

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           0.49,             0.1,               2,            0.75,         1.00009]    fk: 532.150984193       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           0.49,           0.105,               2,            0.75,         1.00009]    fk: 530.519285878       
	k: 100      xk: [   0.4649329643,    0.1250622864,     1.962234167,    0.8151616659,    0.6769497171]    fk: 153.797782262       
	k: 200      xk: [   0.4789480376,      0.15998637,      1.78892134,    0.7743835454,    0.6636343229]    fk: 153.130862551       
	k: 300      xk: [   0.4935930031,     0.191353145,     1.613915255,     0.705202998,    0.6540572503]    fk: 152.532629702       
	k: 400      xk: [   0.4963435123,    0.2002609308,     1.554195194,    0.6667904021,    0.6513832789]    fk: 152.37675752        

	Parameter values: [0.49787524531927185, 0.20473453978706391, 1.5152172018137029, 0.63142934108712923, 0.64998569900362813]
	Function value:   152.33021311310773
	Iterations:       500
	Function calls:   786
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4978752453,    0.2047345398,     1.515217202,    0.6314293411,     0.649985699]    fk: 152.389601637       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4978752453,    0.2047345398,     1.515217202,    0.6314293411,     0.649985699]    fk: 152.388869887       
	k: 100      xk: [   0.5239975142,    0.2726965696,     1.553753535,    0.7106605884,    0.6222855901]    fk: 149.649580941       
	k: 200      xk: [   0.6094520478,    0.5218014796,     1.403834058,    0.7458540044,    0.5280240307]    fk: 141.801902678       
	k: 300      xk: [   0.6777728439,    0.6684360544,     1.422849594,    0.8135697425,    0.4615356392]    fk: 136.419676621       
	k: 400      xk: [   0.6704153725,    0.6556471167,     1.596963177,    0.8566149383,     0.465222024]    fk: 135.247020293       

	Parameter values: [0.68769075540576807, 0.69722038326394742, 1.8268251848079871, 0.90152861379104454, 0.44422559558130681]
	Function value:   132.74049881170939
	Iterations:       500
	Function calls:   791
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.6876907554,    0.6972203833,     1.826825185,    0.9015286138,    0.4442255956]    fk: 132.887397021       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6876907554,    0.6972203833,     1.826825185,    0.9015286138,    0.4442255956]    fk: 132.74119604        
	k: 100      xk: [   0.7081452493,    0.7528410352,     1.905369587,    0.9179149811,    0.4171045099]    fk: 132.051728083       
	k: 200      xk: [   0.6916721058,    0.7123513336,     2.171918355,    0.9340193957,     0.431014818]    fk: 128.770341711       
	k: 300      xk: [   0.6608753734,    0.6383440631,     3.040656993,    0.9636991465,    0.4348163102]    fk: 120.112085244       
	k: 400      xk: [   0.7005788407,    0.8304000618,     3.534936033,    0.9793524208,    0.3128806968]    fk: 112.097335175       

	Parameter values: [0.68496298855934912, 0.93270839258198857, 4.8042692410789769, 0.98790173699859229, 0.17829324735291219]
	Function value:   76.542552366432304
	Iterations:       500
	Function calls:   816
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.6849629886,    0.9327083926,     4.804269241,     0.987901737,    0.1782932474]    fk: 76.5425578375       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.719211138,    0.9327083926,     4.804269241,     0.987901737,    0.1782932474]    fk: 66.8096410173       
	k: 100      xk: [    0.697548549,    0.9449623989,     5.613007829,    0.9897973049,    0.1712590747]    fk: 17.3957626965       
	k: 200      xk: [   0.6974995228,    0.9449945838,     5.613493303,    0.9898002895,    0.1713098506]    fk: 17.3955922621       
	k: 300      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955922614       

	Parameter values: [0.69749962090443951, 0.94499458999959352, 5.6134943960989787, 0.98980029581923779, 0.17131000138619762]
	Function value:   17.395592261381189
	Iterations:       339
	Function calls:   696
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923153       
	k: 100      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923153       
	k: 200      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923153       

	Parameter values: [0.69749962090443951, 0.94499458999959352, 5.6134943960989787, 0.98980029581923779, 0.17131000138619762]
	Function value:   17.395592315335538
	Iterations:       291
	Function calls:   580
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
	k: 100      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
	k: 200      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       

	Parameter values: [0.69749962090443951, 0.94499458999959352, 5.6134943960989787, 0.98980029581923779, 0.17131000138619762]
	Function value:   17.395592315875085
	Iterations:       291
	Function calls:   580
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
	k: 100      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
	k: 200      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       

	Parameter values: [0.69749962090443951, 0.94499458999959352, 5.6134943960989787, 0.98980029581923779, 0.17131000138619762]
	Function value:   17.395592315880481
	Iterations:       291
	Function calls:   580
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
	k: 100      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
	k: 200      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       

	Parameter values: [0.69749962090443951, 0.94499458999959352, 5.6134943960989787, 0.98980029581923779, 0.17131000138619762]
	Function value:   17.395592315880535
	Iterations:       291
	Function calls:   580
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
	k: 100      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
	k: 200      xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       

	Parameter values: [0.69749962090443951, 0.94499458999959352, 5.6134943960989787, 0.98980029581923779, 0.17131000138619762]
	Function value:   17.395592315880535
	Iterations:       291
	Function calls:   580
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.69749962090443951, 0.94499458999959352, 5.6134943960989787, 0.98980029581923779, 0.17131000138619762]
Function value:   17.395592315880535
Iterations:       3294
Function calls:   5989
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.974996209044395
r2 (800.000 MHz):            9.449945899995935
dw:                          5.613494396098979
pA:                          0.989800295819238
kex:                      1713.100013861976095


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [            0.1,             0.1,               2,             0.8,         1.00009]    fk: 32.0257070392       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [            0.1,             0.1,               2,             0.8,       1.0500945]    fk: 13.6368212439       
	k: 100      xk: [   0.1058547094,   0.09419697841,     1.963184075,    0.7639632477,     1.216344814]    fk: 8.78607595264       
	k: 200      xk: [   0.4857132204,   0.03950242283,    0.5182926301,     0.648356832,    0.2511686301]    fk: 2.90078483972       
	k: 300      xk: [    0.492904278,    0.0282206725,    0.5068975692,    0.6342677292,    0.2569517001]    fk: 2.29522372833       
	k: 400      xk: [   0.4928344419,   0.07999994885,    0.5382463524,    0.7106706927,    0.2568304972]    fk: 2.2824276594        

	Parameter values: [0.49304441645940689, 0.11767159842265174, 0.58297509847158968, 0.77376061769981019, 0.25635562042351256]
	Function value:   2.2768259265641735
	Iterations:       500
	Function calls:   805
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4930444165,    0.1176715984,    0.5829750985,    0.7737606177,    0.2563556204]    fk: 2.31446134744       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930444165,    0.1235551783,    0.5829750985,    0.7737606177,    0.2563556204]    fk: 2.31372986379       
	k: 100      xk: [   0.4929202819,    0.2624563827,    0.5915647811,    0.7822289907,      0.25669969]    fk: 2.31353493107       
	k: 200      xk: [   0.4930297289,    0.7631814287,     0.615520438,    0.8046947042,    0.2563067764]    fk: 2.31321067524       
	k: 300      xk: [   0.4930790346,     1.346067485,    0.6429155981,    0.8255674705,    0.2562066107]    fk: 2.3129379187        
	k: 400      xk: [   0.4929464053,     1.925276568,    0.6768444734,    0.8461706231,    0.2563689489]    fk: 2.31263279759       

	Parameter values: [0.49318225389735693, 2.7363170358878808, 0.72103521632894285, 0.86835645762223335, 0.25529308639446235]
	Function value:   2.3123080525341191
	Iterations:       500
	Function calls:   802
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4931822539,     2.736317036,    0.7210352163,    0.8683564576,    0.2552930864]    fk: 2.31297778989       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4931822539,     2.873132888,    0.7210352163,    0.8683564576,    0.2552930864]    fk: 2.31297105169       
	k: 100      xk: [   0.4930163409,     1.529824575,    0.7359070425,    0.8740755144,    0.2559997723]    fk: 2.31271183736       
	k: 200      xk: [   0.4931168596,  0.004972295237,    0.7592416427,     0.882972402,    0.2558182938]    fk: 2.31249304365       
	k: 300      xk: [   0.4931661771,     3.061071973,    0.7847394147,    0.8915597195,    0.2554789025]    fk: 2.3122299788        
	k: 400      xk: [   0.4930947552,      15.7860774,    0.8262432097,    0.9034212406,    0.2553448094]    fk: 2.31182597718       

	Parameter values: [0.49313875986498845, 19.96237502308697, 0.83521158437428322, 0.90572061881994381, 0.25533513570628719]
	Function value:   2.3116951660309311
	Iterations:       500
	Function calls:   816
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.4931387599,     19.96237502,    0.8352115844,    0.9057206188,    0.2553351357]    fk: 2.31169789162       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4931387599,     19.96237502,    0.8352115844,    0.9057206188,    0.2553351357]    fk: 2.31169760714       
	k: 100      xk: [      0.4931015,     19.38715399,    0.8672955948,    0.9132165876,     0.255345465]    fk: 2.31135123449       
	k: 200      xk: [   0.4932229704,     18.15681762,    0.9340766474,    0.9263347696,    0.2544934699]    fk: 2.31060140362       
	k: 300      xk: [     0.49316486,      16.1349514,     1.033982835,    0.9406765104,    0.2545685745]    fk: 2.3093397736        
	k: 400      xk: [   0.4933223312,     15.46762171,     1.065418961,    0.9444498428,    0.2539629535]    fk: 2.30890766748       

	Parameter values: [0.49324483276410902, 12.798679970292508, 1.183611641167019, 0.95539327786443162, 0.253416361130686]
	Function value:   2.3071768391460998
	Iterations:       500
	Function calls:   804
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.4932448328,     12.79867997,     1.183611641,    0.9553932779,    0.2534163611]    fk: 2.30719892825       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4932448328,     12.79867997,     1.183611641,    0.9553932779,    0.2534163611]    fk: 2.30717690829       
	k: 100      xk: [   0.4933480054,     1.101159153,     1.213817949,    0.9577461949,    0.2530722791]    fk: 2.30672876083       
	k: 200      xk: [    0.493338218, 0.0003153868254,     1.216290036,    0.9579163525,    0.2529151683]    fk: 2.30664449834       
	k: 300      xk: [   0.4933308124, 7.794939622e-06,      1.21643029,    0.9579241206,     0.252927412]    fk: 2.30664416573       
	k: 400      xk: [   0.4934383356,   0.09408884369,     1.221994624,    0.9583953733,    0.2525378591]    fk: 2.3065903783        

	Parameter values: [0.4930864658482621, 1.7450032724855191, 1.3025470842370233, 0.96335618800926959, 0.25304717637694907]
	Function value:   2.3054225067029428
	Iterations:       500
	Function calls:   812
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 5        xk: [   0.4930864658,     1.745003272,     1.302547084,     0.963356188,    0.2530471764]    fk: 2.30542250729       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4930864658,     1.832253436,     1.302547084,     0.963356188,    0.2530471764]    fk: 2.30542250728       
	k: 100      xk: [   0.4933399964,     1.262573893,     1.341687366,    0.9656446835,    0.2521230589]    fk: 2.30459863022       
	k: 200      xk: [   0.4934906374, 0.0001912938374,     1.388435985,    0.9680275628,    0.2515544239]    fk: 2.3037464906        
	k: 300      xk: [   0.4934743713, 0.0001132861939,     1.388644221,    0.9680295771,     0.251609577]    fk: 2.30374559058       
	k: 400      xk: [   0.4934723563, 1.075747117e-09,     1.388692957,     0.968030181,    0.2516177565]    fk: 2.30374502675       

	Parameter values: [0.49347137126205931, 7.9366699960051619e-09, 1.3887025560819277, 0.96803025876918036, 0.25162054346100693]
	Function value:   2.3037450248213931
	Iterations:       500
	Function calls:   832
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 6        xk: [   0.4934713713, 7.936669996e-09,     1.388702556,    0.9680302588,    0.2516205435]    fk: 2.30374502483       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4934713713, 8.333503496e-09,     1.388702556,    0.9680302588,    0.2516205435]    fk: 2.30374502481       
	k: 100      xk: [   0.4937236058, 1.802572875e-09,     1.513950864,    0.9733101637,    0.2495879293]    fk: 2.30153322266       
	k: 200      xk: [   0.4934205809, 2.721237408e-08,     1.720008554,    0.9792978415,    0.2489870553]    fk: 2.29735929202       
	k: 300      xk: [   0.4943824171,  3.27359924e-08,     1.950277256,    0.9840905787,    0.2445747581]    fk: 2.29185789261       
	k: 400      xk: [   0.4938675586, 5.670037151e-08,     2.102758557,    0.9862021729,    0.2444070659]    fk: 2.28792611037       

	Parameter values: [0.49382194202737417, 8.1191649591662017e-08, 2.3524507375164436, 0.98893737579493068, 0.24207478927171444]
	Function value:   2.281593757023225
	Iterations:       500
	Function calls:   802
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 7        xk: [    0.493821942, 8.119164959e-08,     2.352450738,    0.9889373758,    0.2420747893]    fk: 2.28159375702       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.493821942, 8.119164959e-08,     2.352450738,    0.9889373758,    0.2420747893]    fk: 2.28159375702       
	k: 100      xk: [   0.4953733398, 8.437703682e-08,     2.514216349,    0.9904626564,    0.2357568303]    fk: 2.27619165967       
	k: 200      xk: [   0.4952886047, 3.343886458e-07,     2.850296821,    0.9925141041,    0.2307045041]    fk: 2.26491986207       
	k: 300      xk: [   0.4970424539, 7.417530152e-07,     3.281552233,    0.9943714995,    0.2195001657]    fk: 2.25121976475       
	k: 400      xk: [    0.497618269, 1.466300868e-06,     3.869019452,    0.9958557733,    0.2064692589]    fk: 2.23234078704       

	Parameter values: [0.49815423315388474, 2.0909796667170597e-06, 4.3272247530736774, 0.99658695076489723, 0.19400002024539714]
	Function value:   2.2244078104089633
	Iterations:       500
	Function calls:   796
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 8        xk: [   0.4981542332, 2.090979667e-06,     4.327224753,    0.9965869508,    0.1940000202]    fk: 2.22443750638       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4981542332, 2.090979667e-06,     4.327224753,    0.9965869508,    0.1940000202]    fk: 2.22440781041       
	k: 100      xk: [   0.4981351314, 2.051291222e-06,     4.347140079,    0.9966122421,    0.1935656816]    fk: 2.22438532163       
	k: 200      xk: [   0.4981350628, 2.051434888e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.22438532155       

	Parameter values: [0.4981350627780482, 2.0514348876516432e-06, 4.3471762591833638, 0.99661228659617862, 0.19356492525875826]
	Function value:   2.224385321546388
	Iterations:       258
	Function calls:   597
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4981350628, 2.051434888e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.22438532155       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4981350628, 2.051434888e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.22438532155       
	k: 100      xk: [   0.4981350628, 2.051434888e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.22438532155       

	Parameter values: [0.4981350627780482, 2.0514348876516432e-06, 4.3471762591833638, 0.99661228659617862, 0.19356492525875826]
	Function value:   2.224385321546388
	Iterations:       178
	Function calls:   443
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.4981350627780482, 2.0514348876516432e-06, 4.3471762591833638, 0.99661228659617862, 0.19356492525875826]
Function value:   2.224385321546388
Iterations:       4436
Function calls:   7509
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.981350627780482
r2 (800.000 MHz):            0.000020514348877
dw:                          4.347176259183364
pA:                          0.996612286596179
kex:                      1935.649252587582623

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/dw.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/results.bz2' for writing.



-------------------------
- The 'CR72 full' model -
-------------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='CR72 full', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='CR72 full')

relax> relax_disp.select_model(model='CR72 full')
The full Carver and Richards (1972) 2-site model for all time scales.

relax> value.copy(pipe_from='R2eff', pipe_to='CR72 full', param='r2eff')
Model nesting detected, copying the optimised parameters from the 'CR72' model rather than performing a grid search.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.6974996209,      0.94499459,    0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.3955923159       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6974996209,      0.94499459,    0.6974996209,    0.9922443195,     5.613494396,    0.9898002958,    0.1713100014]    fk: 17.2655955159       
	k: 100      xk: [   0.7019682542,    0.9425648103,    0.0128482581,     1.551442046,     5.584146162,    0.9897206657,    0.1707661697]    fk: 16.8033324646       
	k: 200      xk: [   0.7040770331,    0.9289950924,   0.01202126187,     3.059780817,     5.497682503,    0.9896397918,    0.1779225404]    fk: 16.4167634996       
	k: 300      xk: [   0.7040263473,    0.9295102355,   0.01322639856,     3.086279236,     5.496495506,     0.989635335,    0.1775670255]    fk: 16.4138220492       
	k: 400      xk: [   0.7018296554,    0.9267333159,  0.003867491577,      3.14930234,     5.520772154,    0.9896693483,    0.1778367785]    fk: 16.368727874        

	Parameter values: [0.69995547021711424, 0.91674235300769347, 0.085558275675693962, 3.8209280794884304, 5.4935446465615065, 0.98953977000005722, 0.17896109776783931]
	Function value:   16.047375134566863
	Iterations:       500
	Function calls:   768
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.6999554702,     0.916742353,   0.08555827568,     3.820928079,     5.493544647,      0.98953977,    0.1789610978]    fk: 16.1509051495       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6999554702,     0.916742353,   0.08555827568,     4.011974483,     5.493544647,      0.98953977,    0.1789610978]    fk: 16.1281860329       
	k: 100      xk: [   0.6835071817,    0.8613202184,   0.03620801528,     8.379416927,     5.519866732,    0.9891879847,    0.1807927888]    fk: 15.2385909678       
	k: 200      xk: [   0.6746034472,    0.8177740591,  0.000702995447,     10.99755131,     5.463867714,    0.9889206758,    0.1926832489]    fk: 14.6647810164       
	k: 300      xk: [   0.6744706261,    0.8155181536, 1.890306121e-05,     11.17222379,     5.464987464,    0.9889136989,    0.1930266571]    fk: 14.6592212239       
	k: 400      xk: [   0.6745720948,    0.8158261511, 2.135816028e-05,     11.13164419,     5.462977721,    0.9889157709,    0.1932233918]    fk: 14.6585924936       

	Parameter values: [0.67493041232696305, 0.81587341896387278, 2.7622612713698342e-05, 11.114522432592508, 5.4587550083954319, 0.98891075881575219, 0.19336606387978961]
	Function value:   14.651729348648235
	Iterations:       500
	Function calls:   759
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.6749304123,     0.815873419, 2.762261271e-05,     11.11452243,     5.458755008,    0.9889107588,    0.1933660639]    fk: 14.6537018496       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6749304123,     0.815873419, 2.762261271e-05,     11.11452243,     5.458755008,    0.9889107588,    0.1933660639]    fk: 14.6519812458       
	k: 100      xk: [   0.6756924496,    0.8019396858,  2.04393673e-05,      12.9130255,     5.364683351,      0.98862762,    0.1938574526]    fk: 14.5233408671       
	k: 200      xk: [   0.6718303991,    0.7842800449, 1.456216701e-05,     13.94829371,     5.359792732,    0.9885242666,    0.1971731751]    fk: 14.4944679246       
	k: 300      xk: [   0.6718254385,    0.7842576156, 1.456392274e-05,     13.95327847,     5.359840279,    0.9885237978,    0.1971505963]    fk: 14.494462682        
	k: 400      xk: [   0.6718253569,    0.7842571232,   1.4563858e-05,     13.95330854,     5.359839462,     0.988523794,    0.1971506996]    fk: 14.494462682        

	Parameter values: [0.67182535685308664, 0.78425712315486928, 1.4563857995133074e-05, 13.95330853571885, 5.3598394621189192, 0.98852379396018075, 0.19715069961285059]
	Function value:   14.494462681985855
	Iterations:       474
	Function calls:   937
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.6718253569,    0.7842571232,   1.4563858e-05,     13.95330854,     5.359839462,     0.988523794,    0.1971506996]    fk: 14.4944644211       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6718253569,    0.7842571232, 1.529205089e-05,     13.95330854,     5.359839462,     0.988523794,    0.1971506996]    fk: 14.4944644033       
	k: 100      xk: [   0.6718253569,    0.7842571232, 1.529205089e-05,     13.95330854,     5.359839462,     0.988523794,    0.1971506996]    fk: 14.4944644033       
	k: 200      xk: [    0.671823812,    0.7842540926, 8.427731009e-05,     13.95345711,     5.359841868,      0.98852378,    0.1971511886]    fk: 14.4944643873       
	k: 300      xk: [   0.6717899899,    0.7842230574,  0.003119739511,     13.95634921,     5.359837324,    0.9885234405,    0.1971472137]    fk: 14.4944643517       
	k: 400      xk: [   0.6700637104,    0.7824946471,    0.1516535613,     14.10506248,     5.359834313,    0.9885061074,    0.1970009237]    fk: 14.4944643128       

	Parameter values: [0.66660105217663168, 0.77903200963839825, 0.44899802492252772, 14.402345495208728, 5.3598380677933033, 0.98847133985239655, 0.19670707168191187]
	Function value:   14.494464301711229
	Iterations:       500
	Function calls:   775
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.6666010522,    0.7790320096,    0.4489980249,      14.4023455,     5.359838068,    0.9884713399,    0.1967070717]    fk: 14.4944644214       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6666010522,    0.7790320096,    0.4489980249,      14.4023455,     5.359838068,    0.9884713399,    0.1967070717]    fk: 14.4944644205       
	k: 100      xk: [   0.6666010522,    0.7790320096,    0.4489980249,      14.4023455,     5.359838068,    0.9884713399,    0.1967070717]    fk: 14.4944644205       
	k: 200      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644199       
	k: 300      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644199       

	Parameter values: [0.66659415109585685, 0.7790255668964563, 0.44956722114859793, 14.402889824012714, 5.3598389966218907, 0.98847127448774319, 0.1967064435299371]
	Function value:   14.49446441993164
	Iterations:       357
	Function calls:   801
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 100      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 200      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 300      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       

	Parameter values: [0.66659415109585685, 0.7790255668964563, 0.44956722114859793, 14.402889824012714, 5.3598389966218907, 0.98847127448774319, 0.1967064435299371]
	Function value:   14.494464421119298
	Iterations:       309
	Function calls:   763
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 100      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 200      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 300      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       

	Parameter values: [0.66659415109585685, 0.7790255668964563, 0.44956722114859793, 14.402889824012714, 5.3598389966218907, 0.98847127448774319, 0.1967064435299371]
	Function value:   14.494464421131175
	Iterations:       309
	Function calls:   763
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 100      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 200      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 300      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       

	Parameter values: [0.66659415109585685, 0.7790255668964563, 0.44956722114859793, 14.402889824012714, 5.3598389966218907, 0.98847127448774319, 0.1967064435299371]
	Function value:   14.494464421131298
	Iterations:       309
	Function calls:   763
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 100      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 200      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       
	k: 300      xk: [   0.6665941511,    0.7790255669,    0.4495672211,     14.40288982,     5.359838997,    0.9884712745,    0.1967064435]    fk: 14.4944644211       

	Parameter values: [0.66659415109585685, 0.7790255668964563, 0.44956722114859793, 14.402889824012714, 5.3598389966218907, 0.98847127448774319, 0.1967064435299371]
	Function value:   14.494464421131298
	Iterations:       309
	Function calls:   763
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.66659415109585685, 0.7790255668964563, 0.44956722114859793, 14.402889824012714, 5.3598389966218907, 0.98847127448774319, 0.1967064435299371]
Function value:   14.494464421131298
Iterations:       3567
Function calls:   7092
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2a (500.000 MHz):           6.665941510958568
r2a (800.000 MHz):           7.790255668964563
r2b (500.000 MHz):           4.495672211485980
r2b (800.000 MHz):         144.028898240127148
dw:                          5.359838996621891
pA:                          0.988471274487743
kex:                      1967.064435299371098


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4981350628, 2.051434888e-06,    0.4981350628, 2.051434888e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.22438532155       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4981350628, 2.154006632e-06,    0.4981350628, 2.051434888e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.39307780124       
	k: 100      xk: [   0.4923848558, 1.658324726e-05,     2.697144805, 5.822946112e-06,     4.739520248,    0.9969835911,    0.1785540755]    fk: 2.35603052669       
	k: 200      xk: [   0.4857192916, 2.899954592e-05,     5.151671101, 5.785107155e-06,     4.726630526,    0.9969076768,    0.1725409351]    fk: 2.34782920852       
	k: 300      xk: [   0.4678845961, 5.638885186e-05,     10.05571205, 6.257298539e-06,     4.583330011,    0.9965581141,    0.1725188139]    fk: 2.3332750686        
	k: 400      xk: [   0.4341462838, 0.0001024529735,     16.03820073, 2.001276143e-05,     4.109216407,    0.9956010088,    0.1853446572]    fk: 2.31484728327       

	Parameter values: [0.43509645881529369, 0.00011315755931863314, 17.033344365781389, 3.9626889977232308e-05, 4.3021368401087692, 0.99587672569959551, 0.17875836359976116]
	Function value:   2.3083055633210918
	Iterations:       500
	Function calls:   765
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4350964588, 0.0001131575593,     17.03334437, 3.962688998e-05,      4.30213684,    0.9958767257,    0.1787583636]    fk: 2.22493219385       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4350964588, 0.0001131575593,     17.03334437, 4.160823448e-05,      4.30213684,    0.9958767257,    0.1787583636]    fk: 2.22588478719       
	k: 100      xk: [   0.4351830182, 0.0001177364865,     17.13852922, 4.098070817e-05,      4.30813752,    0.9958860729,    0.1782779044]    fk: 2.2252757593        
	k: 200      xk: [    0.435049198,  0.000136018874,     17.45257712, 4.713834112e-05,     4.351985339,    0.9959372719,    0.1765278856]    fk: 2.22519892584       
	k: 300      xk: [   0.4286851007, 0.0004078117241,     18.92341149, 0.0005993055823,      4.33976107,    0.9958509317,    0.1754039716]    fk: 2.22491377041       
	k: 400      xk: [   0.4278024846, 0.0004930201832,     19.10594474, 0.0008024904205,     4.335968273,    0.9958361604,    0.1753096463]    fk: 2.22488911224       

	Parameter values: [0.44818943214465623, 0.0019926423640126965, 13.804665745597909, 0.0052651917374270177, 4.2799122279234094, 0.99599456208562809, 0.1822805039495724]
	Function value:   2.224569079167686
	Iterations:       500
	Function calls:   765
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4481894321,  0.001992642364,     13.80466575,  0.005265191737,     4.279912228,    0.9959945621,    0.1822805039]    fk: 2.22455522938       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4481894321,  0.002092274482,     13.80466575,  0.005265191737,     4.279912228,    0.9959945621,    0.1822805039]    fk: 2.22456639092       
	k: 100      xk: [   0.4476481087,  0.002294769888,     14.27484598,  0.005031500151,     4.344966393,    0.9960699922,    0.1799518428]    fk: 2.22438599106       
	k: 200      xk: [   0.4476451115,  0.002345700084,     14.28884645,  0.005112361873,     4.347049901,    0.9960724802,    0.1798286976]    fk: 2.22438528326       
	k: 300      xk: [   0.4492592635,  0.006366924314,     13.89246965,   0.02092389518,     4.349162612,     0.996092879,    0.1801102216]    fk: 2.22438356682       
	k: 400      xk: [   0.4583131957,    0.0294867163,     11.53695143,    0.1076060889,     4.346155399,    0.9961886236,    0.1826017235]    fk: 2.22437960042       

	Parameter values: [0.46513868867606667, 0.049110756508508657, 9.7425639704229106, 0.17032929818445419, 4.3477594955741932, 0.996264802399768, 0.18433419506387094]
	Function value:   2.2243785488892036
	Iterations:       500
	Function calls:   775
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.4651386887,   0.04911075651,      9.74256397,    0.1703292982,     4.347759496,    0.9962648024,    0.1843341951]    fk: 2.22438541938       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4651386887,   0.05156629433,      9.74256397,    0.1703292982,     4.347759496,    0.9962648024,    0.1843341951]    fk: 2.22438527396       
	k: 100      xk: [   0.4651485222,   0.05239643151,     9.738162379,    0.1737256548,     4.347345367,    0.9962644009,     0.184353426]    fk: 2.22438525439       
	k: 200      xk: [   0.4651082355,     2.381357069,     9.747578185,     1.726979713,     4.347066686,    0.9962636023,    0.1843554829]    fk: 2.22438519752       
	k: 300      xk: [   0.4649208849,     11.52839903,     9.798148276,     7.805087313,     4.347171239,    0.9962617208,    0.1842982927]    fk: 2.22438517421       
	k: 400      xk: [   0.4649204682,     11.54353228,     9.798272232,     7.815315645,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.2243851742        

	Parameter values: [0.4649204681667663, 11.543532416213491, 9.7982722328312786, 7.8153157373242852, 4.3471739910759144, 0.99626171959129572, 0.18429807800704123]
	Function value:   2.2243851742024918
	Iterations:       473
	Function calls:   978
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.4649204682,     11.54353242,     9.798272233,     7.815315737,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4649204682,     11.54353242,     9.798272233,     8.206081524,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532007       
	k: 100      xk: [   0.4649204682,     11.54353242,     9.798272233,     8.206081524,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532007       
	k: 200      xk: [   0.4649204682,      11.5435559,     9.798272232,     8.206049724,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532007       

	Parameter values: [0.4649204681700001, 11.543555898903685, 9.798272231974865, 8.2060497258162322, 4.3471739910533218, 0.99626171959131704, 0.18429807800633274]
	Function value:   2.2243853200701262
	Iterations:       253
	Function calls:   754
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.4649204682,      11.5435559,     9.798272232,     8.206049726,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4649204682,      11.5435559,     9.798272232,     8.616352212,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532153       
	k: 100      xk: [   0.4649204682,      11.5435559,     9.798272232,     8.616352212,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532153       
	k: 200      xk: [   0.4649204682,      11.5435559,     9.798272232,     8.616352212,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532153       

	Parameter values: [0.4649204681700001, 11.543555898903685, 9.798272231974865, 8.6163522121070439, 4.3471739910533218, 0.99626171959131704, 0.18429807800633274]
	Function value:   2.2243853215304159
	Iterations:       212
	Function calls:   556
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4649204682,      11.5435559,     9.798272232,     8.616352212,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4649204682,      11.5435559,     9.798272232,     9.047169823,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
	k: 100      xk: [   0.4649204682,      11.5435559,     9.798272232,     9.047169823,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
	k: 200      xk: [   0.4649204682,      11.5435559,     9.798272232,     9.047169823,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       

	Parameter values: [0.4649204681700001, 11.543555898903685, 9.798272231974865, 9.0471698227123962, 4.3471739910533218, 0.99626171959131704, 0.18429807800633274]
	Function value:   2.2243853215450322
	Iterations:       212
	Function calls:   556
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.4649204682,      11.5435559,     9.798272232,     9.047169823,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
	k: 100      xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
	k: 200      xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       

	Parameter values: [0.4649204681700001, 11.543555898903685, 9.798272231974865, 9.4995283138480158, 4.3471739910533218, 0.99626171959131704, 0.18429807800633274]
	Function value:   2.224385321545177
	Iterations:       212
	Function calls:   556
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
	k: 100      xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
	k: 200      xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       

	Parameter values: [0.4649204681700001, 11.543555898903685, 9.798272231974865, 9.4995283138480158, 4.3471739910533218, 0.99626171959131704, 0.18429807800633274]
	Function value:   2.2243853215451797
	Iterations:       212
	Function calls:   556
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
	k: 100      xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       
	k: 200      xk: [   0.4649204682,      11.5435559,     9.798272232,     9.499528314,     4.347173991,    0.9962617196,     0.184298078]    fk: 2.22438532155       

	Parameter values: [0.4649204681700001, 11.543555898903685, 9.798272231974865, 9.4995283138480158, 4.3471739910533218, 0.99626171959131704, 0.18429807800633274]
	Function value:   2.2243853215451797
	Iterations:       212
	Function calls:   556
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.4649204681700001, 11.543555898903685, 9.798272231974865, 9.4995283138480158, 4.3471739910533218, 0.99626171959131704, 0.18429807800633274]
Function value:   2.2243853215451797
Iterations:       3286
Function calls:   6817
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2a (500.000 MHz):           4.649204681700001
r2a (800.000 MHz):         115.435558989036849
r2b (500.000 MHz):          97.982722319748646
r2b (800.000 MHz):          94.995283138480161
dw:                          4.347173991053322
pA:                          0.996261719591317
kex:                      1842.980780063327529

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/dw.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/results.bz2' for writing.



--------------------
- The 'IT99' model -
--------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='IT99', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='IT99')

relax> relax_disp.select_model(model='IT99')
The Ishima and Torchia (1999) CPMG 2-site model for all time scales with pA >> pB.

relax> value.copy(pipe_from='R2eff', pipe_to='IT99', param='r2eff')

relax> grid_search(lower=None, upper=None, inc=11, constraints=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------

Unconstrained grid search size: 161051 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 161051 grid nodes.
k: 0        xk: [            0.1,             0.1,               0,               0,            0.05]    fk: 58690.3836395       
k: 1        xk: [           0.49,             0.1,               0,               0,            0.05]    fk: 54077.5310766       
k: 2        xk: [           0.88,             0.1,               0,               0,            0.05]    fk: 51836.7423585       
k: 11       xk: [            0.1,            0.49,               0,               0,            0.05]    fk: 36765.2033243       
k: 12       xk: [           0.49,            0.49,               0,               0,            0.05]    fk: 32152.3507614       
k: 13       xk: [           0.88,            0.49,               0,               0,            0.05]    fk: 29911.5620433       
k: 22       xk: [            0.1,            0.88,               0,               0,            0.05]    fk: 21336.9870945       
k: 23       xk: [           0.49,            0.88,               0,               0,            0.05]    fk: 16724.1345316       
k: 24       xk: [           0.88,            0.88,               0,               0,            0.05]    fk: 14483.3458134       
k: 33       xk: [            0.1,            1.27,               0,               0,            0.05]    fk: 12405.7349501       
k: 34       xk: [           0.49,            1.27,               0,               0,            0.05]    fk: 7792.8823872        
k: 35       xk: [           0.88,            1.27,               0,               0,            0.05]    fk: 5552.09366906       
k: 45       xk: [           0.49,            1.66,               0,               0,            0.05]    fk: 5358.59432823       
k: 46       xk: [           0.88,            1.66,               0,               0,            0.05]    fk: 3117.80561009       
k: 277      xk: [           0.88,            1.27,               2,               0,            0.05]    fk: 3004.65768407       
k: 398      xk: [           0.88,            1.27,               3,               0,            0.05]    fk: 2861.11289742       
k: 14808    xk: [           0.88,            1.66,               1,               0,         500.045]    fk: 2706.90246965       
k: 14929    xk: [           0.88,            1.66,               2,               0,         500.045]    fk: 2449.1820483        
k: 15050    xk: [           0.88,            1.66,               3,               0,         500.045]    fk: 2344.64434605       
k: 16381    xk: [           0.88,            1.66,               3,               1,         500.045]    fk: 2342.70310071       
k: 17712    xk: [           0.88,            1.66,               3,               2,         500.045]    fk: 2337.53082372       
k: 19043    xk: [           0.88,            1.66,               3,               3,         500.045]    fk: 2330.76350119       
k: 20374    xk: [           0.88,            1.66,               3,               4,         500.045]    fk: 2324.30774722       
k: 20495    xk: [           0.88,            1.66,               4,               4,         500.045]    fk: 2313.20680357       
k: 21826    xk: [           0.88,            1.66,               4,               5,         500.045]    fk: 2285.37346535       
k: 23157    xk: [           0.88,            1.66,               4,               6,         500.045]    fk: 2261.48093094       
k: 24488    xk: [           0.88,            1.66,               4,               7,         500.045]    fk: 2242.85999377       
k: 25819    xk: [           0.88,            1.66,               4,               8,         500.045]    fk: 2229.77680012       
k: 25940    xk: [           0.88,            1.66,               5,               8,         500.045]    fk: 2222.68684227       
k: 27150    xk: [           0.88,            1.66,               4,               9,         500.045]    fk: 2221.85422062       
k: 27271    xk: [           0.88,            1.66,               5,               9,         500.045]    fk: 2192.36028144       
k: 28602    xk: [           0.88,            1.66,               5,              10,         500.045]    fk: 2170.02467449       

Optimised parameter values:
r2 (500.000 MHz):            8.800000000000001
r2 (800.000 MHz):           16.600000000000001
phi_ex:                      5.000000000000000
padw2:                      10.000000000000000
tex:                         0.050004500000000


Fitting to the spin block [':71@N']
-----------------------------------

Unconstrained grid search size: 161051 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 161051 grid nodes.
k: 0        xk: [            0.1,             0.1,               0,               0,            0.05]    fk: 5170.80869563       
k: 1        xk: [           0.49,             0.1,               0,               0,            0.05]    fk: 263.063937419       
k: 122      xk: [           0.49,             0.1,               1,               0,            0.05]    fk: 112.901202836       
k: 243      xk: [           0.49,             0.1,               2,               0,            0.05]    fk: 74.1791330626       

Optimised parameter values:
r2 (500.000 MHz):            4.900000000000000
r2 (800.000 MHz):            1.000000000000000
phi_ex:                      2.000000000000000
padw2:                       0.000000000000000
tex:                         0.000005000000000

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           0.88,            1.66,               5,              10,         500.045]    fk: 2170.02467449       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [          0.924,            1.66,               5,              10,         500.045]    fk: 2093.3874352        
	k: 100      xk: [   0.9082424922,     1.435793648,     6.450714648,     44.33647806,     159.0514033]    fk: 888.306696178       
	k: 200      xk: [   0.8616347574,     1.300167076,    0.3650353373,     83.25832066,     2.101500399]    fk: 339.011008007       
	k: 300      xk: [   0.7558503326,    0.9053582527,      0.62926464,     92.99477675,    0.9760015625]    fk: 105.745532771       
	k: 400      xk: [   0.7547292542,    0.9011974957,    0.6342208254,     93.25622374,    0.9700300572]    fk: 105.707005939       

	Parameter values: [0.78210198833712274, 0.97801135170866782, 0.67706195595052332, 222.68182987784991, 1.449627269980498]
	Function value:   56.992241781221971
	Iterations:       500
	Function calls:   807
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.7821019883,    0.9780113517,     0.677061956,     222.6818299,      1.44962727]    fk: 58.5600444009       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.7821019883,    0.9780113517,     0.677061956,     222.6818299,      1.44962727]    fk: 57.1013446467       
	k: 100      xk: [   0.7428369289,     1.033451419,    0.7613847902,     243.7771492,     2.029983006]    fk: 31.7493931351       
	k: 200      xk: [   0.7249366282,     1.007380792,    0.8241028994,     264.9223549,     2.045507635]    fk: 29.796919168        
	k: 300      xk: [   0.7249134407,     1.007219438,    0.8240758467,     264.9411138,     2.044512579]    fk: 29.7968737781       
	k: 400      xk: [   0.7249133252,     1.007219407,    0.8240761589,     264.9412544,     2.044512882]    fk: 29.7968737779       

	Parameter values: [0.7249133252086406, 1.0072194067149123, 0.82407615890829244, 264.94125443312737, 2.0445128819567753]
	Function value:   29.796873777938359
	Iterations:       440
	Function calls:   836
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [   0.7249133252,     1.007219407,    0.8240761589,     264.9412544,     2.044512882]    fk: 29.7980427317       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.7249133252,     1.007219407,    0.8240761589,     264.9412544,     2.044512882]    fk: 29.7980310422       
	k: 100      xk: [   0.7249133252,     1.007219407,    0.8240761589,     264.9412544,     2.044512882]    fk: 29.7980310422       
	k: 200      xk: [   0.7249133639,     1.007219327,    0.8240756698,     264.9411539,     2.044511065]    fk: 29.7980310421       

	Parameter values: [0.72491336385653793, 1.0072193267129652, 0.82407566984858693, 264.9411538964689, 2.0445110648418048]
	Function value:   29.798031042107088
	Iterations:       260
	Function calls:   544
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.7249133639,     1.007219327,    0.8240756698,     264.9411539,     2.044511065]    fk: 29.7980427316       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.7249133639,     1.007219327,    0.8240756698,     264.9411539,     2.044511065]    fk: 29.7980426147       
	k: 100      xk: [   0.7249133639,     1.007219327,    0.8240756698,     264.9411539,     2.044511065]    fk: 29.7980426147       
	k: 200      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980426147       

	Parameter values: [0.72491336516721183, 1.0072193282673443, 0.82407566951307243, 264.94115348922469, 2.0445110720420265]
	Function value:   29.798042614747793
	Iterations:       291
	Function calls:   588
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427305       
	k: 100      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427305       
	k: 200      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427305       

	Parameter values: [0.72491336516721183, 1.0072193282673443, 0.82407566951307243, 264.94115348922469, 2.0445110720420265]
	Function value:   29.798042730474201
	Iterations:       275
	Function calls:   563
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
	k: 100      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
	k: 200      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       

	Parameter values: [0.72491336516721183, 1.0072193282673443, 0.82407566951307243, 264.94115348922469, 2.0445110720420265]
	Function value:   29.798042731631465
	Iterations:       275
	Function calls:   563
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
	k: 100      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
	k: 200      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       

	Parameter values: [0.72491336516721183, 1.0072193282673443, 0.82407566951307243, 264.94115348922469, 2.0445110720420265]
	Function value:   29.79804273164304
	Iterations:       275
	Function calls:   563
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
	k: 100      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
	k: 200      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       

	Parameter values: [0.72491336516721183, 1.0072193282673443, 0.82407566951307243, 264.94115348922469, 2.0445110720420265]
	Function value:   29.798042731643154
	Iterations:       275
	Function calls:   563
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
	k: 100      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       
	k: 200      xk: [   0.7249133652,     1.007219328,    0.8240756695,     264.9411535,     2.044511072]    fk: 29.7980427316       

	Parameter values: [0.72491336516721183, 1.0072193282673443, 0.82407566951307243, 264.94115348922469, 2.0445110720420265]
	Function value:   29.798042731643154
	Iterations:       275
	Function calls:   563
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.72491336516721183, 1.0072193282673443, 0.82407566951307243, 264.94115348922469, 2.0445110720420265]
Function value:   29.798042731643154
Iterations:       2866
Function calls:   5590
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            7.249133651672119
r2 (800.000 MHz):           10.072193282673442
phi_ex:                      0.824075669513072
padw2:                     264.941153489224689
tex:                         0.000204451107204


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           0.49,             0.1,               2,               0,            0.05]    fk: 74.1791330626       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           0.49,             0.1,               2,         0.00025,            0.05]    fk: 74.2556422908       
	k: 100      xk: [   0.4673805766,    0.1364000555,     1.885166942, 1.063302526e-05,   0.06008458319]    fk: 72.4772305854       
	k: 200      xk: [  0.05429794994,   0.01386701316,     2.287293727, 0.0002737541588,    0.2582962248]    fk: 20.8949957345       
	k: 300      xk: [  0.03784056474,  0.001718391636,     2.197261287, 0.0002909014206,    0.2743594869]    fk: 17.158416621        
	k: 400      xk: [  0.09627169166,   0.02383813272,     1.848761693, 7.003860341e-06,     0.295186538]    fk: 16.6211427532       

	Parameter values: [0.11383106347805977, 0.0012507846583262698, 1.7550853714138919, 3.6591184746808312e-06, 0.30177353789205469]
	Function value:   16.448514462246784
	Iterations:       500
	Function calls:   815
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.1138310635,  0.001250784658,     1.755085371, 3.659118475e-06,    0.3017735379]    fk: 16.2877247318       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.1138310635,  0.001250784658,     1.755085371, 3.842074398e-06,    0.3017735379]    fk: 16.2898603107       
	k: 100      xk: [   0.2379176133, 0.0003293519595,     1.095022277, 2.404414443e-08,    0.3769466637]    fk: 14.3165289478       
	k: 200      xk: [   0.4358791953,  0.006887336556,    0.3384965509, 5.644764101e-06,    0.6849327378]    fk: 6.8406949736        
	k: 300      xk: [    0.496743605,   0.02624049849,    0.1649438101, 3.709206744e-05,     1.252065901]    fk: 2.33786051543       
	k: 400      xk: [   0.4967659266,   0.02624736559,    0.1648742629,  3.71035116e-05,     1.252270208]    fk: 2.33785282077       

	Parameter values: [0.49676563553030073, 0.026193853220210117, 0.16487133996743897, 3.7246874509819298e-05, 1.252294622236592]
	Function value:   2.3378527025765634
	Iterations:       500
	Function calls:   815
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4967656355,   0.02619385322,      0.16487134, 3.724687451e-05,     1.252294622]    fk: 2.33683744225       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4967656355,   0.02619385322,      0.16487134, 3.910921824e-05,     1.252294622]    fk: 2.33684756419       
	k: 100      xk: [   0.4967708046,    0.1235235657,    0.1648609595, 0.0003646535251,     1.252427509]    fk: 2.33684419802       
	k: 200      xk: [   0.4967649061,     12.72337531,    0.1648765854,   0.04116303546,     1.252252881]    fk: 2.33683548806       
	k: 300      xk: [   0.4967647344,     12.76688279,    0.1648770049,    0.0413351957,     1.252248802]    fk: 2.33683548779       
	k: 400      xk: [   0.4967630286,     8.401291789,    0.1648818671,   0.05481105077,     1.252205117]    fk: 2.33683527529       

	Parameter values: [0.49676501208953083, 9.998933621121127, 0.16487641481384635, 0.082342157708018948, 1.2522540486478673]
	Function value:   2.3368350927112327
	Iterations:       500
	Function calls:   811
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.4967650121,     9.998933621,    0.1648764148,   0.08234215771,     1.252254049]    fk: 2.3368378944        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4967650121,     9.998933621,    0.1648764148,   0.08234215771,     1.252254049]    fk: 2.33683786632       
	k: 100      xk: [   0.4967649827,      15.4342441,     0.164876424,  0.008381743279,     1.252254757]    fk: 2.33683739786       
	k: 200      xk: [   0.4967650079,      9.99499173,    0.1648764203,  0.008232624069,      1.25225383]    fk: 2.3368373943        
	k: 300      xk: [   0.4967650078,     9.994707209,    0.1648764204,  0.008232504149,     1.252253829]    fk: 2.3368373943        

	Parameter values: [0.4967650078351491, 9.9947072085643054, 0.16487642038810896, 0.0082325041490998035, 1.2522538288174372]
	Function value:   2.3368373942955509
	Iterations:       302
	Function calls:   703
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.4967650078,     9.994707209,    0.1648764204,  0.008232504149,     1.252253829]    fk: 2.33683739928       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4967650078,     9.994707209,    0.1648764204,  0.008232504149,     1.252253829]    fk: 2.33683739923       
	k: 100      xk: [   0.4967649873,     15.11941762,    0.1648764612, 0.0009382814812,     1.252253655]    fk: 2.33683739455       
	k: 200      xk: [   0.4967650133,     10.16196365,    0.1648764058, 0.0008160717404,     1.252253937]    fk: 2.33683739452       

	Parameter values: [0.49676500882809815, 10.012641275569351, 0.16487641902491112, 0.00082329252362899844, 1.2522538344271958]
	Function value:   2.3368373945157868
	Iterations:       300
	Function calls:   619
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [   0.4967650088,     10.01264128,     0.164876419, 0.0008232925236,     1.252253834]    fk: 2.33683739434       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4967650088,     10.01264128,     0.164876419, 0.0008232925236,     1.252253834]    fk: 2.33683739434       
	k: 100      xk: [   0.4967650064,     15.06395302,     0.164876424, 7.417980181e-05,     1.252253799]    fk: 2.33683739429       
	k: 200      xk: [   0.4967650078,      14.9747925,    0.1648764206, 8.308305938e-05,     1.252253832]    fk: 2.33683739429       

	Parameter values: [0.49676500784129363, 14.974792495403062, 0.16487642061132213, 8.3083059381489015e-05, 1.2522538317741509]
	Function value:   2.3368373942903129
	Iterations:       213
	Function calls:   479
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [   0.4967650078,      14.9747925,    0.1648764206, 8.308305938e-05,     1.252253832]    fk: 2.33683739429       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4967650078,      14.9747925,    0.1648764206, 8.308305938e-05,     1.252253832]    fk: 2.33683739429       
	k: 100      xk: [   0.4967650082,     19.33532439,    0.1648764198, 1.295520388e-05,     1.252253848]    fk: 2.33683739429       
	k: 200      xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       

	Parameter values: [0.49676500829014869, 19.150805383813967, 0.16487641935106073, 7.7624295452309083e-06, 1.2522538372352652]
	Function value:   2.3368373942855105
	Iterations:       201
	Function calls:   461
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       
	k: 100      xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       

	Parameter values: [0.49676500829014869, 19.150805383813967, 0.16487641935106073, 7.7624295452309083e-06, 1.2522538372352652]
	Function value:   2.3368373942854275
	Iterations:       164
	Function calls:   406
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       
	k: 100      xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       

	Parameter values: [0.49676500829014869, 19.150805383813967, 0.16487641935106073, 7.7624295452309083e-06, 1.2522538372352652]
	Function value:   2.336837394285427
	Iterations:       164
	Function calls:   406
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 9        xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       
	k: 100      xk: [   0.4967650083,     19.15080538,    0.1648764194, 7.762429545e-06,     1.252253837]    fk: 2.33683739429       

	Parameter values: [0.49676500829014869, 19.150805383813967, 0.16487641935106073, 7.7624295452309083e-06, 1.2522538372352652]
	Function value:   2.336837394285427
	Iterations:       164
	Function calls:   406
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.49676500829014869, 19.150805383813967, 0.16487641935106073, 7.7624295452309083e-06, 1.2522538372352652]
Function value:   2.336837394285427
Iterations:       3008
Function calls:   5921
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.967650082901487
r2 (800.000 MHz):          191.508053838139688
phi_ex:                      0.164876419351061
padw2:                       0.000007762429545
tex:                         0.000125225383724

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/grace2images.py' for writing.

relax> value.write(param='phi_ex', file='phi_ex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/phi_ex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex', spin_id=None, plot_data='value', file='phi_ex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/phi_ex.agr' for writing.

relax> value.write(param='padw2', file='padw2.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/padw2.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='padw2', spin_id=None, plot_data='value', file='padw2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/padw2.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/k_AB.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/results.bz2' for writing.



---------------------------------
- The 'NS CPMG 2-site 3D' model -
---------------------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='NS CPMG 2-site 3D', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='NS CPMG 2-site 3D')

relax> relax_disp.select_model(model='NS CPMG 2-site 3D')
The reduced numerical solution for the 2-site Bloch-McConnell equations for CPMG data using 3D magnetisation vectors, whereby the simplification R20A = R20B is assumed.

relax> value.copy(pipe_from='R2eff', pipe_to='NS CPMG 2-site 3D', param='r2eff')
Model equivalence detected, copying the optimised parameters from the analytic 'CR72' model rather than performing a grid search.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 20.441969072        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1798755015]    fk: 18.9852838486       
	k: 100      xk: [   0.6962389159,    0.9435095949,      5.67312795,    0.9896367144,    0.1676043378]    fk: 16.8855648297       
	k: 200      xk: [   0.6960975689,     0.943538868,     5.677668314,    0.9896403646,    0.1675766392]    fk: 16.8815675834       
	k: 300      xk: [   0.6960976415,    0.9435389943,     5.677667677,    0.9896403647,    0.1675766364]    fk: 16.8815675833       

	Parameter values: [0.69609764153062748, 0.94353899430849753, 5.6776676765544645, 0.98964036474262818, 0.16757663636524966]
	Function value:   16.881567583349096
	Iterations:       332
	Function calls:   669
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 1        xk: [   0.6960976415,    0.9435389943,     5.677667677,    0.9896403647,    0.1675766364]    fk: 16.9360787169       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960976415,    0.9435389943,     5.677667677,    0.9896403647,    0.1675766364]    fk: 16.9355336055       
	k: 100      xk: [   0.6960976415,    0.9435389943,     5.677667677,    0.9896403647,    0.1675766364]    fk: 16.9355336055       
	k: 200      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.935533534        

	Parameter values: [0.69609719319074292, 0.94354358719097542, 5.677679248923492, 0.98964031718392087, 0.1675724455456381]
	Function value:   16.93553353395755
	Iterations:       271
	Function calls:   540
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786439       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360731927       
	k: 100      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360731927       
	k: 200      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360731927       

	Parameter values: [0.69609719319074292, 0.94354358719097542, 5.677679248923492, 0.98964031718392087, 0.1675724455456381]
	Function value:   16.936073192748861
	Iterations:       260
	Function calls:   544
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786439       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360785893       
	k: 100      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360785893       
	k: 200      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360785893       

	Parameter values: [0.69609719319074292, 0.94354358719097542, 5.677679248923492, 0.98964031718392087, 0.1675724455456381]
	Function value:   16.93607858933677
	Iterations:       260
	Function calls:   544
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786439       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786433       
	k: 100      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786433       
	k: 200      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786433       

	Parameter values: [0.69609719319074292, 0.94354358719097542, 5.677679248923492, 0.98964031718392087, 0.1675724455456381]
	Function value:   16.93607864330265
	Iterations:       260
	Function calls:   544
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786439       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       
	k: 100      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       
	k: 200      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       

	Parameter values: [0.69609719319074292, 0.94354358719097542, 5.677679248923492, 0.98964031718392087, 0.1675724455456381]
	Function value:   16.936078643842304
	Iterations:       260
	Function calls:   544
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786439       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       
	k: 100      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       
	k: 200      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       

	Parameter values: [0.69609719319074292, 0.94354358719097542, 5.677679248923492, 0.98964031718392087, 0.1675724455456381]
	Function value:   16.936078643847704
	Iterations:       260
	Function calls:   544
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786439       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       
	k: 100      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       
	k: 200      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       

	Parameter values: [0.69609719319074292, 0.94354358719097542, 5.677679248923492, 0.98964031718392087, 0.1675724455456381]
	Function value:   16.936078643847758
	Iterations:       260
	Function calls:   544
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786439       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       
	k: 100      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       
	k: 200      xk: [   0.6960971932,    0.9435435872,     5.677679249,    0.9896403172,    0.1675724455]    fk: 16.9360786438       

	Parameter values: [0.69609719319074292, 0.94354358719097542, 5.677679248923492, 0.98964031718392087, 0.1675724455456381]
	Function value:   16.936078643847758
	Iterations:       260
	Function calls:   544
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.69609719319074292, 0.94354358719097542, 5.677679248923492, 0.98964031718392087, 0.1675724455456381]
Function value:   16.936078643847758
Iterations:       2423
Function calls:   5017
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.960971931907429
r2 (800.000 MHz):            9.435435871909753
dw:                          5.677679248923492
pA:                          0.989640317183921
kex:                      1675.724455456381065


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4981350628, 2.051434888e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.3668511222        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4981350628, 2.154006632e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.45726747366       
	k: 100      xk: [   0.4981404751, 2.231587984e-06,     4.509089794,    0.9967233822,    0.1868604052]    fk: 2.30108636732       
	k: 200      xk: [    0.498172469, 6.661471188e-06,     4.756423686,     0.996979019,    0.1790971548]    fk: 2.29464543254       
	k: 300      xk: [   0.4974106616, 0.0008495227648,      4.07735329,    0.9961084331,    0.1997459947]    fk: 2.24747769377       
	k: 400      xk: [   0.4966615962,  0.002361675925,     3.803378433,       0.9955697,    0.2080170092]    fk: 2.24515386057       

	Parameter values: [0.49735394053952175, 0.013600170863420698, 4.2853941156814024, 0.99641170264468704, 0.19649758871654832]
	Function value:   2.2174761686397466
	Iterations:       500
	Function calls:   786
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4973539405,   0.01360017086,     4.285394116,    0.9964117026,    0.1964975887]    fk: 2.2151210746        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4973539405,   0.01428017941,     4.285394116,    0.9964117026,    0.1964975887]    fk: 2.21513974993       
	k: 100      xk: [   0.4982118088,   0.01525828508,     4.457362659,    0.9966650309,     0.188310285]    fk: 2.21093767924       
	k: 200      xk: [   0.4983590545,   0.02347757711,     4.524591057,    0.9967462102,    0.1859557896]    fk: 2.21064247209       
	k: 300      xk: [   0.4983178438,     6.606371097,     4.521945593,    0.9967421985,    0.1859807778]    fk: 2.21011594856       
	k: 400      xk: [   0.4982878748,     9.997083025,     4.525541552,    0.9967451363,    0.1860760419]    fk: 2.21009281596       

	Parameter values: [0.49828789143619157, 9.9995172340402192, 4.5255296193101806, 0.99674512332790344, 0.18607639226184408]
	Function value:   2.2100928159285926
	Iterations:       500
	Function calls:   899
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4982878914,     9.999517234,     4.525529619,    0.9967451233,    0.1860763923]    fk: 2.21065054987       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982878914,     9.999517234,     4.525529619,    0.9967451233,    0.1860763923]    fk: 2.21064497251       
	k: 100      xk: [   0.4982890259,     10.04029562,     4.525853103,    0.9967455201,    0.1860639276]    fk: 2.21064496686       
	k: 200      xk: [   0.4982890858,     10.00249728,      4.52585218,    0.9967455192,    0.1860638648]    fk: 2.21064496678       

	Parameter values: [0.4982890858225798, 10.002497282263118, 4.5258521796490978, 0.9967455191751633, 0.18606386475717845]
	Function value:   2.2106449667794834
	Iterations:       263
	Function calls:   579
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [   0.4982890858,     10.00249728,      4.52585218,    0.9967455192,    0.1860638648]    fk: 2.21065054402       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982890858,     10.00249728,      4.52585218,    0.9967455192,    0.1860638648]    fk: 2.21065048823       
	k: 100      xk: [   0.4982890858,     10.00249728,      4.52585218,    0.9967455192,    0.1860638648]    fk: 2.21065048823       
	k: 200      xk: [   0.4982891114,     9.972010296,     4.525857135,    0.9967455255,    0.1860636554]    fk: 2.21065048823       

	Parameter values: [0.49828911140999804, 9.9720102955909766, 4.5258571351997325, 0.99674552552991547, 0.18606365540534875]
	Function value:   2.2106504882287736
	Iterations:       239
	Function calls:   611
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.4982891114,     9.972010296,     4.525857135,    0.9967455255,    0.1860636554]    fk: 2.21065054401       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982891114,     9.972010296,     4.525857135,    0.9967455255,    0.1860636554]    fk: 2.21065054344       
	k: 100      xk: [   0.4982891114,     9.972010296,     4.525857135,    0.9967455255,    0.1860636554]    fk: 2.21065054344       
	k: 200      xk: [   0.4982891114,     10.00314235,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054344       

	Parameter values: [0.498289111411373, 10.003142354012869, 4.5258571355838821, 0.9967455255303832, 0.18606365539245934]
	Function value:   2.2106505434423278
	Iterations:       211
	Function calls:   501
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [   0.4982891114,     10.00314235,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.210650544         
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982891114,     10.00314235,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       
	k: 100      xk: [   0.4982891114,     10.00314235,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       
	k: 200      xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       

	Parameter values: [0.49828911141141746, 10.003149985812749, 4.5258571355862713, 0.99674552553038642, 0.18606365539204917]
	Function value:   2.2106505439880704
	Iterations:       218
	Function calls:   589
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054401       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       
	k: 100      xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       

	Parameter values: [0.49828911141141746, 10.003149985812749, 4.5258571355862713, 0.99674552553038642, 0.18606365539204917]
	Function value:   2.2106505439935917
	Iterations:       188
	Function calls:   447
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.210650544         
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       
	k: 100      xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       

	Parameter values: [0.49828911141141746, 10.003149985812749, 4.5258571355862713, 0.99674552553038642, 0.18606365539204917]
	Function value:   2.2106505439936459
	Iterations:       188
	Function calls:   447
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.210650544         
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       
	k: 100      xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       

	Parameter values: [0.49828911141141746, 10.003149985812749, 4.5258571355862713, 0.99674552553038642, 0.18606365539204917]
	Function value:   2.2106505439936472
	Iterations:       188
	Function calls:   447
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.210650544         
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       
	k: 100      xk: [   0.4982891114,     10.00314999,     4.525857136,    0.9967455255,    0.1860636554]    fk: 2.21065054399       

	Parameter values: [0.49828911141141746, 10.003149985812749, 4.5258571355862713, 0.99674552553038642, 0.18606365539204917]
	Function value:   2.2106505439936472
	Iterations:       188
	Function calls:   447
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.49828911141141746, 10.003149985812749, 4.5258571355862713, 0.99674552553038642, 0.18606365539204917]
Function value:   2.2106505439936472
Iterations:       2683
Function calls:   5753
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.982891114114175
r2 (800.000 MHz):          100.031499858127489
dw:                          4.525857135586271
pA:                          0.996745525530386
kex:                      1860.636553920491679

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/dw.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site 3D/results.bz2' for writing.



---------------------------------------
- The 'NS CPMG 2-site expanded' model -
---------------------------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='NS CPMG 2-site expanded', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='NS CPMG 2-site expanded')

relax> relax_disp.select_model(model='NS CPMG 2-site expanded')
The numerical solution for the 2-site Bloch-McConnell equations for CPMG data expanded using Maple by Nikolai Skrynnikov.

relax> value.copy(pipe_from='R2eff', pipe_to='NS CPMG 2-site expanded', param='r2eff')
Model equivalence detected, copying the optimised parameters from the analytic 'CR72' model rather than performing a grid search.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 20.442151184        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1798755015]    fk: 18.9853578478       
	k: 100      xk: [   0.6962389159,    0.9435095949,      5.67312795,    0.9896367144,    0.1676043378]    fk: 16.8856662934       
	k: 200      xk: [   0.6960976855,    0.9435386537,     5.677667138,    0.9896403608,    0.1675767557]    fk: 16.881667575        
	k: 300      xk: [   0.6960977113,    0.9435389469,      5.67766588,     0.989640361,    0.1675767151]    fk: 16.8816675747       

	Parameter values: [0.69609771130239917, 0.94353894686957718, 5.6776658797338699, 0.98964036100774622, 0.16757671506311389]
	Function value:   16.881667574720456
	Iterations:       329
	Function calls:   658
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 1        xk: [   0.6960977113,    0.9435389469,      5.67766588,     0.989640361,    0.1675767151]    fk: 16.9361787138       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960977113,    0.9435389469,      5.67766588,     0.989640361,    0.1675767151]    fk: 16.9356336024       
	k: 100      xk: [   0.6960977113,    0.9435389469,      5.67766588,     0.989640361,    0.1675767151]    fk: 16.9356336024       
	k: 200      xk: [   0.6960972635,    0.9435435368,     5.677677668,    0.9896403127,    0.1675724887]    fk: 16.9356335299       

	Parameter values: [0.69609726353451762, 0.94354353681572867, 5.6776776678067673, 0.98964031271912623, 0.16757248870571045]
	Function value:   16.93563352993743
	Iterations:       240
	Function calls:   516
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [   0.6960972635,    0.9435435368,     5.677677668,    0.9896403127,    0.1675724887]    fk: 16.9361786399       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960972635,    0.9435435368,     5.677677668,    0.9896403127,    0.1675724887]    fk: 16.9361731888       
	k: 100      xk: [   0.6960972635,    0.9435435368,     5.677677668,    0.9896403127,    0.1675724887]    fk: 16.9361731888       
	k: 200      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361731888       

	Parameter values: [0.69609725663486166, 0.9435435713895779, 5.6776777792904962, 0.98964031263324714, 0.16757246507053142]
	Function value:   16.93617318876468
	Iterations:       260
	Function calls:   554
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361785854       
	k: 100      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361785854       
	k: 200      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361785854       

	Parameter values: [0.69609725663486166, 0.9435435713895779, 5.6776777792904962, 0.98964031263324714, 0.16757246507053142]
	Function value:   16.936178585352955
	Iterations:       274
	Function calls:   554
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786393       
	k: 100      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786393       
	k: 200      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786393       

	Parameter values: [0.69609725663486166, 0.9435435713895779, 5.6776777792904962, 0.98964031263324714, 0.16757246507053142]
	Function value:   16.93617863931884
	Iterations:       274
	Function calls:   554
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
	k: 100      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
	k: 200      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       

	Parameter values: [0.69609725663486166, 0.9435435713895779, 5.6776777792904962, 0.98964031263324714, 0.16757246507053142]
	Function value:   16.936178639858493
	Iterations:       274
	Function calls:   554
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
	k: 100      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
	k: 200      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       

	Parameter values: [0.69609725663486166, 0.9435435713895779, 5.6776777792904962, 0.98964031263324714, 0.16757246507053142]
	Function value:   16.936178639863893
	Iterations:       274
	Function calls:   554
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
	k: 100      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
	k: 200      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       

	Parameter values: [0.69609725663486166, 0.9435435713895779, 5.6776777792904962, 0.98964031263324714, 0.16757246507053142]
	Function value:   16.936178639863947
	Iterations:       274
	Function calls:   554
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
	k: 100      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       
	k: 200      xk: [   0.6960972566,    0.9435435714,     5.677677779,    0.9896403126,    0.1675724651]    fk: 16.9361786399       

	Parameter values: [0.69609725663486166, 0.9435435713895779, 5.6776777792904962, 0.98964031263324714, 0.16757246507053142]
	Function value:   16.936178639863947
	Iterations:       274
	Function calls:   554
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.69609725663486166, 0.9435435713895779, 5.6776777792904962, 0.98964031263324714, 0.16757246507053142]
Function value:   16.936178639863947
Iterations:       2473
Function calls:   5052
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.960972566348617
r2 (800.000 MHz):            9.435435713895778
dw:                          5.677677779290496
pA:                          0.989640312633247
kex:                      1675.724650705314161


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4981350628, 2.051434888e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.36686800636       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4981350628, 2.154006632e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.45728435782       
	k: 100      xk: [   0.4980177333, 2.127400154e-06,     4.406691902,    0.9965968767,    0.1898453797]    fk: 2.30182624325       
	k: 200      xk: [   0.4986518089, 2.988317617e-06,     4.661410994,    0.9968980377,    0.1814224883]    fk: 2.29958430763       
	k: 300      xk: [   0.4975452646, 2.299432193e-05,     4.600514443,    0.9968053515,    0.1862223742]    fk: 2.27961095231       
	k: 400      xk: [   0.4986681696,  0.008885842137,     4.389869765,     0.996594144,     0.189240162]    fk: 2.21970226195       

	Parameter values: [0.49707346291485965, 0.15127743310819514, 3.9178146473765922, 0.99581175649128184, 0.20473384687183838]
	Function value:   2.200193774384064
	Iterations:       500
	Function calls:   794
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4970734629,    0.1512774331,     3.917814647,    0.9958117565,    0.2047338469]    fk: 2.2229017429        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4970734629,    0.1588413048,     3.917814647,    0.9958117565,    0.2047338469]    fk: 2.22266982231       
	k: 100      xk: [   0.4972288291,    0.1028357373,      4.23714469,    0.9963455046,    0.1957717122]    fk: 2.21441873837       
	k: 200      xk: [   0.4978024182,  0.009849545169,     4.389970253,    0.9965710086,    0.1908990498]    fk: 2.21163897392       
	k: 300      xk: [   0.4981981108,    0.5185173503,     4.508077726,    0.9967225042,     0.186730813]    fk: 2.21035328887       
	k: 400      xk: [    0.498288664,     10.03341805,     4.525472569,    0.9967450781,     0.186076278]    fk: 2.21009821941       

	Parameter values: [0.49828782915642111, 9.9999442955996951, 4.525484500559152, 0.99674506748106639, 0.18607747778123626]
	Function value:   2.2100982164125376
	Iterations:       500
	Function calls:   876
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4982878292,     9.999944296,     4.525484501,    0.9967450675,    0.1860774778]    fk: 2.21065595162       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982878292,     9.999944296,     4.525484501,    0.9967450675,    0.1860774778]    fk: 2.21065037426       
	k: 100      xk: [   0.4982890688,     10.00602181,     4.525821335,    0.9967454811,    0.1860644537]    fk: 2.21065036851       
	k: 200      xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.2106503685        

	Parameter values: [0.49828906954922558, 10.006112521980818, 4.5258135167033675, 0.99674547182875317, 0.18606465800040506]
	Function value:   2.2106503684980949
	Iterations:       234
	Function calls:   538
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065588996       
	k: 100      xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065588996       
	k: 200      xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065588996       

	Parameter values: [0.49828906954922558, 10.006112521980818, 4.5258135167033675, 0.99674547182875317, 0.18606465800040506]
	Function value:   2.2106558899602837
	Iterations:       217
	Function calls:   511
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594517       
	k: 100      xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594517       

	Parameter values: [0.49828906954922558, 10.006112521980818, 4.5258135167033675, 0.99674547182875317, 0.18606465800040506]
	Function value:   2.2106559451749055
	Iterations:       187
	Function calls:   482
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
	k: 100      xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       

	Parameter values: [0.49828906954922558, 10.006112521980818, 4.5258135167033675, 0.99674547182875317, 0.18606465800040506]
	Function value:   2.2106559457270523
	Iterations:       187
	Function calls:   482
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
	k: 100      xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       

	Parameter values: [0.49828906954922558, 10.006112521980818, 4.5258135167033675, 0.99674547182875317, 0.18606465800040506]
	Function value:   2.2106559457325736
	Iterations:       187
	Function calls:   482
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
	k: 100      xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       

	Parameter values: [0.49828906954922558, 10.006112521980818, 4.5258135167033675, 0.99674547182875317, 0.18606465800040506]
	Function value:   2.2106559457326278
	Iterations:       187
	Function calls:   482
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
	k: 100      xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       

	Parameter values: [0.49828906954922558, 10.006112521980818, 4.5258135167033675, 0.99674547182875317, 0.18606465800040506]
	Function value:   2.2106559457326291
	Iterations:       187
	Function calls:   482
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 9        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       
	k: 100      xk: [   0.4982890695,     10.00611252,     4.525813517,    0.9967454718,     0.186064658]    fk: 2.21065594573       

	Parameter values: [0.49828906954922558, 10.006112521980818, 4.5258135167033675, 0.99674547182875317, 0.18606465800040506]
	Function value:   2.2106559457326291
	Iterations:       187
	Function calls:   482
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.49828906954922558, 10.006112521980818, 4.5258135167033675, 0.99674547182875317, 0.18606465800040506]
Function value:   2.2106559457326291
Iterations:       2573
Function calls:   5611
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.982890695492256
r2 (800.000 MHz):          100.061125219808176
dw:                          4.525813516703368
pA:                          0.996745471828753
kex:                      1860.646580004050520

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/dw.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site expanded/results.bz2' for writing.



-----------------------------------
- The 'NS CPMG 2-site star' model -
-----------------------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='NS CPMG 2-site star', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='NS CPMG 2-site star')

relax> relax_disp.select_model(model='NS CPMG 2-site star')
The numerical reduced solution for the 2-site Bloch-McConnell equations for CPMG data using complex conjugate matrices, whereby the simplification R20A = R20B is assumed.

relax> value.copy(pipe_from='R2eff', pipe_to='NS CPMG 2-site star', param='r2eff')
Model equivalence detected, copying the optimised parameters from the analytic 'CR72' model rather than performing a grid search.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1713100014]    fk: 20.44435377         
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6974996209,      0.94499459,     5.613494396,    0.9898002958,    0.1798755015]    fk: 18.9840121794       
	k: 100      xk: [   0.6960479832,    0.9432043227,     5.674648365,    0.9896372498,    0.1677789035]    fk: 16.881316507        
	k: 200      xk: [    0.696049443,    0.9432028292,     5.674667637,    0.9896373199,    0.1677794086]    fk: 16.8806533493       
	k: 300      xk: [   0.6960494186,    0.9432028269,     5.674667628,    0.9896373201,    0.1677794089]    fk: 16.8806533424       
	k: 400      xk: [   0.6960493984,    0.9432028226,     5.674667616,    0.9896373201,    0.1677794097]    fk: 16.8806533407       

	Parameter values: [0.69604939798003929, 0.94320282251194998, 5.6746676157897147, 0.98963732011588057, 0.16777940969466215]
	Function value:   16.880653340640201
	Iterations:       477
	Function calls:   914
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    0.696049398,    0.9432028225,     5.674667616,    0.9896373201,    0.1677794097]    fk: 16.9351700928       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.696049398,    0.9432028225,     5.674667616,    0.9896373201,    0.1677794097]    fk: 16.9346249253       
	k: 100      xk: [   0.6960332607,    0.9432318645,     5.674876074,    0.9896378839,    0.1677770082]    fk: 16.9328826712       
	k: 200      xk: [   0.6960331847,    0.9432319914,     5.674876026,     0.989637886,    0.1677770317]    fk: 16.9328212862       
	k: 300      xk: [    0.696033183,    0.9432319919,     5.674876026,     0.989637886,    0.1677770318]    fk: 16.9328212858       

	Parameter values: [0.69603318296072447, 0.94323199191822327, 5.674876025800728, 0.98963788604214808, 0.16777703180308298]
	Function value:   16.932821285826037
	Iterations:       336
	Function calls:   728
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [    0.696033183,    0.9432319919,     5.674876026,     0.989637886,    0.1677770318]    fk: 16.933366451        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.696033183,    0.9432319919,     5.674876026,     0.989637886,    0.1677770318]    fk: 16.9333609993       
	k: 100      xk: [   0.6960334381,     0.943232001,     5.674875526,    0.9896378882,    0.1677771262]    fk: 16.9333571602       
	k: 200      xk: [    0.696033526,     0.943232054,     5.674875432,    0.9896378887,      0.16777713]    fk: 16.9333571438       

	Parameter values: [0.69603352601713331, 0.94323205400730181, 5.6748754323700847, 0.98963788869835256, 0.16777713003157232]
	Function value:   16.933357143840958
	Iterations:       255
	Function calls:   544
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    0.696033526,     0.943232054,     5.674875432,    0.9896378887,      0.16777713]    fk: 16.9333625955       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.696033526,     0.943232054,     5.674875432,    0.9896378887,      0.16777713]    fk: 16.933362541        
	k: 100      xk: [   0.6960334629,    0.9432319347,     5.674876187,    0.9896378907,    0.1677772008]    fk: 16.9333548416       
	k: 200      xk: [   0.6960335017,    0.9432320024,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527254       

	Parameter values: [0.69603350178637269, 0.94323200246157135, 5.6748758389521843, 0.9896378898350553, 0.16777716684334024]
	Function value:   16.933352725352854
	Iterations:       250
	Function calls:   541
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527793       
	k: 100      xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527793       

	Parameter values: [0.69603350178637413, 0.94323200246174088, 5.6748758389528327, 0.98963788983505718, 0.16777716684332339]
	Function value:   16.933352779324174
	Iterations:       136
	Function calls:   445
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       
	k: 100      xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       

	Parameter values: [0.69603350178637413, 0.94323200246174088, 5.6748758389528327, 0.98963788983505718, 0.16777716684332339]
	Function value:   16.933352779863881
	Iterations:       150
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       
	k: 100      xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       

	Parameter values: [0.69603350178637413, 0.94323200246174088, 5.6748758389528327, 0.98963788983505718, 0.16777716684332339]
	Function value:   16.933352779869285
	Iterations:       150
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       
	k: 100      xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       

	Parameter values: [0.69603350178637413, 0.94323200246174088, 5.6748758389528327, 0.98963788983505718, 0.16777716684332339]
	Function value:   16.933352779869338
	Iterations:       150
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       
	k: 100      xk: [   0.6960335018,    0.9432320025,     5.674875839,    0.9896378898,    0.1677771668]    fk: 16.9333527799       

	Parameter values: [0.69603350178637413, 0.94323200246174088, 5.6748758389528327, 0.98963788983505718, 0.16777716684332339]
	Function value:   16.933352779869338
	Iterations:       150
	Function calls:   452
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.69603350178637413, 0.94323200246174088, 5.6748758389528327, 0.98963788983505718, 0.16777716684332339]
Function value:   16.933352779869338
Iterations:       2054
Function calls:   4980
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.960335017863741
r2 (800.000 MHz):            9.432320024617409
dw:                          5.674875838952833
pA:                          0.989637889835057
kex:                      1677.771668433233799


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4981350628, 2.051434888e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.36589428558       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4981350628, 2.154006632e-06,     4.347176259,    0.9966122866,    0.1935649253]    fk: 2.45631063704       
	k: 100      xk: [   0.4971137292, 2.094870824e-06,     4.396163911,    0.9965566088,     0.192841897]    fk: 2.30175759381       
	k: 200      xk: [   0.4971137345, 2.094870473e-06,      4.39616398,    0.9965566091,    0.1928419046]    fk: 2.30175759216       
	k: 300      xk: [   0.4971137347,  2.09487046e-06,      4.39616398,    0.9965566091,    0.1928419048]    fk: 2.30175759212       

	Parameter values: [0.49711373470533016, 2.0948704604871389e-06, 4.3961639795645757, 0.99655660914622757, 0.1928419048066331]
	Function value:   2.3017575921211906
	Iterations:       306
	Function calls:   680
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 1        xk: [   0.4971137347,  2.09487046e-06,      4.39616398,    0.9965566091,    0.1928419048]    fk: 2.21127942666       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4971137347, 2.199613984e-06,      4.39616398,    0.9965566091,    0.1928419048]    fk: 2.2121793293        
	k: 100      xk: [   0.4971135929, 2.199579871e-06,      4.39617193,    0.9965566178,    0.1928422942]    fk: 2.21212827841       
	k: 200      xk: [   0.4971136154, 2.199649025e-06,     4.396171299,     0.996556618,    0.1928422949]    fk: 2.2121282535        
	k: 300      xk: [   0.4971136188, 2.199656529e-06,     4.396171271,    0.9965566181,    0.1928422948]    fk: 2.21212825211       
	k: 400      xk: [   0.4971136189,  2.19965657e-06,     4.396171271,    0.9965566181,    0.1928422948]    fk: 2.2121282521        

	Parameter values: [0.49711361885556893, 2.1996565695725559e-06, 4.3961712708121734, 0.99655661808759588, 0.19284229477129142]
	Function value:   2.2121282520986973
	Iterations:       419
	Function calls:   892
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [   0.4971136189,  2.19965657e-06,     4.396171271,    0.9965566181,    0.1928422948]    fk: 2.21122835148       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4971136189, 2.309639398e-06,     4.396171271,    0.9965566181,    0.1928422948]    fk: 2.2112373017        
	k: 100      xk: [   0.4973673415, 2.262479469e-06,     4.397384047,    0.9965687287,    0.1920484657]    fk: 2.21067631438       
	k: 200      xk: [   0.4973673406, 2.262479456e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21067631344       

	Parameter values: [0.49736734057329024, 2.2624794593740346e-06, 4.3973840833925877, 0.99656872875494695, 0.19204846622942506]
	Function value:   2.2106763134359162
	Iterations:       265
	Function calls:   566
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [   0.4973673406, 2.262479459e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4973673406, 2.375603432e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066742503       
	k: 100      xk: [   0.4973673406, 2.375603432e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066742503       

	Parameter values: [0.49736734057329024, 2.3756034323427366e-06, 4.3973840833925877, 0.99656872875494695, 0.19204846622942506]
	Function value:   2.2106674250320695
	Iterations:       126
	Function calls:   379
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.4973673406, 2.375603432e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4973673406, 2.494383604e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733663       
	k: 100      xk: [   0.4973673406, 2.494383604e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733663       

	Parameter values: [0.49736734057329024, 2.4943836039598735e-06, 4.3973840833925877, 0.99656872875494695, 0.19204846622942506]
	Function value:   2.2106673366310536
	Iterations:       126
	Function calls:   379
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [   0.4973673406, 2.494383604e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4973673406, 2.619102784e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733575       
	k: 100      xk: [   0.4973673406, 2.619102784e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733575       

	Parameter values: [0.49736734057329024, 2.6191027841578674e-06, 4.3973840833925877, 0.99656872875494695, 0.19204846622942506]
	Function value:   2.2106673357518729
	Iterations:       126
	Function calls:   379
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [   0.4973673406, 2.619102784e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
	k: 100      xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       

	Parameter values: [0.49736734057329024, 2.7500579233657608e-06, 4.3973840833925877, 0.99656872875494695, 0.19204846622942506]
	Function value:   2.2106673357431301
	Iterations:       126
	Function calls:   379
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
	k: 100      xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       

	Parameter values: [0.49736734057329024, 2.7500579233657608e-06, 4.3973840833925877, 0.99656872875494695, 0.19204846622942506]
	Function value:   2.2106673357430422
	Iterations:       126
	Function calls:   379
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
	k: 100      xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       

	Parameter values: [0.49736734057329024, 2.7500579233657608e-06, 4.3973840833925877, 0.99656872875494695, 0.19204846622942506]
	Function value:   2.2106673357430418
	Iterations:       126
	Function calls:   379
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 9        xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       
	k: 100      xk: [   0.4973673406, 2.750057923e-06,     4.397384083,    0.9965687288,    0.1920484662]    fk: 2.21066733574       

	Parameter values: [0.49736734057329024, 2.7500579233657608e-06, 4.3973840833925877, 0.99656872875494695, 0.19204846622942506]
	Function value:   2.2106673357430418
	Iterations:       126
	Function calls:   379
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.49736734057329024, 2.7500579233657608e-06, 4.3973840833925877, 0.99656872875494695, 0.19204846622942506]
Function value:   2.2106673357430418
Iterations:       1872
Function calls:   4791
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.973673405732902
r2 (800.000 MHz):            0.000027500579234
dw:                          4.397384083392588
pA:                          0.996568728754947
kex:                      1920.484662294250711

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/dw.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS CPMG 2-site star/results.bz2' for writing.

relax> model_selection(method='AIC', modsel_pipe='final', bundle='relax_disp', pipes=['No Rex', 'LM63', 'LM63 3-site', 'CR72', 'CR72 full', 'IT99', 'NS CPMG 2-site 3D', 'NS CPMG 2-site expanded', 'NS CPMG 2-site star'])
AIC model selection.


The spin cluster [':70@N'].
# Data pipe                Num_params_(k)    Num_data_sets_(n)    Chi2          Criterion     
No Rex                     2                 30                   2832.28562    2836.28562    
LM63                       4                 30                   137.64638     145.64638     
LM63 3-site                6                 30                   179.47122     191.47122     
CR72                       5                 30                   17.39559      27.39559      
CR72 full                  7                 30                   14.49446      28.49446      
IT99                       5                 30                   29.79804      39.79804      
NS CPMG 2-site 3D          5                 30                   16.93608      26.93608      
NS CPMG 2-site expanded    5                 30                   16.93618      26.93618      
NS CPMG 2-site star        5                 30                   16.93335      26.93335      
The model from the data pipe 'NS CPMG 2-site star' has been selected.


The spin cluster [':71@N'].
# Data pipe                Num_params_(k)    Num_data_sets_(n)    Chi2        Criterion    
No Rex                     2                 15                   73.62191    77.62191     
LM63                       4                 15                   2.31424     10.31424     
LM63 3-site                6                 15                   8.93427     20.93427     
CR72                       5                 15                   2.22439     12.22439     
CR72 full                  7                 15                   2.22439     16.22439     
IT99                       5                 15                   2.33684     12.33684     
NS CPMG 2-site 3D          5                 15                   2.21065     12.21065     
NS CPMG 2-site expanded    5                 15                   2.21066     12.21066     
NS CPMG 2-site star        5                 15                   2.21067     12.21067     
The model from the data pipe 'LM63' has been selected.

relax> monte_carlo.setup(number=50)

relax> monte_carlo.create_data(method='back_calc')

relax> monte_carlo.initial_values()

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)
Simulation 1, cluster [':70@N']
Simulation 1, cluster [':71@N']
Simulation 2, cluster [':70@N']
Simulation 2, cluster [':71@N']
Simulation 3, cluster [':70@N']
Simulation 3, cluster [':71@N']
Simulation 4, cluster [':70@N']
Simulation 4, cluster [':71@N']
Simulation 5, cluster [':70@N']
Simulation 5, cluster [':71@N']
Simulation 6, cluster [':70@N']
Simulation 6, cluster [':71@N']
Simulation 7, cluster [':70@N']
Simulation 7, cluster [':71@N']
Simulation 8, cluster [':70@N']
Simulation 8, cluster [':71@N']
Simulation 9, cluster [':70@N']
Simulation 9, cluster [':71@N']
Simulation 10, cluster [':70@N']
Simulation 10, cluster [':71@N']
Simulation 11, cluster [':70@N']
Simulation 11, cluster [':71@N']
Simulation 12, cluster [':70@N']
Simulation 12, cluster [':71@N']
Simulation 13, cluster [':70@N']
Simulation 13, cluster [':71@N']
Simulation 14, cluster [':70@N']
Simulation 14, cluster [':71@N']
Simulation 15, cluster [':70@N']
Simulation 15, cluster [':71@N']
Simulation 16, cluster [':70@N']
Simulation 16, cluster [':71@N']
Simulation 17, cluster [':70@N']
Simulation 17, cluster [':71@N']
Simulation 18, cluster [':70@N']
Simulation 18, cluster [':71@N']
Simulation 19, cluster [':70@N']
Simulation 19, cluster [':71@N']
Simulation 20, cluster [':70@N']
Simulation 20, cluster [':71@N']
Simulation 21, cluster [':70@N']
Simulation 21, cluster [':71@N']
Simulation 22, cluster [':70@N']
Simulation 22, cluster [':71@N']
Simulation 23, cluster [':70@N']
Simulation 23, cluster [':71@N']
Simulation 24, cluster [':70@N']
Simulation 24, cluster [':71@N']
Simulation 25, cluster [':70@N']
Simulation 25, cluster [':71@N']
Simulation 26, cluster [':70@N']
Simulation 26, cluster [':71@N']
Simulation 27, cluster [':70@N']
Simulation 27, cluster [':71@N']
Simulation 28, cluster [':70@N']
Simulation 28, cluster [':71@N']
Simulation 29, cluster [':70@N']
Simulation 29, cluster [':71@N']
Simulation 30, cluster [':70@N']
Simulation 30, cluster [':71@N']
Simulation 31, cluster [':70@N']
Simulation 31, cluster [':71@N']
Simulation 32, cluster [':70@N']
Simulation 32, cluster [':71@N']
Simulation 33, cluster [':70@N']
Simulation 33, cluster [':71@N']
Simulation 34, cluster [':70@N']
Simulation 34, cluster [':71@N']
Simulation 35, cluster [':70@N']
Simulation 35, cluster [':71@N']
Simulation 36, cluster [':70@N']
Simulation 36, cluster [':71@N']
Simulation 37, cluster [':70@N']
Simulation 37, cluster [':71@N']
Simulation 38, cluster [':70@N']
Simulation 38, cluster [':71@N']
Simulation 39, cluster [':70@N']
Simulation 39, cluster [':71@N']
Simulation 40, cluster [':70@N']
Simulation 40, cluster [':71@N']
Simulation 41, cluster [':70@N']
Simulation 41, cluster [':71@N']
Simulation 42, cluster [':70@N']
Simulation 42, cluster [':71@N']
Simulation 43, cluster [':70@N']
Simulation 43, cluster [':71@N']
Simulation 44, cluster [':70@N']
Simulation 44, cluster [':71@N']
Simulation 45, cluster [':70@N']
Simulation 45, cluster [':71@N']
Simulation 46, cluster [':70@N']
Simulation 46, cluster [':71@N']
Simulation 47, cluster [':70@N']
Simulation 47, cluster [':71@N']
Simulation 48, cluster [':70@N']
Simulation 48, cluster [':71@N']
Simulation 49, cluster [':70@N']
Simulation 49, cluster [':71@N']
Simulation 50, cluster [':70@N']
Simulation 50, cluster [':71@N']

relax> monte_carlo.error_analysis()

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/pB.agr' for writing.

relax> value.write(param='phi_ex', file='phi_ex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex', spin_id=None, plot_data='value', file='phi_ex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex.agr' for writing.

relax> value.write(param='phi_ex_B', file='phi_ex_B.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex_B.out' for writing.

relax> value.write(param='phi_ex_C', file='phi_ex_C.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex_C.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex_B', spin_id=None, plot_data='value', file='phi_ex_B.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex_B.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex_C', spin_id=None, plot_data='value', file='phi_ex_C.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex_C.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> value.write(param='padw2', file='padw2.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/padw2.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='padw2', spin_id=None, plot_data='value', file='padw2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/padw2.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/dw.agr' for writing.

relax> value.write(param='dwH', file='dwH.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/dwH.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dwH', spin_id=None, plot_data='value', file='dwH.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/dwH.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/tex.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/k_AB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/k_AB.agr' for writing.

relax> value.write(param='kB', file='kB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kB.out' for writing.

relax> value.write(param='kC', file='kC.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kC.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kB', spin_id=None, plot_data='value', file='kB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kB.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='kC', spin_id=None, plot_data='value', file='kC.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kC.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/results.bz2' for writing.

relax> state.save(state='final_state', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final_state.bz2' for writing.

