


                                  relax repository checkout r20460
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'relax_disp.py'
----------------------------------------------------------------------------------------------------
"""Script for CPMG relaxation dispersion curve fitting using Dr. Flemming Hansen's data from http://dx.doi.org/10.1021/jp074793o.

To run:

$ ../../../../../relax --tee relax_disp.log relax_disp.py
"""


# Python module imports.
from os import sep

# relax module imports.
from auto_analyses.relax_disp import Relax_disp
from data_store import Relax_data_store; ds = Relax_data_store()
from status import Status; status = Status()


# The dispersion models.
MODELS = ['No Rex', 'LM63', 'LM63 3-site', 'CR72', 'CR72 full', 'IT99', 'NS 2-site 3D', 'NS 2-site expanded', 'NS 2-site star']

# The grid search size (the number of increments per dimension).
GRID_INC = 11

# The number of Monte Carlo simulations to be used for error analysis at the end of the analysis.
MC_NUM = 50



# Create the data pipe.
pipe_name = 'base pipe'
pipe_bundle = 'relax_disp'
pipe.create(pipe_name=pipe_name, bundle=pipe_bundle, pipe_type='relax_disp')

# The path to the data files.
data_path = status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'Hansen'

# Load the saved base pipe
results.read(data_path+sep+'base_pipe')

# Set the nuclear isotope data.
spin.isotope('15N')

# Create the R2eff data pipe and load the results.
pipe.create(pipe_name='R2eff', bundle=pipe_bundle, pipe_type='relax_disp')
pipe.switch(pipe_name='R2eff')
results.read(data_path+sep+'r2eff_pipe')


# Auto-analysis execution.
##########################

# Do not change!
Relax_disp(pipe_name=pipe_name, pipe_bundle=pipe_bundle, models=MODELS, grid_inc=GRID_INC, mc_sim_num=MC_NUM)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='base pipe', pipe_type='relax_disp', bundle='relax_disp')

relax> results.read(file='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/base_pipe', dir=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/base_pipe.bz2' for reading.

relax> spin.isotope(isotope='15N', spin_id=None, force=False)

relax> pipe.create(pipe_name='R2eff', pipe_type='relax_disp', bundle='relax_disp')

relax> pipe.switch(pipe_name='R2eff')

relax> results.read(file='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/r2eff_pipe', dir=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/r2eff_pipe.bz2' for reading.




=======================================
= Relaxation dispersion auto-analysis =
=======================================


relax> spectrum.error_analysis(subset=['500_reference.in', '500_66.667.in', '500_133.33.in', '500_133.33.in.bis', '500_200.in', '500_266.67.in', '500_333.33.in', '500_400.in', '500_466.67.in', '500_533.33.in', '500_533.33.in.bis', '500_600.in', '500_666.67.in', '500_733.33.in', '500_800.in', '500_866.67.in', '500_933.33.in', '500_933.33.in.bis', '500_1000.in'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Variance averaging over all spectra.
Standard deviation for all spins:  275.5589639492646

relax> spectrum.error_analysis(subset=['800_reference.in', '800_66.667.in', '800_133.33.in', '800_133.33.in.bis', '800_200.in', '800_266.67.in', '800_333.33.in', '800_400.in', '800_466.67.in', '800_533.33.in', '800_533.33.in.bis', '800_600.in', '800_666.67.in', '800_733.33.in', '800_800.in', '800_866.67.in', '800_933.33.in', '800_933.33.in.bis', '800_1000.in'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Variance averaging over all spectra.
Standard deviation for all spins:  282.10831679853857



----------------------
- The 'No Rex' model -
----------------------

Detected the presence of results files for the 'No Rex' model - loading these instead of performing optimisation for a second time.

relax> pipe.create(pipe_name='No Rex', pipe_type='relax_disp', bundle='relax_disp')

relax> pipe.switch(pipe_name='No Rex')

relax> results.read(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex')
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/No Rex/results.bz2' for reading.



--------------------
- The 'LM63' model -
--------------------

Detected the presence of results files for the 'LM63' model - loading these instead of performing optimisation for a second time.

relax> pipe.create(pipe_name='LM63', pipe_type='relax_disp', bundle='relax_disp')

relax> pipe.switch(pipe_name='LM63')

relax> results.read(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63')
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63/results.bz2' for reading.



---------------------------
- The 'LM63 3-site' model -
---------------------------

Detected the presence of results files for the 'LM63 3-site' model - loading these instead of performing optimisation for a second time.

relax> pipe.create(pipe_name='LM63 3-site', pipe_type='relax_disp', bundle='relax_disp')

relax> pipe.switch(pipe_name='LM63 3-site')

relax> results.read(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site')
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/LM63 3-site/results.bz2' for reading.



--------------------
- The 'CR72' model -
--------------------

Detected the presence of results files for the 'CR72' model - loading these instead of performing optimisation for a second time.

relax> pipe.create(pipe_name='CR72', pipe_type='relax_disp', bundle='relax_disp')

relax> pipe.switch(pipe_name='CR72')

relax> results.read(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72')
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72/results.bz2' for reading.



-------------------------
- The 'CR72 full' model -
-------------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='CR72 full', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='CR72 full')

relax> relax_disp.select_model(model='CR72 full')
The full Carver and Richards (1972) 2-site model for all time scales.

relax> value.copy(pipe_from='R2eff', pipe_to='CR72 full', param='r2eff')
Model nesting detected, copying the optimised parameters from the 'CR72' model rather than performing a grid search.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    0.701149432,    0.9464519535,     0.701149432,    0.9464519535,     5.577171413,    0.9899029954,    0.1765993086]    fk: 18.4500355413       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.701149432,    0.9464519535,     0.701149432,    0.9937745512,     5.577171413,    0.9899029954,    0.1765993086]    fk: 18.3219058259       
	k: 100      xk: [   0.7059988905,    0.9417236991,   0.01442032641,     1.789054385,     5.535739402,      0.98982233,    0.1777967214]    fk: 17.8041636541       
	k: 200      xk: [   0.7031097693,     0.927247528,   0.01076647999,     2.255113641,      5.52479504,    0.9898051525,    0.1842125678]    fk: 17.6707855597       
	k: 300      xk: [   0.6907967861,    0.8641689926,    0.5026963669,     8.081624084,     5.372799659,    0.9891640237,    0.1930749305]    fk: 16.5534340449       
	k: 400      xk: [   0.6656461587,    0.7724433043,      1.05068157,     15.19603337,     5.374948938,    0.9884803801,    0.1970352269]    fk: 15.7288662568       

	Parameter values: [0.66037745898247824, 0.77427291676924193, 0.99233418746275204, 15.041342102837987, 5.3769789031351909, 0.98847410259697766, 0.19609160238130291]
	Function value:   15.559050480620968
	Iterations:       500
	Function calls:   778
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [    0.660377459,    0.7742729168,    0.9923341875,      15.0413421,     5.376978903,    0.9884741026,    0.1960916024]    fk: 15.6857146938       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.660377459,    0.7742729168,    0.9923341875,      15.0413421,     5.376978903,    0.9884741026,    0.1960916024]    fk: 15.684457518        
	k: 100      xk: [   0.6604194297,    0.7742580258,    0.9879571432,     15.04089877,     5.376893863,    0.9884743083,    0.1961178841]    fk: 15.6844528957       
	k: 200      xk: [   0.6606438006,    0.7742243022,    0.9619998165,     15.03740985,     5.376671578,    0.9884751262,    0.1961977417]    fk: 15.6844453201       
	k: 300      xk: [   0.6558946147,    0.7692712212,     1.366100715,     15.45601319,      5.37638828,    0.9884253321,    0.1958229623]    fk: 15.6844285634       
	k: 400      xk: [   0.6397846964,     0.753365457,     2.735178962,     16.81122501,     5.376570663,    0.9882637237,    0.1944408159]    fk: 15.6843883579       

	Parameter values: [0.63852660791109273, 0.75205954417809795, 2.8399102659168616, 16.919809012462981, 5.3765274396570568, 0.98825066883082213, 0.19434769269062818]
	Function value:   15.684387970523677
	Iterations:       500
	Function calls:   786
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.6385266079,    0.7520595442,     2.839910266,     16.91980901,      5.37652744,    0.9882506688,    0.1943476927]    fk: 15.6857087087       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6385266079,    0.7520595442,     2.839910266,     16.91980901,      5.37652744,    0.9882506688,    0.1943476927]    fk: 15.685695502        
	k: 100      xk: [   0.6385266079,    0.7520595442,     2.839910266,     16.91980901,      5.37652744,    0.9882506688,    0.1943476927]    fk: 15.685695502        
	k: 200      xk: [   0.6385360782,    0.7520573495,     2.838838292,     16.91981664,     5.376510934,     0.988250677,    0.1943505915]    fk: 15.6856954873       
	k: 300      xk: [   0.6385361321,    0.7520574745,     2.838832388,     16.91981586,     5.376510556,    0.9882506764,    0.1943505495]    fk: 15.6856954872       

	Parameter values: [0.63853613207884385, 0.752057474547417, 2.8388323881849309, 16.919815864298013, 5.3765105558379869, 0.98825067639511932, 0.19435054951845093]
	Function value:   15.685695487210902
	Iterations:       352
	Function calls:   771
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [   0.6385361321,    0.7520574745,     2.838832388,     16.91981586,     5.376510556,    0.9882506764,    0.1943505495]    fk: 15.6857086943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6385361321,    0.7520574745,     2.838832388,     16.91981586,     5.376510556,    0.9882506764,    0.1943505495]    fk: 15.6857085622       
	k: 100      xk: [   0.6385361321,    0.7520574745,     2.838832388,     16.91981586,     5.376510556,    0.9882506764,    0.1943505495]    fk: 15.6857085622       
	k: 200      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857085622       
	k: 300      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857085622       

	Parameter values: [0.63853594844097006, 0.75205724618686898, 2.8388466977974813, 16.919834477331158, 5.3765105112364768, 0.98825067420810364, 0.19435054133561319]
	Function value:   15.685708562229308
	Iterations:       330
	Function calls:   751
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.685708693        
	k: 100      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.685708693        
	k: 200      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.685708693        
	k: 300      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.685708693        

	Parameter values: [0.63853594844097006, 0.75205724618686898, 2.8388466977974813, 16.919834477331158, 5.3765105112364768, 0.98825067420810364, 0.19435054133561319]
	Function value:   15.685708692979519
	Iterations:       351
	Function calls:   781
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 100      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 200      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 300      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       

	Parameter values: [0.63853594844097006, 0.75205724618686898, 2.8388466977974813, 16.919834477331158, 5.3765105112364768, 0.98825067420810364, 0.19435054133561319]
	Function value:   15.685708694287024
	Iterations:       351
	Function calls:   781
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 100      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 200      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 300      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       

	Parameter values: [0.63853594844097006, 0.75205724618686898, 2.8388466977974813, 16.919834477331158, 5.3765105112364768, 0.98825067420810364, 0.19435054133561319]
	Function value:   15.685708694300097
	Iterations:       351
	Function calls:   781
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 100      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 200      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 300      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       

	Parameter values: [0.63853594844097006, 0.75205724618686898, 2.8388466977974813, 16.919834477331158, 5.3765105112364768, 0.98825067420810364, 0.19435054133561319]
	Function value:   15.685708694300228
	Iterations:       351
	Function calls:   781
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 100      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 200      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       
	k: 300      xk: [   0.6385359484,    0.7520572462,     2.838846698,     16.91983448,     5.376510511,    0.9882506742,    0.1943505413]    fk: 15.6857086943       

	Parameter values: [0.63853594844097006, 0.75205724618686898, 2.8388466977974813, 16.919834477331158, 5.3765105112364768, 0.98825067420810364, 0.19435054133561319]
	Function value:   15.685708694300228
	Iterations:       351
	Function calls:   781
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.63853594844097006, 0.75205724618686898, 2.8388466977974813, 16.919834477331158, 5.3765105112364768, 0.98825067420810364, 0.19435054133561319]
Function value:   15.685708694300228
Iterations:       3437
Function calls:   6991
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2a (500.000 MHz):           6.385359484409701
r2a (800.000 MHz):           7.520572461868690
r2b (500.000 MHz):          28.388466977974815
r2b (800.000 MHz):         169.198344773311590
dw:                          5.376510511236477
pA:                          0.988250674208104
kex:                      1943.505413356131839


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4978483933, 4.043854075e-07,    0.4978483933, 4.043854075e-07,     4.460490035,    0.9967561258,     0.187958467]    fk: 1.37893464802       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4978483933, 4.246046779e-07,    0.4978483933, 4.043854075e-07,     4.460490035,    0.9967561258,     0.187958467]    fk: 1.58058416241       
	k: 100      xk: [   0.4906614163, 6.460729738e-06,     1.665265163,  1.95700897e-06,     3.983850463,    0.9959526402,     0.207047537]    fk: 1.53328315476       
	k: 200      xk: [   0.4788196543, 1.820966761e-05,     3.504370383, 6.454883212e-06,     3.310154319,    0.9942784104,    0.2161658565]    fk: 1.51364286606       
	k: 300      xk: [   0.4591257206, 3.293966963e-05,     5.201525435, 1.294002811e-05,     2.901122901,    0.9924269685,    0.2251339118]    fk: 1.50640064235       
	k: 400      xk: [   0.4256310243, 5.604084353e-05,     7.527500444, 2.224484308e-05,      2.52844737,    0.9899828961,    0.2265270266]    fk: 1.50109290322       

	Parameter values: [0.38748757911890297, 7.8714780055477398e-05, 9.3424028996440178, 3.0791084091809197e-05, 2.3100089465645057, 0.98770036819667073, 0.2313875332251924]
	Function value:   1.497976305553379
	Iterations:       500
	Function calls:   757
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.3874875791, 7.871478006e-05,       9.3424029, 3.079108409e-05,     2.310008947,    0.9877003682,    0.2313875332]    fk: 1.42134567161       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.3874875791, 7.871478006e-05,       9.3424029,  3.23306383e-05,     2.310008947,    0.9877003682,    0.2313875332]    fk: 1.42210709894       
	k: 100      xk: [   0.3877847471, 9.275602178e-05,     9.380271339, 3.461817442e-05,      2.30728953,    0.9877344557,    0.2298058554]    fk: 1.42179398542       
	k: 200      xk: [   0.3816654248, 0.0004837510517,     11.07895603, 0.0001140392247,     2.452338226,    0.9889803863,    0.2257135687]    fk: 1.41862677391       
	k: 300      xk: [   0.3766491973,  0.001309771768,     13.77606333, 9.334622404e-05,     2.712614085,    0.9906910473,    0.2196506742]    fk: 1.41323520551       
	k: 400      xk: [   0.3763837117,  0.001941057315,     15.43265476, 2.479835158e-06,     2.875031053,    0.9915859748,    0.2144300938]    fk: 1.40974494473       

	Parameter values: [0.37684337185018513, 0.0019625245658528804, 15.525333407320993, 3.8401656932942042e-06, 2.8853346038090422, 0.99165183097121723, 0.21322596065861754]
	Function value:   1.409384235028827
	Iterations:       500
	Function calls:   764
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.3768433719,  0.001962524566,     15.52533341, 3.840165693e-06,     2.885334604,     0.991651831,    0.2132259607]    fk: 1.40866876787       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.3768433719,  0.001962524566,     15.52533341, 4.032173978e-06,     2.885334604,     0.991651831,    0.2132259607]    fk: 1.40867587375       
	k: 100      xk: [   0.3760583411,  0.002604644646,     15.96690789, 2.736660213e-06,     2.929438743,    0.9918301188,    0.2128027109]    fk: 1.40779799941       
	k: 200      xk: [   0.3769232358,  0.004258153973,     16.93772093, 8.640034084e-08,     3.044637213,     0.992330385,    0.2097592601]    fk: 1.40528020832       
	k: 300      xk: [   0.3652756548,   0.01744895815,     19.98659507,  1.07456452e-07,     3.196857554,    0.9927757817,    0.2043800172]    fk: 1.40198985736       
	k: 400      xk: [   0.3662407827,   0.01772536009,     19.99587364, 5.178163896e-09,     3.205668685,    0.9928191565,    0.2034006034]    fk: 1.40178007131       

	Parameter values: [0.39096214062082746, 0.024940128132778426, 19.847535812637965, 6.3141446451508794e-08, 3.5440827317218098, 0.99406781549406187, 0.19499080034093985]
	Function value:   1.3930622901084162
	Iterations:       500
	Function calls:   792
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.3909621406,   0.02494012813,     19.84753581, 6.314144645e-08,     3.544082732,    0.9940678155,    0.1949908003]    fk: 1.39364896343       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.3909621406,   0.02494012813,     19.84753581, 6.629851877e-08,     3.544082732,    0.9940678155,    0.1949908003]    fk: 1.39305037054       
	k: 100      xk: [   0.4008467643,   0.03237310316,     19.83704717,  7.93661898e-08,     3.683829682,    0.9945202897,    0.1881081866]    fk: 1.39089592977       
	k: 200      xk: [   0.4234847517,    0.1500151845,     19.80184427, 1.915206768e-07,     4.289293904,    0.9957384958,    0.1740605597]    fk: 1.38023078223       
	k: 300      xk: [    0.427847727,    0.1965878942,     19.79012382, 2.385190792e-07,     4.459921626,     0.995971205,    0.1687573905]    fk: 1.37893486283       
	k: 400      xk: [   0.4278555095,    0.1967653483,     19.79011758,  2.38727531e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893473347       

	Parameter values: [0.42785550951679219, 0.19676534845035862, 19.790117575082114, 2.3872753133831667e-07, 4.4604902404086051, 0.99597178008112497, 0.16873615013434298]
	Function value:   1.3789347334731825
	Iterations:       500
	Function calls:   1010
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.4278555095,    0.1967653485,     19.79011758, 2.387275313e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4278555095,    0.1967653485,     19.79011758, 2.506639079e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464887       
	k: 100      xk: [   0.4278555095,    0.2016844822,     19.79011758, 2.446957196e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464887       
	k: 200      xk: [   0.4278555095,    0.2006085217,     19.79011758,  2.46001018e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464887       

	Parameter values: [0.42785550951656448, 0.20060852174211924, 19.790117575081396, 2.4600101796289206e-07, 4.460490240403308, 0.99597178008111753, 0.16873615013490606]
	Function value:   1.3789346488690428
	Iterations:       256
	Function calls:   768
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.4278555095,    0.2006085217,     19.79011758,  2.46001018e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4278555095,    0.2006085217,     19.79011758, 2.583010689e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464803       
	k: 100      xk: [   0.4278555095,    0.2056237348,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464803       
	k: 200      xk: [   0.4278555095,    0.2056237348,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464803       

	Parameter values: [0.42785550951656448, 0.20562373478567222, 19.790117575081396, 2.5215104341196439e-07, 4.460490240403308, 0.99597178008111753, 0.16873615013490606]
	Function value:   1.3789346480278712
	Iterations:       232
	Function calls:   749
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4278555095,    0.2056237348,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
	k: 100      xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
	k: 200      xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       

	Parameter values: [0.42785550951656448, 0.21590492152495586, 19.790117575081396, 2.5215104341196439e-07, 4.460490240403308, 0.99597178008111753, 0.16873615013490606]
	Function value:   1.3789346480195084
	Iterations:       232
	Function calls:   749
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
	k: 100      xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
	k: 200      xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       

	Parameter values: [0.42785550951656448, 0.21590492152495586, 19.790117575081396, 2.5215104341196439e-07, 4.460490240403308, 0.99597178008111753, 0.16873615013490606]
	Function value:   1.3789346480194256
	Iterations:       231
	Function calls:   740
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
	k: 100      xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
	k: 200      xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       

	Parameter values: [0.42785550951656448, 0.21590492152495586, 19.790117575081396, 2.5215104341196439e-07, 4.460490240403308, 0.99597178008111753, 0.16873615013490606]
	Function value:   1.3789346480194244
	Iterations:       231
	Function calls:   740
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
	k: 100      xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       
	k: 200      xk: [   0.4278555095,    0.2159049215,     19.79011758, 2.521510434e-07,      4.46049024,    0.9959717801,    0.1687361501]    fk: 1.37893464802       

	Parameter values: [0.42785550951656448, 0.21590492152495586, 19.790117575081396, 2.5215104341196439e-07, 4.460490240403308, 0.99597178008111753, 0.16873615013490606]
	Function value:   1.3789346480194244
	Iterations:       231
	Function calls:   740
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.42785550951656448, 0.21590492152495586, 19.790117575081396, 2.5215104341196439e-07, 4.460490240403308, 0.99597178008111753, 0.16873615013490606]
Function value:   1.3789346480194244
Iterations:       3413
Function calls:   7809
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2a (500.000 MHz):           4.278555095165645
r2a (800.000 MHz):           2.159049215249559
r2b (500.000 MHz):         197.901175750813962
r2b (800.000 MHz):           0.000002521510434
dw:                          4.460490240403308
pA:                          0.995971780081118
kex:                      1687.361501349060518

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/dw.agr' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/CR72 full/results.bz2' for writing.



--------------------
- The 'IT99' model -
--------------------

Detected the presence of results files for the 'IT99' model - loading these instead of performing optimisation for a second time.

relax> pipe.create(pipe_name='IT99', pipe_type='relax_disp', bundle='relax_disp')

relax> pipe.switch(pipe_name='IT99')

relax> results.read(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99')
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/IT99/results.bz2' for reading.



----------------------------
- The 'NS 2-site 3D' model -
----------------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='NS 2-site 3D', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='NS 2-site 3D')

relax> relax_disp.select_model(model='NS 2-site 3D')
The reduced numerical solution for the 2-site Bloch-McConnell equations using 3D magnetisation vectors, whereby the simplification R20A = R20B is assumed.

relax> value.copy(pipe_from='R2eff', pipe_to='NS 2-site 3D', param='r2eff')
Model equivalence detected, copying the optimised parameters from the analytic 'CR72' model rather than performing a grid search.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    0.701149432,    0.9464519535,     5.577171413,    0.9899029954,    0.1765993086]    fk: 22.083123799        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.701149432,    0.9464519535,     5.577171413,    0.9899029954,     0.185429274]    fk: 20.2417431953       
	k: 100      xk: [   0.6987163832,    0.9426162702,     5.655665686,    0.9897633122,    0.1731658037]    fk: 18.0516895002       
	k: 200      xk: [   0.6996106687,    0.9452811289,     5.644822649,    0.9897517232,    0.1723424667]    fk: 18.0436791471       
	k: 300      xk: [   0.6996109401,    0.9452681073,     5.644852028,     0.989751844,    0.1723495065]    fk: 18.0436788425       

	Parameter values: [0.69961093999412372, 0.94526810738365796, 5.6448520285809156, 0.98975184401607108, 0.17234950643104957]
	Function value:   18.043678842364862
	Iterations:       371
	Function calls:   713
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 1        xk: [     0.69961094,    0.9452681074,     5.644852029,     0.989751844,    0.1723495064]    fk: 18.0983726181       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     0.69961094,    0.9452681074,     5.644852029,     0.989751844,    0.1723495064]    fk: 18.0978256803       
	k: 100      xk: [     0.69961094,    0.9452681074,     5.644852029,     0.989751844,    0.1723495064]    fk: 18.0978256803       
	k: 200      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0978255843       

	Parameter values: [0.69960951543049521, 0.94527305888028623, 5.644869314364918, 0.98975178843058265, 0.17234424440665944]
	Function value:   18.09782558425233
	Iterations:       273
	Function calls:   569
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983670507       
	k: 100      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983670507       
	k: 200      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983670507       

	Parameter values: [0.69960951543049521, 0.94527305888028623, 5.644869314364918, 0.98975178843058265, 0.17234424440665944]
	Function value:   18.098367050739338
	Iterations:       264
	Function calls:   542
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983724654       
	k: 100      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983724654       
	k: 200      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983724654       

	Parameter values: [0.69960951543049521, 0.94527305888028623, 5.644869314364918, 0.98975178843058265, 0.17234424440665944]
	Function value:   18.098372465404204
	Iterations:       264
	Function calls:   542
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725196       
	k: 100      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725196       
	k: 200      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725196       

	Parameter values: [0.69960951543049521, 0.94527305888028623, 5.644869314364918, 0.98975178843058265, 0.17234424440665944]
	Function value:   18.098372519550853
	Iterations:       264
	Function calls:   542
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
	k: 100      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
	k: 200      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       

	Parameter values: [0.69960951543049521, 0.94527305888028623, 5.644869314364918, 0.98975178843058265, 0.17234424440665944]
	Function value:   18.098372520092322
	Iterations:       264
	Function calls:   542
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
	k: 100      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
	k: 200      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       

	Parameter values: [0.69960951543049521, 0.94527305888028623, 5.644869314364918, 0.98975178843058265, 0.17234424440665944]
	Function value:   18.098372520097737
	Iterations:       264
	Function calls:   542
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
	k: 100      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
	k: 200      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       

	Parameter values: [0.69960951543049521, 0.94527305888028623, 5.644869314364918, 0.98975178843058265, 0.17234424440665944]
	Function value:   18.09837252009779
	Iterations:       264
	Function calls:   542
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
	k: 100      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       
	k: 200      xk: [   0.6996095154,    0.9452730589,     5.644869314,    0.9897517884,    0.1723442444]    fk: 18.0983725201       

	Parameter values: [0.69960951543049521, 0.94527305888028623, 5.644869314364918, 0.98975178843058265, 0.17234424440665944]
	Function value:   18.09837252009779
	Iterations:       264
	Function calls:   542
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.69960951543049521, 0.94527305888028623, 5.644869314364918, 0.98975178843058265, 0.17234424440665944]
Function value:   18.09837252009779
Iterations:       2492
Function calls:   5076
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.996095154304952
r2 (800.000 MHz):            9.452730588802861
dw:                          5.644869314364918
pA:                          0.989751788430583
kex:                      1723.442444066594362


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4978483933, 4.043854075e-07,     4.460490035,    0.9967561258,     0.187958467]    fk: 1.4702217199        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4978483933, 4.246046779e-07,     4.460490035,    0.9967561258,     0.187958467]    fk: 1.57735023367       
	k: 100      xk: [   0.4978469102, 4.362967202e-07,     4.609049817,    0.9968357289,    0.1820311426]    fk: 1.47786373634       
	k: 200      xk: [   0.4987497307, 7.558994614e-07,     4.870607701,    0.9970985215,    0.1716178767]    fk: 1.47545745434       
	k: 300      xk: [   0.4970949893, 0.0004320308692,     4.607783474,    0.9968191203,    0.1849447347]    fk: 1.40988296001       
	k: 400      xk: [   0.4971378683,    0.1595082497,     4.424419214,    0.9966036211,    0.1892864246]    fk: 1.35086038018       

	Parameter values: [0.49699051520468607, 2.3546713936224024, 3.8277247526434142, 0.99565469792203265, 0.20376983266916571]
	Function value:   1.3352359703940353
	Iterations:       500
	Function calls:   773
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4969905152,     2.354671394,     3.827724753,    0.9956546979,    0.2037698327]    fk: 1.38429962803       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4969905152,     2.472404963,     3.827724753,    0.9956546979,    0.2037698327]    fk: 1.38380636146       
	k: 100      xk: [   0.4968185549,   0.03362201521,     4.123028441,    0.9961781942,    0.1966569597]    fk: 1.37666448684       
	k: 200      xk: [   0.4968164392,    0.1056932471,     4.239158884,    0.9963590841,    0.1938578551]    fk: 1.37504710329       
	k: 300      xk: [   0.4980062963,     4.519029124,     4.633824377,    0.9968651637,    0.1804301665]    fk: 1.3701459445        
	k: 400      xk: [   0.4979538081,     6.793492663,     4.633370642,    0.9968630876,     0.180678217]    fk: 1.37012881585       

	Parameter values: [0.49799589085488438, 10.000850408981814, 4.6283099991613668, 0.99685918780718452, 0.18058511770722641]
	Function value:   1.3701089943334142
	Iterations:       500
	Function calls:   814
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4979958909,     10.00085041,     4.628309999,    0.9968591878,    0.1805851177]    fk: 1.37066238046       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979958909,     10.00085041,     4.628309999,    0.9968591878,    0.1805851177]    fk: 1.37065684591       
	k: 100      xk: [   0.4979977839,     10.07168481,     4.628787586,    0.9968597246,    0.1805662471]    fk: 1.3706568378        
	k: 200      xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.3706568377        

	Parameter values: [0.49799775027647553, 10.008910847378356, 4.6287720957151315, 0.99685970856469996, 0.18056652090236858]
	Function value:   1.3706568377005053
	Iterations:       242
	Function calls:   549
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066231605       
	k: 100      xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066231605       
	k: 200      xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066231605       

	Parameter values: [0.4979977502764753, 10.008910847159598, 4.62877209571508, 0.99685970856469996, 0.18056652090237024]
	Function value:   1.3706623160528493
	Iterations:       237
	Function calls:   529
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237084       
	k: 100      xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237084       

	Parameter values: [0.4979977502764753, 10.008910847159598, 4.62877209571508, 0.99685970856469996, 0.18056652090237024]
	Function value:   1.3706623708363732
	Iterations:       184
	Function calls:   437
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237138       
	k: 100      xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237138       

	Parameter values: [0.4979977502764753, 10.008910847159598, 4.62877209571508, 0.99685970856469996, 0.18056652090237024]
	Function value:   1.3706623713842088
	Iterations:       184
	Function calls:   437
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
	k: 100      xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       

	Parameter values: [0.4979977502764753, 10.008910847159598, 4.62877209571508, 0.99685970856469996, 0.18056652090237024]
	Function value:   1.3706623713896868
	Iterations:       184
	Function calls:   437
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
	k: 100      xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       

	Parameter values: [0.4979977502764753, 10.008910847159598, 4.62877209571508, 0.99685970856469996, 0.18056652090237024]
	Function value:   1.3706623713897419
	Iterations:       184
	Function calls:   437
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
	k: 100      xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       

	Parameter values: [0.4979977502764753, 10.008910847159598, 4.62877209571508, 0.99685970856469996, 0.18056652090237024]
	Function value:   1.3706623713897423
	Iterations:       184
	Function calls:   437
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       
	k: 100      xk: [   0.4979977503,     10.00891085,     4.628772096,    0.9968597086,    0.1805665209]    fk: 1.37066237139       

	Parameter values: [0.4979977502764753, 10.008910847159598, 4.62877209571508, 0.99685970856469996, 0.18056652090237024]
	Function value:   1.3706623713897423
	Iterations:       184
	Function calls:   437
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.4979977502764753, 10.008910847159598, 4.62877209571508, 0.99685970856469996, 0.18056652090237024]
Function value:   1.3706623713897423
Iterations:       2583
Function calls:   5287
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.979977502764753
r2 (800.000 MHz):          100.089108471595978
dw:                          4.628772095715080
pA:                          0.996859708564700
kex:                      1805.665209023702346

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/dw.agr' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site 3D/results.bz2' for writing.



----------------------------------
- The 'NS 2-site expanded' model -
----------------------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='NS 2-site expanded', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='NS 2-site expanded')

relax> relax_disp.select_model(model='NS 2-site expanded')
The numerical solution for the 2-site Bloch-McConnell equations expanded using Maple by Nikolai Skrynnikov.

relax> value.copy(pipe_from='R2eff', pipe_to='NS 2-site expanded', param='r2eff')
Model equivalence detected, copying the optimised parameters from the analytic 'CR72' model rather than performing a grid search.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    0.701149432,    0.9464519535,     5.577171413,    0.9899029954,    0.1765993086]    fk: 22.0833224058       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.701149432,    0.9464519535,     5.577171413,    0.9899029954,     0.185429274]    fk: 20.2418130755       
	k: 100      xk: [   0.6987163832,    0.9426162702,     5.655665686,    0.9897633122,    0.1731658037]    fk: 18.0517948839       
	k: 200      xk: [   0.6996144791,    0.9452693997,     5.644747222,    0.9897519077,    0.1723570297]    fk: 18.0437855898       
	k: 300      xk: [   0.6996110399,    0.9452681698,     5.644849424,    0.9897518378,    0.1723495032]    fk: 18.0437848386       

	Parameter values: [0.69961103991551088, 0.94526816976874195, 5.6448494240804408, 0.98975183783496212, 0.17234950326877868]
	Function value:   18.043784838635602
	Iterations:       370
	Function calls:   718
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 1        xk: [   0.6996110399,    0.9452681698,     5.644849424,    0.9897518378,    0.1723495033]    fk: 18.0984786175       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996110399,    0.9452681698,     5.644849424,    0.9897518378,    0.1723495033]    fk: 18.0979316797       
	k: 100      xk: [   0.6996110399,    0.9452681698,     5.644849424,    0.9897518378,    0.1723495033]    fk: 18.0979316797       
	k: 200      xk: [    0.699609623,    0.9452729613,     5.644867093,    0.9897517853,    0.1723443978]    fk: 18.097931587        

	Parameter values: [0.6996096230093547, 0.94527296126486049, 5.6448670933250948, 0.98975178533086972, 0.17234439781616689]
	Function value:   18.097931586953262
	Iterations:       283
	Function calls:   583
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [    0.699609623,    0.9452729613,     5.644867093,    0.9897517853,    0.1723443978]    fk: 18.0984785229       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.699609623,    0.9452729613,     5.644867093,    0.9897517853,    0.1723443978]    fk: 18.0984730535       
	k: 100      xk: [    0.699609623,    0.9452729613,     5.644867093,    0.9897517853,    0.1723443978]    fk: 18.0984730535       
	k: 200      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984730535       

	Parameter values: [0.69960961319450499, 0.94527298972998408, 5.6448674477977896, 0.98975178483683868, 0.17234434244849736]
	Function value:   18.098473053508158
	Iterations:       260
	Function calls:   529
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984784682       
	k: 100      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984784682       
	k: 200      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984784682       

	Parameter values: [0.69960961319450499, 0.94527298972998408, 5.6448674477977896, 0.98975178483683868, 0.17234434244849736]
	Function value:   18.098478468173663
	Iterations:       278
	Function calls:   562
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785223       
	k: 100      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785223       
	k: 200      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785223       

	Parameter values: [0.69960961319450499, 0.94527298972998408, 5.6448674477977896, 0.98975178483683868, 0.17234434244849736]
	Function value:   18.09847852232032
	Iterations:       278
	Function calls:   562
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
	k: 100      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
	k: 200      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       

	Parameter values: [0.69960961319450499, 0.94527298972998408, 5.6448674477977896, 0.98975178483683868, 0.17234434244849736]
	Function value:   18.098478522861789
	Iterations:       278
	Function calls:   562
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
	k: 100      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
	k: 200      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       

	Parameter values: [0.69960961319450499, 0.94527298972998408, 5.6448674477977896, 0.98975178483683868, 0.17234434244849736]
	Function value:   18.098478522867204
	Iterations:       278
	Function calls:   562
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
	k: 100      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
	k: 200      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       

	Parameter values: [0.69960961319450499, 0.94527298972998408, 5.6448674477977896, 0.98975178483683868, 0.17234434244849736]
	Function value:   18.098478522867257
	Iterations:       278
	Function calls:   562
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
	k: 100      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       
	k: 200      xk: [   0.6996096132,    0.9452729897,     5.644867448,    0.9897517848,    0.1723443424]    fk: 18.0984785229       

	Parameter values: [0.69960961319450499, 0.94527298972998408, 5.6448674477977896, 0.98975178483683868, 0.17234434244849736]
	Function value:   18.098478522867257
	Iterations:       278
	Function calls:   562
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.69960961319450499, 0.94527298972998408, 5.6448674477977896, 0.98975178483683868, 0.17234434244849736]
Function value:   18.098478522867257
Iterations:       2581
Function calls:   5202
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.996096131945050
r2 (800.000 MHz):            9.452729897299841
dw:                          5.644867447797790
pA:                          0.989751784836839
kex:                      1723.443424484973548


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4978483933, 4.043854075e-07,     4.460490035,    0.9967561258,     0.187958467]    fk: 1.47023202426       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4978483933, 4.246046779e-07,     4.460490035,    0.9967561258,     0.187958467]    fk: 1.57736053803       
	k: 100      xk: [   0.4978469102, 4.362967202e-07,     4.609049817,    0.9968357289,    0.1820311426]    fk: 1.47786700752       
	k: 200      xk: [   0.4980225625, 1.120922277e-06,     4.949040702,    0.9971461296,     0.172010745]    fk: 1.47379057778       
	k: 300      xk: [   0.4963933454, 1.776341815e-05,     4.221763504,    0.9963076206,    0.1957579389]    fk: 1.44453249187       
	k: 400      xk: [   0.4960556853, 4.633598319e-05,     3.816989358,    0.9955989907,    0.2058150317]    fk: 1.44181432152       

	Parameter values: [0.49562767857678103, 0.00022088589964279373, 3.4429275730210254, 0.99468558471841817, 0.21395242363833944]
	Function value:   1.4349038073659197
	Iterations:       500
	Function calls:   793
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4956276786, 0.0002208858996,     3.442927573,    0.9946855847,    0.2139524236]    fk: 1.39419765666       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4956276786, 0.0002319301946,     3.442927573,    0.9946855847,    0.2139524236]    fk: 1.39427890877       
	k: 100      xk: [   0.4968958593, 0.0001765344305,     3.881868235,    0.9957746399,    0.2023408542]    fk: 1.38386195613       
	k: 200      xk: [   0.4976712632, 4.852102984e-06,     4.253076068,    0.9963993924,    0.1917895224]    fk: 1.37530313017       
	k: 300      xk: [   0.4980041507, 0.0005604168664,      4.63854177,    0.9968702536,    0.1802760963]    fk: 1.37102749684       
	k: 400      xk: [   0.4980088945,  0.008933542027,     4.634736467,    0.9968660703,    0.1803516353]    fk: 1.37074647779       

	Parameter values: [0.49794231264426025, 1.8897219939207783, 4.6310504859112402, 0.99686100729134108, 0.180713270557469]
	Function value:   1.3702246302905416
	Iterations:       500
	Function calls:   794
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4979423126,     1.889721994,     4.631050486,    0.9968610073,    0.1807132706]    fk: 1.37067597524       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979423126,     1.984208094,     4.631050486,    0.9968610073,    0.1807132706]    fk: 1.37066634587       
	k: 100      xk: [    0.497995646,     2.020919339,     4.628367159,    0.9968592402,    0.1805850758]    fk: 1.37066110894       
	k: 200      xk: [   0.4979980661,      9.94233997,     4.628689643,    0.9968596289,    0.1805677064]    fk: 1.3706600897        
	k: 300      xk: [   0.4979976961,     10.00348969,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066008939       

	Parameter values: [0.49799769607287381, 10.003489704868507, 4.6287333402487612, 0.99685966431198691, 0.18056755084362033]
	Function value:   1.3706600893918097
	Iterations:       350
	Function calls:   766
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.4979976961,      10.0034897,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.3706656231        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979976961,      10.0034897,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066556776       
	k: 100      xk: [   0.4979976961,      10.0034897,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066556776       
	k: 200      xk: [   0.4979976961,      10.0034897,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066556776       

	Parameter values: [0.49799769607287403, 10.003489704953644, 4.6287333402487372, 0.99685966431198691, 0.18056755084362028]
	Function value:   1.3706655677557849
	Iterations:       217
	Function calls:   571
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.4979976961,      10.0034897,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979976961,      10.0034897,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562254       
	k: 100      xk: [   0.4979976961,      10.0034897,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562254       

	Parameter values: [0.49799769607287403, 10.003520233181504, 4.6287333402487372, 0.99685966431198691, 0.18056755084362028]
	Function value:   1.3706656225394267
	Iterations:       182
	Function calls:   440
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
	k: 100      xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       

	Parameter values: [0.49799769607287403, 10.003520233181504, 4.6287333402487372, 0.99685966431198691, 0.18056755084362028]
	Function value:   1.3706656230872634
	Iterations:       182
	Function calls:   440
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
	k: 100      xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       

	Parameter values: [0.49799769607287403, 10.003520233181504, 4.6287333402487372, 0.99685966431198691, 0.18056755084362028]
	Function value:   1.3706656230927414
	Iterations:       182
	Function calls:   440
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
	k: 100      xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       

	Parameter values: [0.49799769607287403, 10.003520233181504, 4.6287333402487372, 0.99685966431198691, 0.18056755084362028]
	Function value:   1.3706656230927965
	Iterations:       182
	Function calls:   440
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
	k: 100      xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       

	Parameter values: [0.49799769607287403, 10.003520233181504, 4.6287333402487372, 0.99685966431198691, 0.18056755084362028]
	Function value:   1.3706656230927969
	Iterations:       182
	Function calls:   440
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       
	k: 100      xk: [   0.4979976961,     10.00352023,      4.62873334,    0.9968596643,    0.1805675508]    fk: 1.37066562309       

	Parameter values: [0.49799769607287403, 10.003520233181504, 4.6287333402487372, 0.99685966431198691, 0.18056755084362028]
	Function value:   1.3706656230927969
	Iterations:       182
	Function calls:   440
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.49799769607287403, 10.003520233181504, 4.6287333402487372, 0.99685966431198691, 0.18056755084362028]
Function value:   1.3706656230927969
Iterations:       2659
Function calls:   5564
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.979976960728740
r2 (800.000 MHz):          100.035202331815043
dw:                          4.628733340248737
pA:                          0.996859664311987
kex:                      1805.675508436202790

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/dw.agr' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site expanded/results.bz2' for writing.



------------------------------
- The 'NS 2-site star' model -
------------------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='NS 2-site star', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='NS 2-site star')

relax> relax_disp.select_model(model='NS 2-site star')
The numerical reduced solution for the 2-site Bloch-McConnell equations using complex conjugate matrices, whereby the simplification R20A = R20B is assumed.

relax> value.copy(pipe_from='R2eff', pipe_to='NS 2-site star', param='r2eff')
Model equivalence detected, copying the optimised parameters from the analytic 'CR72' model rather than performing a grid search.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    0.701149432,    0.9464519535,     5.577171413,    0.9899029954,    0.1765993086]    fk: 22.083143109        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.701149432,    0.9464519535,     5.577171413,    0.9899029954,     0.185429274]    fk: 20.2417150641       
	k: 100      xk: [   0.6987163832,    0.9426162702,     5.655665686,    0.9897633122,    0.1731658037]    fk: 18.0516589322       
	k: 200      xk: [   0.6997001512,    0.9452020144,     5.645154259,    0.9897545525,    0.1724555002]    fk: 18.0437122344       
	k: 300      xk: [   0.6997001768,    0.9452020167,     5.645154235,    0.9897545526,    0.1724555006]    fk: 18.0437122329       
	k: 400      xk: [   0.6997001832,    0.9452020168,     5.645154232,    0.9897545526,    0.1724555006]    fk: 18.0437122327       

	Parameter values: [0.69970018323113226, 0.94520201682728044, 5.6451542316037671, 0.98975455263287526, 0.17245550061581472]
	Function value:   18.043712232698933
	Iterations:       432
	Function calls:   837
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [   0.6997001832,    0.9452020168,     5.645154232,    0.9897545526,    0.1724555006]    fk: 18.0984106632       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6997001832,    0.9452020168,     5.645154232,    0.9897545526,    0.1724555006]    fk: 18.0978636789       
	k: 100      xk: [   0.6996375751,    0.9453116746,     5.645039085,    0.9897515267,    0.1723077547]    fk: 18.097741418        
	k: 200      xk: [   0.6996376709,    0.9453117226,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0977115347       

	Parameter values: [0.69963767096300311, 0.94531172269548769, 5.6450392054721101, 0.98975153144426842, 0.17230786561962694]
	Function value:   18.097711534695357
	Iterations:       288
	Function calls:   585
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982529934       
	k: 100      xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982529934       

	Parameter values: [0.69963767096319662, 0.9453117226957406, 5.6450392054749168, 0.9897515314442763, 0.17230786561959766]
	Function value:   18.098252993398969
	Iterations:       167
	Function calls:   471
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.098258408        
	k: 100      xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.098258408        

	Parameter values: [0.69963767096319662, 0.9453117226957406, 5.6450392054749168, 0.9897515314442763, 0.17230786561959766]
	Function value:   18.098258407986005
	Iterations:       156
	Function calls:   465
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584621       
	k: 100      xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584621       

	Parameter values: [0.69963767096319662, 0.9453117226957406, 5.6450392054749168, 0.9897515314442763, 0.17230786561959766]
	Function value:   18.098258462131881
	Iterations:       156
	Function calls:   465
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
	k: 100      xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       

	Parameter values: [0.69963767096319662, 0.9453117226957406, 5.6450392054749168, 0.9897515314442763, 0.17230786561959766]
	Function value:   18.098258462673339
	Iterations:       156
	Function calls:   465
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
	k: 100      xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       

	Parameter values: [0.69963767096319662, 0.9453117226957406, 5.6450392054749168, 0.9897515314442763, 0.17230786561959766]
	Function value:   18.098258462678753
	Iterations:       156
	Function calls:   465
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
	k: 100      xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       

	Parameter values: [0.69963767096319662, 0.9453117226957406, 5.6450392054749168, 0.9897515314442763, 0.17230786561959766]
	Function value:   18.098258462678807
	Iterations:       156
	Function calls:   465
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       
	k: 100      xk: [    0.699637671,    0.9453117227,     5.645039205,    0.9897515314,    0.1723078656]    fk: 18.0982584627       

	Parameter values: [0.69963767096319662, 0.9453117226957406, 5.6450392054749168, 0.9897515314442763, 0.17230786561959766]
	Function value:   18.098258462678807
	Iterations:       156
	Function calls:   465
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.69963767096319662, 0.9453117226957406, 5.6450392054749168, 0.9897515314442763, 0.17230786561959766]
Function value:   18.098258462678807
Iterations:       1823
Function calls:   4683
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.996376709631966
r2 (800.000 MHz):            9.453117226957406
dw:                          5.645039205474917
pA:                          0.989751531444276
kex:                      1723.078656195976464


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4978483933, 4.043854075e-07,     4.460490035,    0.9967561258,     0.187958467]    fk: 1.47021478431       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4978483933, 4.246046779e-07,     4.460490035,    0.9967561258,     0.187958467]    fk: 1.57734329808       
	k: 100      xk: [   0.4980430822, 4.464922177e-07,     4.659077281,    0.9968918161,    0.1799536565]    fk: 1.47777659982       
	k: 200      xk: [   0.4979149222, 5.298291171e-07,     4.647184216,    0.9968826196,    0.1810354519]    fk: 1.47660476991       
	k: 300      xk: [   0.4965600769, 5.219539619e-06,     4.067814554,    0.9960789138,    0.1994997256]    fk: 1.45867627603       
	k: 400      xk: [   0.4959235689, 1.368770937e-05,     3.703885736,      0.99535054,    0.2089511588]    fk: 1.45655705336       

	Parameter values: [0.49587954774251503, 1.3846331125391635e-05, 3.6989275779909629, 0.99533719403117393, 0.20910907595056483]
	Function value:   1.4565459694756349
	Iterations:       500
	Function calls:   867
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4958795477, 1.384633113e-05,     3.698927578,     0.995337194,     0.209109076]    fk: 1.38701991107       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4958795477, 1.453864768e-05,     3.698927578,     0.995337194,     0.209109076]    fk: 1.38770842351       
	k: 100      xk: [   0.4957673852, 2.322608045e-05,     4.013546505,    0.9959607423,    0.2029992042]    fk: 1.38112460621       
	k: 200      xk: [   0.4977268449,  9.68053841e-05,     4.537642469,    0.9967574277,    0.1838922233]    fk: 1.37149938581       
	k: 300      xk: [   0.4980029165, 0.0001142342514,      4.62871396,     0.996859843,     0.180510992]    fk: 1.37117446925       
	k: 400      xk: [   0.4980029137, 0.0001142342439,      4.62871399,    0.9968598429,    0.1805110008]    fk: 1.37117293787       

	Parameter values: [0.4980029134919246, 0.00011423423456758072, 4.6287139883724375, 0.99685984293714003, 0.18051100404608053]
	Function value:   1.3711729377720765
	Iterations:       500
	Function calls:   908
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4980029135, 0.0001142342346,     4.628713988,    0.9968598429,     0.180511004]    fk: 1.37065760125       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4980029135, 0.0001199459463,     4.628713988,    0.9968598429,     0.180511004]    fk: 1.37066270582       
	k: 100      xk: [   0.4980029137, 0.0001199457723,     4.628713988,    0.9968598429,     0.180511003]    fk: 1.37066270581       
	k: 200      xk: [   0.4980029147, 0.0001199454081,     4.628713989,     0.996859843,     0.180511004]    fk: 1.37066270577       
	k: 300      xk: [   0.4980029149, 0.0001199452753,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37066270577       

	Parameter values: [0.49800291488825743, 0.00011994527534782591, 4.6287139883610653, 0.99685984296051022, 0.18051100404202644]
	Function value:   1.3706627057673246
	Iterations:       301
	Function calls:   650
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [   0.4980029149, 0.0001199452753,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4980029149, 0.0001259425391,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065765174       
	k: 100      xk: [   0.4980029149,  0.000125942539,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065765174       

	Parameter values: [0.49800291488811421, 0.00012594253902554179, 4.6287139883731099, 0.99685984296051733, 0.18051100404253814]
	Function value:   1.3706576517442213
	Iterations:       122
	Function calls:   384
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.4980029149,  0.000125942539,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4980029149,  0.000132239666,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760169       
	k: 100      xk: [   0.4980029149,  0.000132239666,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760169       

	Parameter values: [0.49800291488811421, 0.00013223966597681889, 4.6287139883731099, 0.99685984296051733, 0.18051100404253814]
	Function value:   1.3706576016870102
	Iterations:       117
	Function calls:   372
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [   0.4980029149,  0.000132239666,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4980029149, 0.0001388516493,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
	k: 100      xk: [   0.4980029149, 0.0001388516493,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       

	Parameter values: [0.49800291488811421, 0.00013885164927565985, 4.6287139883731099, 0.99685984296051733, 0.18051100404253814]
	Function value:   1.3706576011912681
	Iterations:       117
	Function calls:   372
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [   0.4980029149, 0.0001388516493,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
	k: 100      xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       

	Parameter values: [0.49800291488811421, 0.00014579423173944286, 4.6287139883731099, 0.99685984296051733, 0.18051100404253814]
	Function value:   1.3706576011863592
	Iterations:       117
	Function calls:   372
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
	k: 100      xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       

	Parameter values: [0.49800291488811421, 0.00014579423173944286, 4.6287139883731099, 0.99685984296051733, 0.18051100404253814]
	Function value:   1.3706576011863107
	Iterations:       117
	Function calls:   372
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
	k: 100      xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       

	Parameter values: [0.49800291488811421, 0.00014579423173944286, 4.6287139883731099, 0.99685984296051733, 0.18051100404253814]
	Function value:   1.3706576011863101
	Iterations:       117
	Function calls:   372
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 9        xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       
	k: 100      xk: [   0.4980029149, 0.0001457942317,     4.628713988,     0.996859843,     0.180511004]    fk: 1.37065760119       

	Parameter values: [0.49800291488811421, 0.00014579423173944286, 4.6287139883731099, 0.99685984296051733, 0.18051100404253814]
	Function value:   1.3706576011863101
	Iterations:       117
	Function calls:   372
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.49800291488811421, 0.00014579423173944286, 4.6287139883731099, 0.99685984296051733, 0.18051100404253814]
Function value:   1.3706576011863101
Iterations:       2125
Function calls:   5041
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.980029148881142
r2 (800.000 MHz):            0.001457942317394
dw:                          4.628713988373110
pA:                          0.996859842960517
kex:                      1805.110040425381385

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/dw.agr' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/NS 2-site star/results.bz2' for writing.

relax> model_selection(method='AIC', modsel_pipe='final', bundle=None, pipes=['No Rex', 'LM63', 'LM63 3-site', 'CR72', 'CR72 full', 'IT99', 'NS 2-site 3D', 'NS 2-site expanded', 'NS 2-site star'])
AIC model selection.


The spin cluster [':70@N'].
# Data pipe           Num_params_(k)    Num_data_sets_(n)    Chi2          Criterion     
No Rex                2                 30                   3427.90718    3431.90718    
LM63                  4                 30                   106.39336     114.39336     
LM63 3-site           6                 30                   151.92056     163.92056     
CR72                  5                 30                   18.45004      28.45004      
CR72 full             7                 30                   15.68571      29.68571      
IT99                  5                 30                   31.68772      41.68772      
NS 2-site 3D          5                 30                   18.09837      28.09837      
NS 2-site expanded    5                 30                   18.09848      28.09848      
NS 2-site star        5                 30                   18.09826      28.09826      
The model from the data pipe 'NS 2-site star' has been selected.


The spin cluster [':71@N'].
# Data pipe           Num_params_(k)    Num_data_sets_(n)    Chi2        Criterion    
No Rex                2                 15                   47.35675    51.35675     
LM63                  4                 15                   1.44240     9.44240      
LM63 3-site           6                 15                   5.73457     17.73457     
CR72                  5                 15                   1.37893     11.37893     
CR72 full             7                 15                   1.37893     15.37893     
IT99                  5                 15                   1.45010     11.45010     
NS 2-site 3D          5                 15                   1.37066     11.37066     
NS 2-site expanded    5                 15                   1.37067     11.37067     
NS 2-site star        5                 15                   1.37066     11.37066     
The model from the data pipe 'LM63' has been selected.

relax> monte_carlo.setup(number=50)

relax> monte_carlo.create_data(method='back_calc')

relax> monte_carlo.initial_values()

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)
Simulation 1
Simulation 2
Simulation 3
Simulation 4
Simulation 5
Simulation 6
Simulation 7
Simulation 8
Simulation 9
Simulation 10
Simulation 11
Simulation 12
Simulation 13
Simulation 14
Simulation 15
Simulation 16
Simulation 17
Simulation 18
Simulation 19
Simulation 20
Simulation 21
Simulation 22
Simulation 23
Simulation 24
Simulation 25
Simulation 26
Simulation 27
Simulation 28
Simulation 29
Simulation 30
Simulation 31
Simulation 32
Simulation 33
Simulation 34
Simulation 35
Simulation 36
Simulation 37
Simulation 38
Simulation 39
Simulation 40
Simulation 41
Simulation 42
Simulation 43
Simulation 44
Simulation 45
Simulation 46
Simulation 47
Simulation 48
Simulation 49
Simulation 50

relax> monte_carlo.error_analysis()

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/pB.agr' for writing.

relax> value.write(param='phi_ex', file='phi_ex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex', spin_id=None, plot_data='value', file='phi_ex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex.agr' for writing.

relax> value.write(param='phi_ex_B', file='phi_ex_B.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex_B.out' for writing.

relax> value.write(param='phi_ex_C', file='phi_ex_C.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex_C.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex_B', spin_id=None, plot_data='value', file='phi_ex_B.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex_B.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex_C', spin_id=None, plot_data='value', file='phi_ex_C.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/phi_ex_C.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> value.write(param='padw2', file='padw2.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/padw2.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='padw2', spin_id=None, plot_data='value', file='padw2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/padw2.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/dw.agr' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/tex.agr' for writing.

relax> value.write(param='kB', file='kB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kB.out' for writing.

relax> value.write(param='kC', file='kC.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kC.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kB', spin_id=None, plot_data='value', file='kB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kB.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='kC', spin_id=None, plot_data='value', file='kC.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/kC.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final/results.bz2' for writing.

relax> state.save(state='final_state', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/final_state.bz2' for writing.

