


                                  relax repository checkout r20878
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'r2eff_calc.py'
----------------------------------------------------------------------------------------------------
# Script for generating a save file of the R2eff fitted model.

# Python module imports.
from os import sep

# relax module imports.
from auto_analyses.relax_disp import Relax_disp
from data_store import Relax_data_store; ds = Relax_data_store()
from status import Status; status = Status()


# Analysis variables.
#####################

# The dispersion models.
MODELS = ['R2eff']

# The grid search size (the number of increments per dimension).
GRID_INC = 10

# The number of Monte Carlo simulations to be used for error analysis at the end of the analysis.
MC_NUM = 500


# Set up the data pipe.
#######################

# Create the data pipe.
pipe_name = 'base pipe'
pipe_bundle = 'relax_disp'
pipe.create(pipe_name=pipe_name, bundle=pipe_bundle, pipe_type='relax_disp')

# The path to the data files.
data_path = status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'r1rho_on_res_m61'

# Create the sequence data.
spin.create(res_name='Trp', res_num=1, spin_name='N')
spin.create(res_name='Trp', res_num=2, spin_name='N')

# Set the isotope information.
spin.isotope(isotope='15N')

# The spectral data - spectrum ID, peak lists, offset frequency (Hz), relaxation time period (s), baseplane RMSD estimate.
data = []
times = [0.15]
ncyc = [9]
spin_lock = [1000, 1500, 2000, 2500, 3000, 3500, 4000, 4500, 5000, 5500, 6000]
for spin_lock_index in range(len(spin_lock)):
    for time_index in range(len(times)):
        data.append(["nu_%s_ncyc%s" % (spin_lock[spin_lock_index], ncyc[time_index]), "nu_%s_ncyc%s.list" % (spin_lock[spin_lock_index], ncyc[time_index]), spin_lock[spin_lock_index], times[time_index], 200000.0])

# Load the reference spectrum.
spectrum.read_intensities(file="nu_%s_ncyc1.list" % spin_lock[0], dir=data_path, spectrum_id='ref', int_method='height', dim=1)
spectrum.baseplane_rmsd(spectrum_id='ref', error=data[0][4])

# Set the relaxation dispersion experiment type.
relax_disp.exp_type(spectrum_id='ref', exp_type='r1rho fixed')

# Set as the reference.
relax_disp.spin_lock_field(spectrum_id='ref', field=None)
relax_disp.spin_lock_offset(spectrum_id='ref', offset=115.0)

# Set the spectrometer frequency.
spectrometer.frequency(id='ref', frq=800, units='MHz')

# Load the R1 data.
relax_data.read(ri_id='R1', ri_type='R1', frq=800*1e6, file='R1.out', dir=data_path, mol_name_col=1, res_num_col=2, res_name_col=3, spin_num_col=4, spin_name_col=5, data_col=6, error_col=7)

# Loop over the spectral data, loading it and setting the metadata.
for i in range(len(data)):
    # Load the peak intensities and set the errors.
    spectrum.read_intensities(file=data[i][1], dir=data_path, spectrum_id=data[i][0], int_method='height')
    spectrum.baseplane_rmsd(spectrum_id=data[i][0], error=data[i][4])

    # Set the relaxation dispersion experiment type.
    relax_disp.exp_type(spectrum_id=data[i][0], exp_type='r1rho fixed')

    # Set the relaxation dispersion spin-lock field strength (nu1).
    relax_disp.spin_lock_field(spectrum_id=data[i][0], field=data[i][2])

    # Set the spin-lock offset.
    relax_disp.spin_lock_offset(spectrum_id=data[i][0], offset=115.0)

    # Set the relaxation times.
    relax_disp.relax_time(spectrum_id=data[i][0], time=data[i][3])

    # Set the spectrometer frequency.
    spectrometer.frequency(id=data[i][0], frq=800, units='MHz')

# Read the chemical shift data.
chemical_shift.read(file="nu_%s_ncyc1.list" % spin_lock[0], dir=data_path)



# Auto-analysis execution.
##########################

# Do not change!
Relax_disp(pipe_name=pipe_name, pipe_bundle=pipe_bundle, results_dir='.', models=MODELS, grid_inc=GRID_INC, mc_sim_num=MC_NUM)

# Save the program state.
state.save('r2eff_values', force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='base pipe', pipe_type='relax_disp', bundle='relax_disp')

relax> spin.create(spin_name='N', spin_num=None, res_name='Trp', res_num=1, mol_name=None)

relax> spin.create(spin_name='N', spin_num=None, res_name='Trp', res_num=2, mol_name=None)

relax> spin.isotope(isotope='15N', spin_id=None, force=False)

relax> spectrum.read_intensities(file='nu_1000_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='ref', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='ref', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='ref', exp_type='r1rho fixed')
Setting the 'ref' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='ref', field=None)
Setting the 'ref' spectrum as the reference.

relax> relax_disp.spin_lock_offset(spectrum_id='ref', offset=115.0)
Setting the 'ref' spectrum spin-lock offset to 115.0 ppm.

relax> spectrometer.frequency(id='ref', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_data.read(ri_id='R1', ri_type='R1', frq=800000000.0, file='R1.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spin_id_col=None, mol_name_col=1, res_num_col=2, res_name_col=3, spin_num_col=4, spin_name_col=5, data_col=6, error_col=7, sep=None, spin_id=None)
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/R1.out' for reading.
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

The following 800.0 MHz R1 relaxation data with the ID 'R1' has been loaded into the relax data store:

# Spin_ID    Value    Error    
:1@N         1.0      0.1      
:2@N         1.1      0.1      

relax> spectrum.read_intensities(file='nu_1000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         58295094.0    
:2@N         243441.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_1000_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc9', field=1000)
Setting the 'nu_1000_ncyc9' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc9', offset=115.0)
Setting the 'nu_1000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc9', time=0.15)
Setting the 'nu_1000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_1000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         65142324.0    
:2@N         379594.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_1500_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc9', field=1500)
Setting the 'nu_1500_ncyc9' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc9', offset=115.0)
Setting the 'nu_1500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc9', time=0.15)
Setting the 'nu_1500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_1500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         67773960.0    
:2@N         444752.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_2000_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc9', field=2000)
Setting the 'nu_2000_ncyc9' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc9', offset=115.0)
Setting the 'nu_2000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc9', time=0.15)
Setting the 'nu_2000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_2000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         69036848.0    
:2@N         478840.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_2500_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc9', field=2500)
Setting the 'nu_2500_ncyc9' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc9', offset=115.0)
Setting the 'nu_2500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc9', time=0.15)
Setting the 'nu_2500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_2500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         69735151.0    
:2@N         498510.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_3000_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc9', field=3000)
Setting the 'nu_3000_ncyc9' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc9', offset=115.0)
Setting the 'nu_3000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc9', time=0.15)
Setting the 'nu_3000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_3000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70160457.0    
:2@N         510783.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_3500_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc9', field=3500)
Setting the 'nu_3500_ncyc9' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc9', offset=115.0)
Setting the 'nu_3500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc9', time=0.15)
Setting the 'nu_3500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_3500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70438226.0    
:2@N         518920.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_4000_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc9', field=4000)
Setting the 'nu_4000_ncyc9' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc9', offset=115.0)
Setting the 'nu_4000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc9', time=0.15)
Setting the 'nu_4000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_4000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70629455.0    
:2@N         524578.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_4500_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc9', field=4500)
Setting the 'nu_4500_ncyc9' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc9', offset=115.0)
Setting the 'nu_4500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc9', time=0.15)
Setting the 'nu_4500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_4500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70766637.0    
:2@N         528666.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_5000_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc9', field=5000)
Setting the 'nu_5000_ncyc9' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc9', offset=115.0)
Setting the 'nu_5000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc9', time=0.15)
Setting the 'nu_5000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_5000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70868349.0    
:2@N         531712.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_5500_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc9', field=5500)
Setting the 'nu_5500_ncyc9' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc9', offset=115.0)
Setting the 'nu_5500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc9', time=0.15)
Setting the 'nu_5500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_5500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70945831.0    
:2@N         534041.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc9', exp_type='r1rho fixed')
Setting the 'nu_6000_ncyc9' spectrum tothe fixed relaxation time period R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc9', field=6000)
Setting the 'nu_6000_ncyc9' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc9', offset=115.0)
Setting the 'nu_6000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc9', time=0.15)
Setting the 'nu_6000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_6000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> chemical_shift.read(file='nu_1000_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.
RelaxWarning: Cannot find the spin :1@HN within the sequence.
RelaxWarning: Cannot find the spin :2@HN within the sequence.

The following chemical shifts have been loaded into the relax data store:

# Spin_ID    Chemical shift    
:1@N         115.0             
:2@N         115.0             




=======================================
= Relaxation dispersion auto-analysis =
=======================================


relax> spectrum.error_analysis(subset=['ref', 'nu_1000_ncyc9', 'nu_1500_ncyc9', 'nu_2000_ncyc9', 'nu_2500_ncyc9', 'nu_3000_ncyc9', 'nu_3500_ncyc9', 'nu_4000_ncyc9', 'nu_4500_ncyc9', 'nu_5000_ncyc9', 'nu_5500_ncyc9', 'nu_6000_ncyc9'])
Intensity measure:  Peak heights.
Replicated spectra:  No.
Spectra ID subset ignored.



---------------------
- The 'R2eff' model -
---------------------

Detected the presence of results files for the 'R2eff' model - loading these instead of performing optimisation for a second time.

relax> pipe.create(pipe_name='R2eff', pipe_type='relax_disp', bundle='relax_disp')

relax> pipe.switch(pipe_name='R2eff')

relax> results.read(file='results', dir='./R2eff')
Opening the file './R2eff/results.bz2' for reading.
RelaxWarning: Model selection in the dispersion auto-analysis has been skipped as only 0 models have been optimised.

relax> state.save(state='final_state', dir='.', compress_type=1, force=True)
Opening the file './final_state.bz2' for writing.

relax> state.save(state='r2eff_values', dir=None, compress_type=1, force=True)
Opening the file 'r2eff_values.bz2' for writing.

