


                                     relax repository checkout

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2011 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'generate_distribution.py'
----------------------------------------------------------------------------------------------------
# Script for generating the distribution of PDB structures.

# Python module imports.
from numpy import array, cross, dot, float64, zeros
from numpy.linalg import norm

# relax module imports.
from maths_fns.rotation_matrix import axis_angle_to_R


# The number of structures.
INC = 5
N = 360 / INC

# Create a data pipe.
pipe.create('generate', 'N-state')

# The axis for the rotations (the pivot point to CoM axis).
pivot = array([ 37.254, 0.5, 16.7465])
com = array([ 26.83678091, -12.37906417,  28.34154128])
axis = pivot - com
axis = axis / norm(axis)

# Init a rotation matrix.
R = zeros((3, 3), float64)

# Tilt the rotation axis by 30 degrees.
rot_axis = cross(axis, array([0, 0, 1]))
axis_angle_to_R(rot_axis, 30.0 * 2.0 * pi / 360.0, R)
print("Tilt axis: %s" % repr(rot_axis))
print("CoM-pivot axis: %s" % repr(axis))
axis = dot(R, axis)
print("Rotation axis: %s" % repr(axis))

# Load N copies of the original C-domain, rotating them by 1 degree about the rotation axis.
for i in range(N):
    # Load the PDB as a new model.
    structure.read_pdb('1J7P_1st_NH.pdb', dir='..', set_model_num=i)

    # The rotation angle.
    angle = i * INC / 360.0 * 2.0 * pi
    print("Rotation angle: %s" % angle)

    # The rotation matrix.
    axis_angle_to_R(axis, angle, R)
    print("Rotation matrix:\n%s\n" % R)

    # Rotate.
    structure.rotate(R=R, origin=pivot, model=i)

# Save the PDB file.
structure.write_pdb('distribution.pdb', compress_type=2, force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='generate', pipe_type='N-state')
Tilt axis: array([ 0.63695822, -0.51520307,  0.        ])
CoM-pivot axis: array([ 0.51520307,  0.63695822, -0.57345447])
Rotation axis: array([ 0.59390169,  0.73425527, -0.16105115])

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=0, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model None (from the original molecule number 1 of model None)
Rotation angle: 0.0
Rotation matrix:
[[ 1.  0.  0.]
 [ 0.  1. -0.]
 [-0.  0.  1.]]


relax> structure.rotate(R=array([[ 1.,  0.,  0.],
       [ 0.,  1., -0.],
       [-0.,  0.,  1.]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=0)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=1, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 1 (from the original molecule number 1 of model None)
Rotation angle: 0.0872664625997
Rotation matrix:
[[ 0.9975369   0.01569593  0.06363059]
 [-0.01237713  0.99824625 -0.05221193]
 [-0.06435853  0.05131196  0.9962934 ]]


relax> structure.rotate(R=array([[ 0.9975369 ,  0.01569593,  0.06363059],
       [-0.01237713,  0.99824625, -0.05221193],
       [-0.06435853,  0.05131196,  0.9962934 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=1)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=2, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 2 (from the original molecule number 1 of model None)
Rotation angle: 0.174532925199
Rotation matrix:
[[ 0.99016635  0.0345912   0.12604897]
 [-0.02134127  0.99299836 -0.10492647]
 [-0.12895521  0.10133342  0.9852018 ]]


relax> structure.rotate(R=array([[ 0.99016635,  0.0345912 ,  0.12604897],
       [-0.02134127,  0.99299836, -0.10492647],
       [-0.12895521,  0.10133342,  0.9852018 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=2)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=3, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 3 (from the original molecule number 1 of model None)
Rotation angle: 0.261799387799
Rotation matrix:
[[ 0.97794444  0.05654201  0.1867801 ]
 [-0.02682419  0.98429626 -0.15774243]
 [-0.19329839  0.14968371  0.96680962]]


relax> structure.rotate(R=array([[ 0.97794444,  0.05654201,  0.1867801 ],
       [-0.02682419,  0.98429626, -0.15774243],
       [-0.19329839,  0.14968371,  0.96680962]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=3)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=4, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 4 (from the original molecule number 1 of model None)
Rotation angle: 0.349065850399
Rotation matrix:
[[ 0.96096419  0.0813813   0.24536178]
 [-0.02878417  0.97220619 -0.21025785]
 [-0.25689841  0.19599483  0.94125684]]


relax> structure.rotate(R=array([[ 0.96096419,  0.0813813 ,  0.24536178],
       [-0.02878417,  0.97220619, -0.21025785],
       [-0.25689841,  0.19599483,  0.94125684]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=4)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=5, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 5 (from the original molecule number 1 of model None)
Rotation angle: 0.436332312999
Rotation matrix:
[[ 0.93935483  0.10892003  0.30134816]
 [-0.02720628  0.95682014 -0.26207305]
 [-0.31927121  0.23991435  0.90873793]]


relax> structure.rotate(R=array([[ 0.93935483,  0.10892003,  0.30134816],
       [-0.02720628,  0.95682014, -0.26207305],
       [-0.31927121,  0.23991435,  0.90873793]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=5)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=6, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 6 (from the original molecule number 1 of model None)
Rotation angle: 0.523598775598
Rotation matrix:
[[ 0.91328082  0.13894861  0.35431316]
 [-0.02210254  0.93825524 -0.3127937 ]
 [-0.37994211  0.28110799  0.86950037]]


relax> structure.rotate(R=array([[ 0.91328082,  0.13894861,  0.35431316],
       [-0.02210254,  0.93825524, -0.3127937 ],
       [-0.37994211,  0.28110799,  0.86950037]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=6)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=7, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 7 (from the original molecule number 1 of model None)
Rotation angle: 0.610865238198
Rotation matrix:
[[ 0.88294059  0.1712385   0.40385368]
 [-0.01351179  0.91665275 -0.36203377]
 [-0.43844937  0.31926227  0.82384278]]


relax> structure.rotate(R=array([[ 0.88294059,  0.1712385 ,  0.40385368],
       [-0.01351179,  0.91665275, -0.36203377],
       [-0.43844937,  0.31926227,  0.82384278]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=7)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=8, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 8 (from the original molecule number 1 of model None)
Rotation angle: 0.698131700798
Rotation matrix:
[[ 0.84856506  0.20554396  0.44959268]
 [-0.00149941  0.89217709 -0.40941852]
 [-0.4943477   0.35408678  0.77211266]]


relax> structure.rotate(R=array([[ 0.84856506,  0.20554396,  0.44959268],
       [-0.00149941,  0.89217709, -0.40941852],
       [-0.4943477 ,  0.35408678,  0.77211266]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=8)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=9, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 9 (from the original molecule number 1 of model None)
Rotation angle: 0.785398163397
Rotation matrix:
[[ 0.81041585  0.2416039   0.49118207]
 [ 0.01384318  0.86501454 -0.45458731]
 [-0.54721169  0.38531651  0.71470369]]


relax> structure.rotate(R=array([[ 0.81041585,  0.2416039 ,  0.49118207],
       [ 0.01384318,  0.86501454, -0.45458731],
       [-0.54721169,  0.38531651,  0.71470369]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=9)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=10, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 10 (from the original molecule number 1 of model None)
Rotation angle: 0.872664625997
Rotation matrix:
[[ 0.76878329  0.27914389  0.52830532]
 [ 0.03239922  0.83537181 -0.4971964 ]
 [-0.59663902  0.41271378  0.6520528 ]]


relax> structure.rotate(R=array([[ 0.76878329,  0.27914389,  0.52830532],
       [ 0.03239922,  0.83537181, -0.4971964 ],
       [-0.59663902,  0.41271378,  0.6520528 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=10)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=11, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 11 (from the original molecule number 1 of model None)
Rotation angle: 0.959931088597
Rotation matrix:
[[ 0.72398422  0.31787822  0.56067991]
 [ 0.05402747  0.80347451 -0.5369215 ]
 [-0.6422535   0.43607007  0.58463679]]


relax> structure.rotate(R=array([[ 0.72398422,  0.31787822,  0.56067991],
       [ 0.05402747,  0.80347451, -0.5369215 ],
       [-0.6422535 ,  0.43607007,  0.58463679]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=11)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=12, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 12 (from the original molecule number 1 of model None)
Rotation angle: 1.0471975512
Rotation matrix:
[[ 0.67635961  0.35751211  0.58805944]
 [ 0.07856334  0.7695654  -0.57346028]
 [-0.68370799  0.45520763  0.51296874]]


relax> structure.rotate(R=array([[ 0.67635961,  0.35751211,  0.58805944],
       [ 0.07856334,  0.7695654 , -0.57346028],
       [-0.68370799,  0.45520763,  0.51296874]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=12)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=13, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 13 (from the original molecule number 1 of model None)
Rotation angle: 1.1344640138
Rotation matrix:
[[ 0.6262719   0.39774391  0.61023554]
 [ 0.10582009  0.73390254 -0.60653465]
 [-0.72068699  0.46998081  0.43759408]]


relax> structure.rotate(R=array([[ 0.6262719 ,  0.39774391,  0.61023554],
       [ 0.10582009,  0.73390254, -0.60653465],
       [-0.72068699,  0.46998081,  0.43759408]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=13)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=14, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 14 (from the original molecule number 1 of model None)
Rotation angle: 1.2217304764
Rotation matrix:
[[ 0.57410229  0.43826744  0.62703944]
 [ 0.13559028  0.69675735 -0.6358929 ]
 [-0.75290908  0.48027717  0.35908648]]


relax> structure.rotate(R=array([[ 0.57410229,  0.43826744,  0.62703944],
       [ 0.13559028,  0.69675735, -0.6358929 ],
       [-0.75290908,  0.48027717,  0.35908648]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=14)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=15, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 15 (from the original molecule number 1 of model None)
Rotation angle: 1.308996939
Rotation matrix:
[[ 0.52024781  0.47877428  0.63834324]
 [ 0.16764735  0.65841253 -0.6613116 ]
 [-0.78012901  0.48601837  0.27804341]]


relax> structure.rotate(R=array([[ 0.52024781,  0.47877428,  0.63834324],
       [ 0.16764735,  0.65841253, -0.6613116 ],
       [-0.78012901,  0.48601837,  0.27804341]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=15)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=16, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 16 (from the original molecule number 1 of model None)
Rotation angle: 1.3962634016
Rotation matrix:
[[ 0.46511835  0.51895616  0.64406093]
 [ 0.20174732  0.6191599  -0.68259729]
 [-0.80213964  0.4871607   0.19508166]]


relax> structure.rotate(R=array([[ 0.46511835,  0.51895616,  0.64406093],
       [ 0.20174732,  0.6191599 , -0.68259729],
       [-0.80213964,  0.4871607 ,  0.19508166]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=16)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=17, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 17 (from the original molecule number 1 of model None)
Rotation angle: 1.4835298642
Rotation matrix:
[[ 0.40913346  0.55850727  0.64414898]
 [ 0.23763067  0.5792982  -0.69958797]
 [-0.81877344  0.48369546  0.11083262]]


relax> structure.rotate(R=array([[ 0.40913346,  0.55850727,  0.64414898],
       [ 0.23763067,  0.5792982 , -0.69958797],
       [-0.81877344,  0.48369546,  0.11083262]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=17)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=18, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 18 (from the original molecule number 1 of model None)
Rotation angle: 1.57079632679
Rotation matrix:
[[ 0.35271922  0.5971266   0.63860672]
 [ 0.2750243   0.5391308  -0.71215435]
 [-0.82990382  0.47564904  0.02593747]]


relax> structure.rotate(R=array([[ 0.35271922,  0.5971266 ,  0.63860672],
       [ 0.2750243 ,  0.5391308 , -0.71215435],
       [-0.82990382,  0.47564904,  0.02593747]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=18)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=19, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 19 (from the original molecule number 1 of model None)
Rotation angle: 1.65806278939
Rotation matrix:
[[ 0.29630498  0.63452023  0.62747634]
 [ 0.31364363  0.4989634  -0.72020077]
 [-0.83544608  0.46308267 -0.05895767]]


relax> structure.rotate(R=array([[ 0.29630498,  0.63452023,  0.62747634],
       [ 0.31364363,  0.4989634 , -0.72020077],
       [-0.83544608,  0.46308267, -0.05895767]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=19)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=20, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 20 (from the original molecule number 1 of model None)
Rotation angle: 1.74532925199
Rotation matrix:
[[ 0.24032009  0.67040357  0.61084254]
 [ 0.35319473  0.4591017  -0.723666  ]
 [-0.83535803  0.44609198 -0.14320671]]


relax> structure.rotate(R=array([[ 0.24032009,  0.67040357,  0.61084254],
       [ 0.35319473,  0.4591017 , -0.723666  ],
       [-0.83535803,  0.44609198, -0.14320671]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=20)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=21, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 21 (from the original molecule number 1 of model None)
Rotation angle: 1.83259571459
Rotation matrix:
[[ 0.18519063  0.70450354  0.58883191]
 [ 0.39337661  0.41984907 -0.72252368]
 [-0.82964034  0.42480629 -0.22616846]]


relax> structure.rotate(R=array([[ 0.18519063,  0.70450354,  0.58883191],
       [ 0.39337661,  0.41984907, -0.72252368],
       [-0.82964034,  0.42480629, -0.22616846]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=21)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=22, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 22 (from the original molecule number 1 of model None)
Rotation angle: 1.91986217719
Rotation matrix:
[[ 0.13133616  0.73656061  0.56161198]
 [ 0.43388346  0.38150425 -0.71678248]
 [-0.81833654  0.39938759 -0.30721153]]


relax> structure.rotate(R=array([[ 0.13133616,  0.73656061,  0.56161198],
       [ 0.43388346,  0.38150425, -0.71678248],
       [-0.81833654,  0.39938759, -0.30721153]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=22)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=23, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 23 (from the original molecule number 1 of model None)
Rotation angle: 2.00712863979
Rotation matrix:
[[ 0.07916654  0.7663308   0.52938989]
 [ 0.47440699  0.34435906 -0.70648611]
 [-0.80153264  0.37002934 -0.38571914]]


relax> structure.rotate(R=array([[ 0.07916654,  0.7663308 ,  0.52938989],
       [ 0.47440699,  0.34435906, -0.70648611],
       [-0.80153264,  0.37002934, -0.38571914]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=23)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=24, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 24 (from the original molecule number 1 of model None)
Rotation angle: 2.09439510239
Rotation matrix:
[[ 0.02907883  0.79358756  0.49241089]
 [ 0.51463879  0.3086962  -0.69171293]
 [-0.77935654  0.33695497 -0.46109379]]


relax> structure.rotate(R=array([[ 0.02907883,  0.79358756,  0.49241089],
       [ 0.51463879,  0.3086962 , -0.69171293],
       [-0.77935654,  0.33695497, -0.46109379]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=24)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=25, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 25 (from the original molecule number 1 of model None)
Rotation angle: 2.18166156499
Rotation matrix:
[[-0.01854578  0.81812343  0.4509564 ]
 [ 0.55427267  0.27478709 -0.67257538]
 [-0.75197701  0.3004162  -0.53276184]]


relax> structure.rotate(R=array([[-0.01854578,  0.81812343,  0.4509564 ],
       [ 0.55427267,  0.27478709, -0.67257538],
       [-0.75197701,  0.3004162 , -0.53276184]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=25)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=26, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 26 (from the original molecule number 1 of model None)
Rotation angle: 2.26892802759
Rotation matrix:
[[-0.06334484  0.83975168  0.40534192]
 [ 0.593007    0.24288979 -0.64921909]
 [-0.71960242  0.2606911  -0.60017785]]


relax> structure.rotate(R=array([[-0.06334484,  0.83975168,  0.40534192],
       [ 0.593007  ,  0.24288979, -0.64921909],
       [-0.71960242,  0.2606911 , -0.60017785]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=26)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=27, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 27 (from the original molecule number 1 of model None)
Rotation angle: 2.35619449019
Rotation matrix:
[[-0.10497741  0.85830771  0.35591459]
 [ 0.63054699  0.21324706 -0.62182182]
 [-0.68247917  0.21808201 -0.66282875]]


relax> structure.rotate(R=array([[-0.10497741,  0.85830771,  0.35591459],
       [ 0.63054699,  0.21324706, -0.62182182],
       [-0.68247917,  0.21808201, -0.66282875]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=27)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=28, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 28 (from the original molecule number 1 of model None)
Rotation angle: 2.44346095279
Rotation matrix:
[[-0.14312662  0.8736503   0.3030506 ]
 [ 0.66660694  0.18608451 -0.59059209]
 [-0.64088978  0.17291321 -0.72023771]]


relax> structure.rotate(R=array([[-0.14312662,  0.8736503 ,  0.3030506 ],
       [ 0.66660694,  0.18608451, -0.59059209],
       [-0.64088978,  0.17291321, -0.72023771]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=28)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=29, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 29 (from the original molecule number 1 of model None)
Rotation angle: 2.53072741539
Rotation matrix:
[[-0.17750215  0.88566269  0.24715227]
 [ 0.7009124   0.16160885 -0.55576757]
 [-0.59515078  0.12552846 -0.77196784]]


relax> structure.rotate(R=array([[-0.17750215,  0.88566269,  0.24715227],
       [ 0.7009124 ,  0.16160885, -0.55576757],
       [-0.59515078,  0.12552846, -0.77196784]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=29)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=30, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 30 (from the original molecule number 1 of model None)
Rotation angle: 2.61799387799
Rotation matrix:
[[-0.20784238  0.89425344  0.18864501]
 [ 0.73320229  0.14000637 -0.5176133 ]
 [-0.54561026  0.07628839 -0.81762542]]


relax> structure.rotate(R=array([[-0.20784238,  0.89425344,  0.18864501],
       [ 0.73320229,  0.14000637, -0.5176133 ],
       [-0.54561026,  0.07628839, -0.81762542]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=30)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=31, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 31 (from the original molecule number 1 of model None)
Rotation angle: 2.70526034059
Rotation matrix:
[[-0.23391639  0.89935718  0.12797411]
 [ 0.76323086  0.12144146 -0.47641966]
 [-0.49264526  0.02556775 -0.85686298]]


relax> structure.rotate(R=array([[-0.23391639,  0.89935718,  0.12797411],
       [ 0.76323086,  0.12144146, -0.47641966],
       [-0.49264526,  0.02556775, -0.85686298]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=31)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=32, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 32 (from the original molecule number 1 of model None)
Rotation angle: 2.79252680319
Rotation matrix:
[[-0.25552575  0.90093506  0.06560131]
 [ 0.79076959  0.10605542 -0.43250014]
 [-0.43665888 -0.02624746 -0.8893819 ]]


relax> structure.rotate(R=array([[-0.25552575,  0.90093506,  0.06560131],
       [ 0.79076959,  0.10605542, -0.43250014],
       [-0.43665888, -0.02624746, -0.8893819 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=32)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=33, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 33 (from the original molecule number 1 of model None)
Rotation angle: 2.87979326579
Rotation matrix:
[[-0.272506    0.89897509  0.00200129]
 [ 0.81560888  0.09396534 -0.38618902]
 [-0.3780772  -0.07876288 -0.91493468]]


relax> structure.rotate(R=array([[-0.272506  ,  0.89897509,  0.00200129],
       [ 0.81560888,  0.09396534, -0.38618902],
       [-0.3780772 , -0.07876288, -0.91493468]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=33)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=34, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 34 (from the original molecule number 1 of model None)
Rotation angle: 2.96705972839
Rotation matrix:
[[-0.28472791  0.89349217 -0.06234189]
 [ 0.83755969  0.08526324 -0.33783873]
 [-0.31734607 -0.13157884 -0.93332686]]


relax> structure.rotate(R=array([[-0.28472791,  0.89349217, -0.06234189],
       [ 0.83755969,  0.08526324, -0.33783873],
       [-0.31734607, -0.13157884, -0.93332686]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=34)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=35, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 35 (from the original molecule number 1 of model None)
Rotation angle: 3.05432619099
Rotation matrix:
[[-0.29209846  0.88452803 -0.12693856]
 [ 0.85645496  0.08001535 -0.28781726]
 [-0.25492769 -0.18429338 -0.94441845]]


relax> structure.rotate(R=array([[-0.29209846,  0.88452803, -0.12693856],
       [ 0.85645496,  0.08001535, -0.28781726],
       [-0.25492769, -0.18429338, -0.94441845]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=35)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=36, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 36 (from the original molecule number 1 of model None)
Rotation angle: 3.14159265359
Rotation matrix:
[[-0.29456156  0.87215089 -0.1912971 ]
 [ 0.87215089  0.0782616  -0.23650531]
 [-0.1912971  -0.23650531 -0.94812506]]


relax> structure.rotate(R=array([[-0.29456156,  0.87215089, -0.1912971 ],
       [ 0.87215089,  0.0782616 , -0.23650531],
       [-0.1912971 , -0.23650531, -0.94812506]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=36)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=37, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 37 (from the original molecule number 1 of model None)
Rotation angle: 3.22885911619
Rotation matrix:
[[-0.29209846  0.85645496 -0.25492769]
 [ 0.88452803  0.08001535 -0.18429338]
 [-0.12693856 -0.28781726 -0.94441845]]


relax> structure.rotate(R=array([[-0.29209846,  0.85645496, -0.25492769],
       [ 0.88452803,  0.08001535, -0.18429338],
       [-0.12693856, -0.28781726, -0.94441845]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=37)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=38, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 38 (from the original molecule number 1 of model None)
Rotation angle: 3.31612557879
Rotation matrix:
[[-0.28472791  0.83755969 -0.31734607]
 [ 0.89349217  0.08526324 -0.13157884]
 [-0.06234189 -0.33783873 -0.93332686]]


relax> structure.rotate(R=array([[-0.28472791,  0.83755969, -0.31734607],
       [ 0.89349217,  0.08526324, -0.13157884],
       [-0.06234189, -0.33783873, -0.93332686]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=38)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=39, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 39 (from the original molecule number 1 of model None)
Rotation angle: 3.40339204139
Rotation matrix:
[[-0.272506    0.81560888 -0.3780772 ]
 [ 0.89897509  0.09396534 -0.07876288]
 [ 0.00200129 -0.38618902 -0.91493468]]


relax> structure.rotate(R=array([[-0.272506  ,  0.81560888, -0.3780772 ],
       [ 0.89897509,  0.09396534, -0.07876288],
       [ 0.00200129, -0.38618902, -0.91493468]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=39)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=40, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 40 (from the original molecule number 1 of model None)
Rotation angle: 3.49065850399
Rotation matrix:
[[-0.25552575  0.79076959 -0.43665888]
 [ 0.90093506  0.10605542 -0.02624746]
 [ 0.06560131 -0.43250014 -0.8893819 ]]


relax> structure.rotate(R=array([[-0.25552575,  0.79076959, -0.43665888],
       [ 0.90093506,  0.10605542, -0.02624746],
       [ 0.06560131, -0.43250014, -0.8893819 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=40)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=41, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 41 (from the original molecule number 1 of model None)
Rotation angle: 3.57792496659
Rotation matrix:
[[-0.23391639  0.76323086 -0.49264526]
 [ 0.89935718  0.12144146  0.02556775]
 [ 0.12797411 -0.47641966 -0.85686298]]


relax> structure.rotate(R=array([[-0.23391639,  0.76323086, -0.49264526],
       [ 0.89935718,  0.12144146,  0.02556775],
       [ 0.12797411, -0.47641966, -0.85686298]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=41)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=42, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 42 (from the original molecule number 1 of model None)
Rotation angle: 3.66519142919
Rotation matrix:
[[-0.20784238  0.73320229 -0.54561026]
 [ 0.89425344  0.14000637  0.07628839]
 [ 0.18864501 -0.5176133  -0.81762542]]


relax> structure.rotate(R=array([[-0.20784238,  0.73320229, -0.54561026],
       [ 0.89425344,  0.14000637,  0.07628839],
       [ 0.18864501, -0.5176133 , -0.81762542]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=42)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=43, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 43 (from the original molecule number 1 of model None)
Rotation angle: 3.75245789179
Rotation matrix:
[[-0.17750215  0.7009124  -0.59515078]
 [ 0.88566269  0.16160885  0.12552846]
 [ 0.24715227 -0.55576757 -0.77196784]]


relax> structure.rotate(R=array([[-0.17750215,  0.7009124 , -0.59515078],
       [ 0.88566269,  0.16160885,  0.12552846],
       [ 0.24715227, -0.55576757, -0.77196784]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=43)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=44, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 44 (from the original molecule number 1 of model None)
Rotation angle: 3.83972435439
Rotation matrix:
[[-0.14312662  0.66660694 -0.64088978]
 [ 0.8736503   0.18608451  0.17291321]
 [ 0.3030506  -0.59059209 -0.72023771]]


relax> structure.rotate(R=array([[-0.14312662,  0.66660694, -0.64088978],
       [ 0.8736503 ,  0.18608451,  0.17291321],
       [ 0.3030506 , -0.59059209, -0.72023771]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=44)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=45, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 45 (from the original molecule number 1 of model None)
Rotation angle: 3.92699081699
Rotation matrix:
[[-0.10497741  0.63054699 -0.68247917]
 [ 0.85830771  0.21324706  0.21808201]
 [ 0.35591459 -0.62182182 -0.66282875]]


relax> structure.rotate(R=array([[-0.10497741,  0.63054699, -0.68247917],
       [ 0.85830771,  0.21324706,  0.21808201],
       [ 0.35591459, -0.62182182, -0.66282875]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=45)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=46, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 46 (from the original molecule number 1 of model None)
Rotation angle: 4.01425727959
Rotation matrix:
[[-0.06334484  0.593007   -0.71960242]
 [ 0.83975168  0.24288979  0.2606911 ]
 [ 0.40534192 -0.64921909 -0.60017785]]


relax> structure.rotate(R=array([[-0.06334484,  0.593007  , -0.71960242],
       [ 0.83975168,  0.24288979,  0.2606911 ],
       [ 0.40534192, -0.64921909, -0.60017785]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=46)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=47, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 47 (from the original molecule number 1 of model None)
Rotation angle: 4.10152374219
Rotation matrix:
[[-0.01854578  0.55427267 -0.75197701]
 [ 0.81812343  0.27478709  0.3004162 ]
 [ 0.4509564  -0.67257538 -0.53276184]]


relax> structure.rotate(R=array([[-0.01854578,  0.55427267, -0.75197701],
       [ 0.81812343,  0.27478709,  0.3004162 ],
       [ 0.4509564 , -0.67257538, -0.53276184]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=47)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=48, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 48 (from the original molecule number 1 of model None)
Rotation angle: 4.18879020479
Rotation matrix:
[[ 0.02907883  0.51463879 -0.77935654]
 [ 0.79358756  0.3086962   0.33695497]
 [ 0.49241089 -0.69171293 -0.46109379]]


relax> structure.rotate(R=array([[ 0.02907883,  0.51463879, -0.77935654],
       [ 0.79358756,  0.3086962 ,  0.33695497],
       [ 0.49241089, -0.69171293, -0.46109379]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=48)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=49, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 49 (from the original molecule number 1 of model None)
Rotation angle: 4.27605666739
Rotation matrix:
[[ 0.07916654  0.47440699 -0.80153264]
 [ 0.7663308   0.34435906  0.37002934]
 [ 0.52938989 -0.70648611 -0.38571914]]


relax> structure.rotate(R=array([[ 0.07916654,  0.47440699, -0.80153264],
       [ 0.7663308 ,  0.34435906,  0.37002934],
       [ 0.52938989, -0.70648611, -0.38571914]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=49)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=50, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 50 (from the original molecule number 1 of model None)
Rotation angle: 4.36332312999
Rotation matrix:
[[ 0.13133616  0.43388346 -0.81833654]
 [ 0.73656061  0.38150425  0.39938759]
 [ 0.56161198 -0.71678248 -0.30721153]]


relax> structure.rotate(R=array([[ 0.13133616,  0.43388346, -0.81833654],
       [ 0.73656061,  0.38150425,  0.39938759],
       [ 0.56161198, -0.71678248, -0.30721153]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=50)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=51, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 51 (from the original molecule number 1 of model None)
Rotation angle: 4.45058959259
Rotation matrix:
[[ 0.18519063  0.39337661 -0.82964034]
 [ 0.70450354  0.41984907  0.42480629]
 [ 0.58883191 -0.72252368 -0.22616846]]


relax> structure.rotate(R=array([[ 0.18519063,  0.39337661, -0.82964034],
       [ 0.70450354,  0.41984907,  0.42480629],
       [ 0.58883191, -0.72252368, -0.22616846]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=51)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=52, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 52 (from the original molecule number 1 of model None)
Rotation angle: 4.53785605519
Rotation matrix:
[[ 0.24032009  0.35319473 -0.83535803]
 [ 0.67040357  0.4591017   0.44609198]
 [ 0.61084254 -0.723666   -0.14320671]]


relax> structure.rotate(R=array([[ 0.24032009,  0.35319473, -0.83535803],
       [ 0.67040357,  0.4591017 ,  0.44609198],
       [ 0.61084254, -0.723666  , -0.14320671]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=52)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=53, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 53 (from the original molecule number 1 of model None)
Rotation angle: 4.62512251778
Rotation matrix:
[[ 0.29630498  0.31364363 -0.83544608]
 [ 0.63452023  0.4989634   0.46308267]
 [ 0.62747634 -0.72020077 -0.05895767]]


relax> structure.rotate(R=array([[ 0.29630498,  0.31364363, -0.83544608],
       [ 0.63452023,  0.4989634 ,  0.46308267],
       [ 0.62747634, -0.72020077, -0.05895767]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=53)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=54, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 54 (from the original molecule number 1 of model None)
Rotation angle: 4.71238898038
Rotation matrix:
[[ 0.35271922  0.2750243  -0.82990382]
 [ 0.5971266   0.5391308   0.47564904]
 [ 0.63860672 -0.71215435  0.02593747]]


relax> structure.rotate(R=array([[ 0.35271922,  0.2750243 , -0.82990382],
       [ 0.5971266 ,  0.5391308 ,  0.47564904],
       [ 0.63860672, -0.71215435,  0.02593747]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=54)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=55, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 55 (from the original molecule number 1 of model None)
Rotation angle: 4.79965544298
Rotation matrix:
[[ 0.40913346  0.23763067 -0.81877344]
 [ 0.55850727  0.5792982   0.48369546]
 [ 0.64414898 -0.69958797  0.11083262]]


relax> structure.rotate(R=array([[ 0.40913346,  0.23763067, -0.81877344],
       [ 0.55850727,  0.5792982 ,  0.48369546],
       [ 0.64414898, -0.69958797,  0.11083262]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=55)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=56, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 56 (from the original molecule number 1 of model None)
Rotation angle: 4.88692190558
Rotation matrix:
[[ 0.46511835  0.20174732 -0.80213964]
 [ 0.51895616  0.6191599   0.4871607 ]
 [ 0.64406093 -0.68259729  0.19508166]]


relax> structure.rotate(R=array([[ 0.46511835,  0.20174732, -0.80213964],
       [ 0.51895616,  0.6191599 ,  0.4871607 ],
       [ 0.64406093, -0.68259729,  0.19508166]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=56)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=57, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 57 (from the original molecule number 1 of model None)
Rotation angle: 4.97418836818
Rotation matrix:
[[ 0.52024781  0.16764735 -0.78012901]
 [ 0.47877428  0.65841253  0.48601837]
 [ 0.63834324 -0.6613116   0.27804341]]


relax> structure.rotate(R=array([[ 0.52024781,  0.16764735, -0.78012901],
       [ 0.47877428,  0.65841253,  0.48601837],
       [ 0.63834324, -0.6613116 ,  0.27804341]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=57)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=58, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 58 (from the original molecule number 1 of model None)
Rotation angle: 5.06145483078
Rotation matrix:
[[ 0.57410229  0.13559028 -0.75290908]
 [ 0.43826744  0.69675735  0.48027717]
 [ 0.62703944 -0.6358929   0.35908648]]


relax> structure.rotate(R=array([[ 0.57410229,  0.13559028, -0.75290908],
       [ 0.43826744,  0.69675735,  0.48027717],
       [ 0.62703944, -0.6358929 ,  0.35908648]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=58)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=59, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 59 (from the original molecule number 1 of model None)
Rotation angle: 5.14872129338
Rotation matrix:
[[ 0.6262719   0.10582009 -0.72068699]
 [ 0.39774391  0.73390254  0.46998081]
 [ 0.61023554 -0.60653465  0.43759408]]


relax> structure.rotate(R=array([[ 0.6262719 ,  0.10582009, -0.72068699],
       [ 0.39774391,  0.73390254,  0.46998081],
       [ 0.61023554, -0.60653465,  0.43759408]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=59)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=60, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 60 (from the original molecule number 1 of model None)
Rotation angle: 5.23598775598
Rotation matrix:
[[ 0.67635961  0.07856334 -0.68370799]
 [ 0.35751211  0.7695654   0.45520763]
 [ 0.58805944 -0.57346028  0.51296874]]


relax> structure.rotate(R=array([[ 0.67635961,  0.07856334, -0.68370799],
       [ 0.35751211,  0.7695654 ,  0.45520763],
       [ 0.58805944, -0.57346028,  0.51296874]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=60)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=61, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 61 (from the original molecule number 1 of model None)
Rotation angle: 5.32325421858
Rotation matrix:
[[ 0.72398422  0.05402747 -0.6422535 ]
 [ 0.31787822  0.80347451  0.43607007]
 [ 0.56067991 -0.5369215   0.58463679]]


relax> structure.rotate(R=array([[ 0.72398422,  0.05402747, -0.6422535 ],
       [ 0.31787822,  0.80347451,  0.43607007],
       [ 0.56067991, -0.5369215 ,  0.58463679]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=61)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=62, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 62 (from the original molecule number 1 of model None)
Rotation angle: 5.41052068118
Rotation matrix:
[[ 0.76878329  0.03239922 -0.59663902]
 [ 0.27914389  0.83537181  0.41271378]
 [ 0.52830532 -0.4971964   0.6520528 ]]


relax> structure.rotate(R=array([[ 0.76878329,  0.03239922, -0.59663902],
       [ 0.27914389,  0.83537181,  0.41271378],
       [ 0.52830532, -0.4971964 ,  0.6520528 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=62)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=63, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 63 (from the original molecule number 1 of model None)
Rotation angle: 5.49778714378
Rotation matrix:
[[ 0.81041585  0.01384318 -0.54721169]
 [ 0.2416039   0.86501454  0.38531651]
 [ 0.49118207 -0.45458731  0.71470369]]


relax> structure.rotate(R=array([[ 0.81041585,  0.01384318, -0.54721169],
       [ 0.2416039 ,  0.86501454,  0.38531651],
       [ 0.49118207, -0.45458731,  0.71470369]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=63)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=64, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 64 (from the original molecule number 1 of model None)
Rotation angle: 5.58505360638
Rotation matrix:
[[ 0.84856506 -0.00149941 -0.4943477 ]
 [ 0.20554396  0.89217709  0.35408678]
 [ 0.44959268 -0.40941852  0.77211266]]


relax> structure.rotate(R=array([[ 0.84856506, -0.00149941, -0.4943477 ],
       [ 0.20554396,  0.89217709,  0.35408678],
       [ 0.44959268, -0.40941852,  0.77211266]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=64)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=65, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 65 (from the original molecule number 1 of model None)
Rotation angle: 5.67232006898
Rotation matrix:
[[ 0.88294059 -0.01351179 -0.43844937]
 [ 0.1712385   0.91665275  0.31926227]
 [ 0.40385368 -0.36203377  0.82384278]]


relax> structure.rotate(R=array([[ 0.88294059, -0.01351179, -0.43844937],
       [ 0.1712385 ,  0.91665275,  0.31926227],
       [ 0.40385368, -0.36203377,  0.82384278]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=65)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=66, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 66 (from the original molecule number 1 of model None)
Rotation angle: 5.75958653158
Rotation matrix:
[[ 0.91328082 -0.02210254 -0.37994211]
 [ 0.13894861  0.93825524  0.28110799]
 [ 0.35431316 -0.3127937   0.86950037]]


relax> structure.rotate(R=array([[ 0.91328082, -0.02210254, -0.37994211],
       [ 0.13894861,  0.93825524,  0.28110799],
       [ 0.35431316, -0.3127937 ,  0.86950037]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=66)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=67, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 67 (from the original molecule number 1 of model None)
Rotation angle: 5.84685299418
Rotation matrix:
[[ 0.93935483 -0.02720628 -0.31927121]
 [ 0.10892003  0.95682014  0.23991435]
 [ 0.30134816 -0.26207305  0.90873793]]


relax> structure.rotate(R=array([[ 0.93935483, -0.02720628, -0.31927121],
       [ 0.10892003,  0.95682014,  0.23991435],
       [ 0.30134816, -0.26207305,  0.90873793]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=67)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=68, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 68 (from the original molecule number 1 of model None)
Rotation angle: 5.93411945678
Rotation matrix:
[[ 0.96096419 -0.02878417 -0.25689841]
 [ 0.0813813   0.97220619  0.19599483]
 [ 0.24536178 -0.21025785  0.94125684]]


relax> structure.rotate(R=array([[ 0.96096419, -0.02878417, -0.25689841],
       [ 0.0813813 ,  0.97220619,  0.19599483],
       [ 0.24536178, -0.21025785,  0.94125684]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=68)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=69, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 69 (from the original molecule number 1 of model None)
Rotation angle: 6.02138591938
Rotation matrix:
[[ 0.97794444 -0.02682419 -0.19329839]
 [ 0.05654201  0.98429626  0.14968371]
 [ 0.1867801  -0.15774243  0.96680962]]


relax> structure.rotate(R=array([[ 0.97794444, -0.02682419, -0.19329839],
       [ 0.05654201,  0.98429626,  0.14968371],
       [ 0.1867801 , -0.15774243,  0.96680962]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=69)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=70, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 70 (from the original molecule number 1 of model None)
Rotation angle: 6.10865238198
Rotation matrix:
[[ 0.99016635 -0.02134127 -0.12895521]
 [ 0.0345912   0.99299836  0.10133342]
 [ 0.12604897 -0.10492647  0.9852018 ]]


relax> structure.rotate(R=array([[ 0.99016635, -0.02134127, -0.12895521],
       [ 0.0345912 ,  0.99299836,  0.10133342],
       [ 0.12604897, -0.10492647,  0.9852018 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=70)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=71, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 71 (from the original molecule number 1 of model None)
Rotation angle: 6.19591884458
Rotation matrix:
[[ 0.9975369  -0.01237713 -0.06435853]
 [ 0.01569593  0.99824625  0.05131196]
 [ 0.06363059 -0.05221193  0.9962934 ]]


relax> structure.rotate(R=array([[ 0.9975369 , -0.01237713, -0.06435853],
       [ 0.01569593,  0.99824625,  0.05131196],
       [ 0.06363059, -0.05221193,  0.9962934 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=71)

relax> structure.write_pdb(file='distribution.pdb', dir=None, model_num=None, compress_type=2, force=True)
Opening the file 'distribution.pdb.gz' for writing.

Creating the PDB records

REMARK
HET
HETNAM
FORMUL

MODEL 1
ATOM, HETATM, TER
ENDMDL

MODEL 2
ATOM, HETATM, TER
ENDMDL

MODEL 3
ATOM, HETATM, TER
ENDMDL

MODEL 4
ATOM, HETATM, TER
ENDMDL

MODEL 5
ATOM, HETATM, TER
ENDMDL

MODEL 6
ATOM, HETATM, TER
ENDMDL

MODEL 7
ATOM, HETATM, TER
ENDMDL

MODEL 8
ATOM, HETATM, TER
ENDMDL

MODEL 9
ATOM, HETATM, TER
ENDMDL

MODEL 10
ATOM, HETATM, TER
ENDMDL

MODEL 11
ATOM, HETATM, TER
ENDMDL

MODEL 12
ATOM, HETATM, TER
ENDMDL

MODEL 13
ATOM, HETATM, TER
ENDMDL

MODEL 14
ATOM, HETATM, TER
ENDMDL

MODEL 15
ATOM, HETATM, TER
ENDMDL

MODEL 16
ATOM, HETATM, TER
ENDMDL

MODEL 17
ATOM, HETATM, TER
ENDMDL

MODEL 18
ATOM, HETATM, TER
ENDMDL

MODEL 19
ATOM, HETATM, TER
ENDMDL

MODEL 20
ATOM, HETATM, TER
ENDMDL

MODEL 21
ATOM, HETATM, TER
ENDMDL

MODEL 22
ATOM, HETATM, TER
ENDMDL

MODEL 23
ATOM, HETATM, TER
ENDMDL

MODEL 24
ATOM, HETATM, TER
ENDMDL

MODEL 25
ATOM, HETATM, TER
ENDMDL

MODEL 26
ATOM, HETATM, TER
ENDMDL

MODEL 27
ATOM, HETATM, TER
ENDMDL

MODEL 28
ATOM, HETATM, TER
ENDMDL

MODEL 29
ATOM, HETATM, TER
ENDMDL

MODEL 30
ATOM, HETATM, TER
ENDMDL

MODEL 31
ATOM, HETATM, TER
ENDMDL

MODEL 32
ATOM, HETATM, TER
ENDMDL

MODEL 33
ATOM, HETATM, TER
ENDMDL

MODEL 34
ATOM, HETATM, TER
ENDMDL

MODEL 35
ATOM, HETATM, TER
ENDMDL

MODEL 36
ATOM, HETATM, TER
ENDMDL

MODEL 37
ATOM, HETATM, TER
ENDMDL

MODEL 38
ATOM, HETATM, TER
ENDMDL

MODEL 39
ATOM, HETATM, TER
ENDMDL

MODEL 40
ATOM, HETATM, TER
ENDMDL

MODEL 41
ATOM, HETATM, TER
ENDMDL

MODEL 42
ATOM, HETATM, TER
ENDMDL

MODEL 43
ATOM, HETATM, TER
ENDMDL

MODEL 44
ATOM, HETATM, TER
ENDMDL

MODEL 45
ATOM, HETATM, TER
ENDMDL

MODEL 46
ATOM, HETATM, TER
ENDMDL

MODEL 47
ATOM, HETATM, TER
ENDMDL

MODEL 48
ATOM, HETATM, TER
ENDMDL

MODEL 49
ATOM, HETATM, TER
ENDMDL

MODEL 50
ATOM, HETATM, TER
ENDMDL

MODEL 51
ATOM, HETATM, TER
ENDMDL

MODEL 52
ATOM, HETATM, TER
ENDMDL

MODEL 53
ATOM, HETATM, TER
ENDMDL

MODEL 54
ATOM, HETATM, TER
ENDMDL

MODEL 55
ATOM, HETATM, TER
ENDMDL

MODEL 56
ATOM, HETATM, TER
ENDMDL

MODEL 57
ATOM, HETATM, TER
ENDMDL

MODEL 58
ATOM, HETATM, TER
ENDMDL

MODEL 59
ATOM, HETATM, TER
ENDMDL

MODEL 60
ATOM, HETATM, TER
ENDMDL

MODEL 61
ATOM, HETATM, TER
ENDMDL

MODEL 62
ATOM, HETATM, TER
ENDMDL

MODEL 63
ATOM, HETATM, TER
ENDMDL

MODEL 64
ATOM, HETATM, TER
ENDMDL

MODEL 65
ATOM, HETATM, TER
ENDMDL

MODEL 66
ATOM, HETATM, TER
ENDMDL

MODEL 67
ATOM, HETATM, TER
ENDMDL

MODEL 68
ATOM, HETATM, TER
ENDMDL

MODEL 69
ATOM, HETATM, TER
ENDMDL

MODEL 70
ATOM, HETATM, TER
ENDMDL

MODEL 71
ATOM, HETATM, TER
ENDMDL
CONECT

MASTER
END

