


                                  relax repository checkout r21304
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'generate_r2eff_files.py'
----------------------------------------------------------------------------------------------------
# Script for CPMG relaxation dispersion curve fitting using Dr. Flemming Hansen's data from http://dx.doi.org/10.1021/jp074793o.

# Python module imports.
from os import sep

# relax module imports.
from auto_analyses.relax_disp import Relax_disp
from data_store import Relax_data_store; ds = Relax_data_store()
from pipe_control.mol_res_spin import spin_loop
from specific_analyses.relax_disp.disp_data import loop_exp_frq_point, return_param_key_from_data
from status import Status; status = Status()


# Analysis variables.
#####################

# The dispersion models.
MODELS = ['R2eff']

# The grid search size (the number of increments per dimension).
GRID_INC = 11

# The results directory.
RESULTS_DIR = 'r2eff_data'


# Set up the data pipe.
#######################

# Create the data pipe.
pipe_name = 'base pipe'
pipe_bundle = 'relax_disp'
pipe.create(pipe_name=pipe_name, bundle=pipe_bundle, pipe_type='relax_disp')

# The path to the data files.
data_path = status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'Hansen'

# Load the sequence.
sequence.read('fake_sequence.in_trunc', dir=status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'Hansen', res_num_col=1, res_name_col=2)

# Name the spins so they can be matched to the assignments.
spin.name(name='N')

# The spectral data - spectrum ID, peak list file name, CPMG frequency (Hz), spectrometer frequency in Hertz.
data = [
    ['500_reference.in',    '500_MHz'+sep+'reference.in_trunc',           None,  500e6],
    ['500_66.667.in',       '500_MHz'+sep+'66.667.in_trunc',           66.6666,  500e6],
    ['500_133.33.in',       '500_MHz'+sep+'133.33.in_trunc',          133.3333,  500e6],
    ['500_133.33.in.bis',   '500_MHz'+sep+'133.33.in.bis_trunc',      133.3333,  500e6],
    ['500_200.in',          '500_MHz'+sep+'200.in_trunc',             200.0000,  500e6],
    ['500_266.67.in',       '500_MHz'+sep+'266.67.in_trunc',          266.6666,  500e6],
    ['500_333.33.in',       '500_MHz'+sep+'333.33.in_trunc',          333.3333,  500e6],
    ['500_400.in',          '500_MHz'+sep+'400.in_trunc',             400.0000,  500e6],
    ['500_466.67.in',       '500_MHz'+sep+'466.67.in_trunc',          466.6666,  500e6],
    ['500_533.33.in',       '500_MHz'+sep+'533.33.in_trunc',          533.3333,  500e6],
    ['500_533.33.in.bis',   '500_MHz'+sep+'533.33.in.bis_trunc',      533.3333,  500e6],
    ['500_600.in',          '500_MHz'+sep+'600.in_trunc',             600.0000,  500e6],
    ['500_666.67.in',       '500_MHz'+sep+'666.67.in_trunc',          666.6666,  500e6],
    ['500_733.33.in',       '500_MHz'+sep+'733.33.in_trunc',          733.3333,  500e6],
    ['500_800.in',          '500_MHz'+sep+'800.in_trunc',             800.0000,  500e6],
    ['500_866.67.in',       '500_MHz'+sep+'866.67.in_trunc',          866.6666,  500e6],
    ['500_933.33.in',       '500_MHz'+sep+'933.33.in_trunc',          933.3333,  500e6],
    ['500_933.33.in.bis',   '500_MHz'+sep+'933.33.in.bis_trunc',      933.3333,  500e6],
    ['500_1000.in',         '500_MHz'+sep+'1000.in_trunc',           1000.0000,  500e6],
    ['800_reference.in',    '800_MHz'+sep+'reference.in_trunc',           None,  800e6],
    ['800_66.667.in',       '800_MHz'+sep+'66.667.in_trunc',           66.6666,  800e6],
    ['800_133.33.in',       '800_MHz'+sep+'133.33.in_trunc',          133.3333,  800e6],
    ['800_133.33.in.bis',   '800_MHz'+sep+'133.33.in.bis_trunc',      133.3333,  800e6],
    ['800_200.in',          '800_MHz'+sep+'200.in_trunc',             200.0000,  800e6],
    ['800_266.67.in',       '800_MHz'+sep+'266.67.in_trunc',          266.6666,  800e6],
    ['800_333.33.in',       '800_MHz'+sep+'333.33.in_trunc',          333.3333,  800e6],
    ['800_400.in',          '800_MHz'+sep+'400.in_trunc',             400.0000,  800e6],
    ['800_466.67.in',       '800_MHz'+sep+'466.67.in_trunc',          466.6666,  800e6],
    ['800_533.33.in',       '800_MHz'+sep+'533.33.in_trunc',          533.3333,  800e6],
    ['800_533.33.in.bis',   '800_MHz'+sep+'533.33.in.bis_trunc',      533.3333,  800e6],
    ['800_600.in',          '800_MHz'+sep+'600.in_trunc',             600.0000,  800e6],
    ['800_666.67.in',       '800_MHz'+sep+'666.67.in_trunc',          666.6666,  800e6],
    ['800_733.33.in',       '800_MHz'+sep+'733.33.in_trunc',          733.3333,  800e6],
    ['800_800.in',          '800_MHz'+sep+'800.in_trunc',             800.0000,  800e6],
    ['800_866.67.in',       '800_MHz'+sep+'866.67.in_trunc',          866.6666,  800e6],
    ['800_933.33.in',       '800_MHz'+sep+'933.33.in_trunc',          933.3333,  800e6],
    ['800_933.33.in.bis',   '800_MHz'+sep+'933.33.in.bis_trunc',      933.3333,  800e6],
    ['800_1000.in',         '800_MHz'+sep+'1000.in_trunc',           1000.0000,  800e6]
]

# Loop over the spectra.
for id, file, cpmg_frq, H_frq in data:
    # Load the peak intensities.
    spectrum.read_intensities(file=file, dir=data_path, spectrum_id=id, int_method='height')

    # Set the relaxation dispersion experiment type.
    relax_disp.exp_type(spectrum_id=id, exp_type='CPMG')

    # Set the relaxation dispersion CPMG frequencies.
    relax_disp.cpmg_frq(spectrum_id=id, cpmg_frq=cpmg_frq)

    # Set the NMR field strength of the spectrum.
    spectrometer.frequency(id=id, frq=H_frq)

    # Relaxation dispersion CPMG constant time delay T (in s).
    relax_disp.relax_time(spectrum_id=id, time=0.030)

# Specify the duplicated spectra.
spectrum.replicated(spectrum_ids=['500_133.33.in', '500_133.33.in.bis'])
spectrum.replicated(spectrum_ids=['500_533.33.in', '500_533.33.in.bis'])
spectrum.replicated(spectrum_ids=['500_933.33.in', '500_933.33.in.bis'])
spectrum.replicated(spectrum_ids=['800_133.33.in', '800_133.33.in.bis'])
spectrum.replicated(spectrum_ids=['800_533.33.in', '800_533.33.in.bis'])
spectrum.replicated(spectrum_ids=['800_933.33.in', '800_933.33.in.bis'])

# Deselect unresolved spins.
deselect.read(file='unresolved', dir=data_path+sep+'500_MHz', res_num_col=1)
deselect.read(file='unresolved', dir=data_path+sep+'800_MHz', res_num_col=1)



# Auto-analysis execution.
##########################

# Do not change!
sequence.display()
Relax_disp(pipe_name=pipe_name, pipe_bundle=pipe_bundle, results_dir=RESULTS_DIR, models=MODELS, grid_inc=GRID_INC)


# Write out the R2eff data.
print("\n\nWriting out the R2eff data files.\n")
for exp_type, frq, point in loop_exp_frq_point():
    # Open a the file for writing.
    file_name = '%i_%.2f.r2eff' % (frq/1e6, point)
    print("Creating r2eff_data%s%s." % (sep, file_name))
    file = open('r2eff_data' + sep + file_name, 'w')

    # Generate the key.
    key = return_param_key_from_data(frq, point)

    # A header.
    file.write("# This data corresponds to:\n")
    file.write("#     Spectrometer frequency:  %s\n" % frq)
    file.write("#     CPMG frequency:  %s\n" % point)
    file.write("#%-19s %-20s %-20s\n" % ("Residue number", "R2eff", "error"))

    # Loop over the spins.
    for spin, mol_name, res_num, res_name, id in spin_loop(full_info=True, return_id=True, skip_desel=True):
        # Write out the data.
        if key in spin.r2eff.keys():
            file.write("%-20i %20.15f %20.15f\n" % (res_num, spin.r2eff[key], spin.r2eff_err[key]))

    # Close the file.
    file.close()
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='base pipe', pipe_type='relax_disp', bundle='relax_disp')

relax> sequence.read(file='fake_sequence.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=2, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/fake_sequence.in_trunc' for reading.
# mol_name    res_num    res_name    spin_num    spin_name    
None          4          GLY         None        None         
None          70         GLY         None        None         
None          71         GLY         None        None         

relax> spin.name(name='N', spin_id=None, force=False)

relax> spectrum.read_intensities(file='500_MHz/reference.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_reference.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/reference.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         51701.544    
:70@N        25707.455    
:71@N        39274.345    

relax> relax_disp.exp_type(spectrum_id='500_reference.in', exp_type='CPMG')
The spectrum ID '500_reference.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_reference.in', cpmg_frq=None)
The spectrum ID '500_reference.in' CPMG frequency is set to None Hz.

relax> spectrometer.frequency(id='500_reference.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_reference.in', time=0.03)
Setting the '500_reference.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/66.667.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_66.667.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/66.667.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49187.324    
:70@N        15885.628    
:71@N        31792.844    

relax> relax_disp.exp_type(spectrum_id='500_66.667.in', exp_type='CPMG')
The spectrum ID '500_66.667.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_66.667.in', cpmg_frq=66.6666)
The spectrum ID '500_66.667.in' CPMG frequency is set to 66.6666 Hz.

relax> spectrometer.frequency(id='500_66.667.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_66.667.in', time=0.03)
Setting the '500_66.667.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/133.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_133.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/133.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49198.165    
:70@N        16627.668    
:71@N        31972.777    

relax> relax_disp.exp_type(spectrum_id='500_133.33.in', exp_type='CPMG')
The spectrum ID '500_133.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_133.33.in', cpmg_frq=133.3333)
The spectrum ID '500_133.33.in' CPMG frequency is set to 133.3333 Hz.

relax> spectrometer.frequency(id='500_133.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_133.33.in', time=0.03)
Setting the '500_133.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/133.33.in.bis_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_133.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/133.33.in.bis_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49357.169    
:70@N        16276.208    
:71@N        32117.182    

relax> relax_disp.exp_type(spectrum_id='500_133.33.in.bis', exp_type='CPMG')
The spectrum ID '500_133.33.in.bis' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_133.33.in.bis', cpmg_frq=133.3333)
The spectrum ID '500_133.33.in.bis' CPMG frequency is set to 133.3333 Hz.

relax> spectrometer.frequency(id='500_133.33.in.bis', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_133.33.in.bis', time=0.03)
Setting the '500_133.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/200.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_200.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/200.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49361.759    
:70@N        16710.653    
:71@N        32347.697    

relax> relax_disp.exp_type(spectrum_id='500_200.in', exp_type='CPMG')
The spectrum ID '500_200.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_200.in', cpmg_frq=200.0)
The spectrum ID '500_200.in' CPMG frequency is set to 200.0 Hz.

relax> spectrometer.frequency(id='500_200.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_200.in', time=0.03)
Setting the '500_200.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/266.67.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_266.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/266.67.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49169.489    
:70@N        17581.482    
:71@N        32478.272    

relax> relax_disp.exp_type(spectrum_id='500_266.67.in', exp_type='CPMG')
The spectrum ID '500_266.67.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_266.67.in', cpmg_frq=266.6666)
The spectrum ID '500_266.67.in' CPMG frequency is set to 266.6666 Hz.

relax> spectrometer.frequency(id='500_266.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_266.67.in', time=0.03)
Setting the '500_266.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/333.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_333.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/333.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49239.453    
:70@N        17741.116    
:71@N        32488.116    

relax> relax_disp.exp_type(spectrum_id='500_333.33.in', exp_type='CPMG')
The spectrum ID '500_333.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_333.33.in', cpmg_frq=333.3333)
The spectrum ID '500_333.33.in' CPMG frequency is set to 333.3333 Hz.

relax> spectrometer.frequency(id='500_333.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_333.33.in', time=0.03)
Setting the '500_333.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/400.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_400.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/400.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49382.8      
:70@N        18430.466    
:71@N        32799.529    

relax> relax_disp.exp_type(spectrum_id='500_400.in', exp_type='CPMG')
The spectrum ID '500_400.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_400.in', cpmg_frq=400.0)
The spectrum ID '500_400.in' CPMG frequency is set to 400.0 Hz.

relax> spectrometer.frequency(id='500_400.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_400.in', time=0.03)
Setting the '500_400.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/466.67.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_466.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/466.67.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49356.864    
:70@N        18723.854    
:71@N        33034.747    

relax> relax_disp.exp_type(spectrum_id='500_466.67.in', exp_type='CPMG')
The spectrum ID '500_466.67.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_466.67.in', cpmg_frq=466.6666)
The spectrum ID '500_466.67.in' CPMG frequency is set to 466.6666 Hz.

relax> spectrometer.frequency(id='500_466.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_466.67.in', time=0.03)
Setting the '500_466.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/533.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_533.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/533.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49171.379    
:70@N        18880.359    
:71@N        33277.779    

relax> relax_disp.exp_type(spectrum_id='500_533.33.in', exp_type='CPMG')
The spectrum ID '500_533.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_533.33.in', cpmg_frq=533.3333)
The spectrum ID '500_533.33.in' CPMG frequency is set to 533.3333 Hz.

relax> spectrometer.frequency(id='500_533.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_533.33.in', time=0.03)
Setting the '500_533.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/533.33.in.bis_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_533.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/533.33.in.bis_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49149.552    
:70@N        19431.29     
:71@N        33369.196    

relax> relax_disp.exp_type(spectrum_id='500_533.33.in.bis', exp_type='CPMG')
The spectrum ID '500_533.33.in.bis' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_533.33.in.bis', cpmg_frq=533.3333)
The spectrum ID '500_533.33.in.bis' CPMG frequency is set to 533.3333 Hz.

relax> spectrometer.frequency(id='500_533.33.in.bis', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_533.33.in.bis', time=0.03)
Setting the '500_533.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/600.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_600.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/600.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49335.18     
:70@N        19295.116    
:71@N        33330.505    

relax> relax_disp.exp_type(spectrum_id='500_600.in', exp_type='CPMG')
The spectrum ID '500_600.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_600.in', cpmg_frq=600.0)
The spectrum ID '500_600.in' CPMG frequency is set to 600.0 Hz.

relax> spectrometer.frequency(id='500_600.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_600.in', time=0.03)
Setting the '500_600.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/666.67.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_666.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/666.67.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49247.787    
:70@N        19615.342    
:71@N        33505.785    

relax> relax_disp.exp_type(spectrum_id='500_666.67.in', exp_type='CPMG')
The spectrum ID '500_666.67.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_666.67.in', cpmg_frq=666.6666)
The spectrum ID '500_666.67.in' CPMG frequency is set to 666.6666 Hz.

relax> spectrometer.frequency(id='500_666.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_666.67.in', time=0.03)
Setting the '500_666.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/733.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_733.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/733.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49321.326    
:70@N        19856.831    
:71@N        33364.821    

relax> relax_disp.exp_type(spectrum_id='500_733.33.in', exp_type='CPMG')
The spectrum ID '500_733.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_733.33.in', cpmg_frq=733.3333)
The spectrum ID '500_733.33.in' CPMG frequency is set to 733.3333 Hz.

relax> spectrometer.frequency(id='500_733.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_733.33.in', time=0.03)
Setting the '500_733.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/800.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_800.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/800.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49272.485    
:70@N        20053.047    
:71@N        33390.102    

relax> relax_disp.exp_type(spectrum_id='500_800.in', exp_type='CPMG')
The spectrum ID '500_800.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_800.in', cpmg_frq=800.0)
The spectrum ID '500_800.in' CPMG frequency is set to 800.0 Hz.

relax> spectrometer.frequency(id='500_800.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_800.in', time=0.03)
Setting the '500_800.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/866.67.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_866.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/866.67.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49239.025    
:70@N        19936.355    
:71@N        33362.913    

relax> relax_disp.exp_type(spectrum_id='500_866.67.in', exp_type='CPMG')
The spectrum ID '500_866.67.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_866.67.in', cpmg_frq=866.6666)
The spectrum ID '500_866.67.in' CPMG frequency is set to 866.6666 Hz.

relax> spectrometer.frequency(id='500_866.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_866.67.in', time=0.03)
Setting the '500_866.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/933.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_933.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/933.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49294.717    
:70@N        20182.933    
:71@N        33594.549    

relax> relax_disp.exp_type(spectrum_id='500_933.33.in', exp_type='CPMG')
The spectrum ID '500_933.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_933.33.in', cpmg_frq=933.3333)
The spectrum ID '500_933.33.in' CPMG frequency is set to 933.3333 Hz.

relax> spectrometer.frequency(id='500_933.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_933.33.in', time=0.03)
Setting the '500_933.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/933.33.in.bis_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_933.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/933.33.in.bis_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49229.692    
:70@N        20069.04     
:71@N        33655.205    

relax> relax_disp.exp_type(spectrum_id='500_933.33.in.bis', exp_type='CPMG')
The spectrum ID '500_933.33.in.bis' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_933.33.in.bis', cpmg_frq=933.3333)
The spectrum ID '500_933.33.in.bis' CPMG frequency is set to 933.3333 Hz.

relax> spectrometer.frequency(id='500_933.33.in.bis', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_933.33.in.bis', time=0.03)
Setting the '500_933.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/1000.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_1000.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/1000.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         49310.788    
:70@N        20229.099    
:71@N        33574.087    

relax> relax_disp.exp_type(spectrum_id='500_1000.in', exp_type='CPMG')
The spectrum ID '500_1000.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_1000.in', cpmg_frq=1000.0)
The spectrum ID '500_1000.in' CPMG frequency is set to 1000.0 Hz.

relax> spectrometer.frequency(id='500_1000.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_1000.in', time=0.03)
Setting the '500_1000.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/reference.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_reference.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/reference.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         179861.72    
:70@N        75506.418    

relax> relax_disp.exp_type(spectrum_id='800_reference.in', exp_type='CPMG')
The spectrum ID '800_reference.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_reference.in', cpmg_frq=None)
The spectrum ID '800_reference.in' CPMG frequency is set to None Hz.

relax> spectrometer.frequency(id='800_reference.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_reference.in', time=0.03)
Setting the '800_reference.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/66.667.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_66.667.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/66.667.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         170898.93    
:70@N        38763.157    

relax> relax_disp.exp_type(spectrum_id='800_66.667.in', exp_type='CPMG')
The spectrum ID '800_66.667.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_66.667.in', cpmg_frq=66.6666)
The spectrum ID '800_66.667.in' CPMG frequency is set to 66.6666 Hz.

relax> spectrometer.frequency(id='800_66.667.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_66.667.in', time=0.03)
Setting the '800_66.667.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/133.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_133.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/133.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         170990.52    
:70@N        40007.044    

relax> relax_disp.exp_type(spectrum_id='800_133.33.in', exp_type='CPMG')
The spectrum ID '800_133.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_133.33.in', cpmg_frq=133.3333)
The spectrum ID '800_133.33.in' CPMG frequency is set to 133.3333 Hz.

relax> spectrometer.frequency(id='800_133.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_133.33.in', time=0.03)
Setting the '800_133.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/133.33.in.bis_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_133.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/133.33.in.bis_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         170997.76    
:70@N        39866.015    

relax> relax_disp.exp_type(spectrum_id='800_133.33.in.bis', exp_type='CPMG')
The spectrum ID '800_133.33.in.bis' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_133.33.in.bis', cpmg_frq=133.3333)
The spectrum ID '800_133.33.in.bis' CPMG frequency is set to 133.3333 Hz.

relax> spectrometer.frequency(id='800_133.33.in.bis', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_133.33.in.bis', time=0.03)
Setting the '800_133.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/200.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_200.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/200.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171598.73    
:70@N        40695.053    

relax> relax_disp.exp_type(spectrum_id='800_200.in', exp_type='CPMG')
The spectrum ID '800_200.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_200.in', cpmg_frq=200.0)
The spectrum ID '800_200.in' CPMG frequency is set to 200.0 Hz.

relax> spectrometer.frequency(id='800_200.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_200.in', time=0.03)
Setting the '800_200.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/266.67.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_266.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/266.67.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         170741.44    
:70@N        41033.292    

relax> relax_disp.exp_type(spectrum_id='800_266.67.in', exp_type='CPMG')
The spectrum ID '800_266.67.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_266.67.in', cpmg_frq=266.6666)
The spectrum ID '800_266.67.in' CPMG frequency is set to 266.6666 Hz.

relax> spectrometer.frequency(id='800_266.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_266.67.in', time=0.03)
Setting the '800_266.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/333.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_333.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/333.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         170855.52    
:70@N        42886.468    

relax> relax_disp.exp_type(spectrum_id='800_333.33.in', exp_type='CPMG')
The spectrum ID '800_333.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_333.33.in', cpmg_frq=333.3333)
The spectrum ID '800_333.33.in' CPMG frequency is set to 333.3333 Hz.

relax> spectrometer.frequency(id='800_333.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_333.33.in', time=0.03)
Setting the '800_333.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/400.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_400.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/400.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171184.09    
:70@N        43297.363    

relax> relax_disp.exp_type(spectrum_id='800_400.in', exp_type='CPMG')
The spectrum ID '800_400.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_400.in', cpmg_frq=400.0)
The spectrum ID '800_400.in' CPMG frequency is set to 400.0 Hz.

relax> spectrometer.frequency(id='800_400.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_400.in', time=0.03)
Setting the '800_400.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/466.67.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_466.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/466.67.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171251.59    
:70@N        44655.415    

relax> relax_disp.exp_type(spectrum_id='800_466.67.in', exp_type='CPMG')
The spectrum ID '800_466.67.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_466.67.in', cpmg_frq=466.6666)
The spectrum ID '800_466.67.in' CPMG frequency is set to 466.6666 Hz.

relax> spectrometer.frequency(id='800_466.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_466.67.in', time=0.03)
Setting the '800_466.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/533.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_533.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/533.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171507.2     
:70@N        46303.662    

relax> relax_disp.exp_type(spectrum_id='800_533.33.in', exp_type='CPMG')
The spectrum ID '800_533.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_533.33.in', cpmg_frq=533.3333)
The spectrum ID '800_533.33.in' CPMG frequency is set to 533.3333 Hz.

relax> spectrometer.frequency(id='800_533.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_533.33.in', time=0.03)
Setting the '800_533.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/533.33.in.bis_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_533.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/533.33.in.bis_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171584.43    
:70@N        47040.817    

relax> relax_disp.exp_type(spectrum_id='800_533.33.in.bis', exp_type='CPMG')
The spectrum ID '800_533.33.in.bis' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_533.33.in.bis', cpmg_frq=533.3333)
The spectrum ID '800_533.33.in.bis' CPMG frequency is set to 533.3333 Hz.

relax> spectrometer.frequency(id='800_533.33.in.bis', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_533.33.in.bis', time=0.03)
Setting the '800_533.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/600.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_600.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/600.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         170836.57    
:70@N        47902.702    

relax> relax_disp.exp_type(spectrum_id='800_600.in', exp_type='CPMG')
The spectrum ID '800_600.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_600.in', cpmg_frq=600.0)
The spectrum ID '800_600.in' CPMG frequency is set to 600.0 Hz.

relax> spectrometer.frequency(id='800_600.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_600.in', time=0.03)
Setting the '800_600.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/666.67.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_666.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/666.67.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171439.44    
:70@N        48972.729    

relax> relax_disp.exp_type(spectrum_id='800_666.67.in', exp_type='CPMG')
The spectrum ID '800_666.67.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_666.67.in', cpmg_frq=666.6666)
The spectrum ID '800_666.67.in' CPMG frequency is set to 666.6666 Hz.

relax> spectrometer.frequency(id='800_666.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_666.67.in', time=0.03)
Setting the '800_666.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/733.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_733.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/733.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171718.72    
:70@N        49560.47     

relax> relax_disp.exp_type(spectrum_id='800_733.33.in', exp_type='CPMG')
The spectrum ID '800_733.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_733.33.in', cpmg_frq=733.3333)
The spectrum ID '800_733.33.in' CPMG frequency is set to 733.3333 Hz.

relax> spectrometer.frequency(id='800_733.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_733.33.in', time=0.03)
Setting the '800_733.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/800.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_800.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/800.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171807.79    
:70@N        51244.752    

relax> relax_disp.exp_type(spectrum_id='800_800.in', exp_type='CPMG')
The spectrum ID '800_800.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_800.in', cpmg_frq=800.0)
The spectrum ID '800_800.in' CPMG frequency is set to 800.0 Hz.

relax> spectrometer.frequency(id='800_800.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_800.in', time=0.03)
Setting the '800_800.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/866.67.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_866.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/866.67.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171243.18    
:70@N        51656.057    

relax> relax_disp.exp_type(spectrum_id='800_866.67.in', exp_type='CPMG')
The spectrum ID '800_866.67.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_866.67.in', cpmg_frq=866.6666)
The spectrum ID '800_866.67.in' CPMG frequency is set to 866.6666 Hz.

relax> spectrometer.frequency(id='800_866.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_866.67.in', time=0.03)
Setting the '800_866.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/933.33.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_933.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/933.33.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171060.7     
:70@N        51189.967    

relax> relax_disp.exp_type(spectrum_id='800_933.33.in', exp_type='CPMG')
The spectrum ID '800_933.33.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_933.33.in', cpmg_frq=933.3333)
The spectrum ID '800_933.33.in' CPMG frequency is set to 933.3333 Hz.

relax> spectrometer.frequency(id='800_933.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_933.33.in', time=0.03)
Setting the '800_933.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/933.33.in.bis_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_933.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/933.33.in.bis_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171275.37    
:70@N        52254.914    

relax> relax_disp.exp_type(spectrum_id='800_933.33.in.bis', exp_type='CPMG')
The spectrum ID '800_933.33.in.bis' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_933.33.in.bis', cpmg_frq=933.3333)
The spectrum ID '800_933.33.in.bis' CPMG frequency is set to 933.3333 Hz.

relax> spectrometer.frequency(id='800_933.33.in.bis', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_933.33.in.bis', time=0.03)
Setting the '800_933.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/1000.in_trunc', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_1000.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/1000.in_trunc' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:4@N         171198.06    
:70@N        52727.575    

relax> relax_disp.exp_type(spectrum_id='800_1000.in', exp_type='CPMG')
The spectrum ID '800_1000.in' is now set to the CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_1000.in', cpmg_frq=1000.0)
The spectrum ID '800_1000.in' CPMG frequency is set to 1000.0 Hz.

relax> spectrometer.frequency(id='800_1000.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_1000.in', time=0.03)
Setting the '800_1000.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.replicated(spectrum_ids=['500_133.33.in', '500_133.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['500_533.33.in', '500_533.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['500_933.33.in', '500_933.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['800_133.33.in', '800_133.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['800_533.33.in', '800_533.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['800_933.33.in', '800_933.33.in.bis'])

relax> deselect.read(file='unresolved', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz', spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, boolean='AND', change_all=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/unresolved' for reading.
RelaxWarning: Cannot find the spin :9 within the sequence.
RelaxWarning: Cannot find the spin :27 within the sequence.
RelaxWarning: Cannot find the spin :28 within the sequence.
RelaxWarning: Cannot find the spin :30 within the sequence.
RelaxWarning: Cannot find the spin :54 within the sequence.
RelaxWarning: Cannot find the spin :68 within the sequence.
RelaxWarning: Cannot find the spin :69 within the sequence.
No spins deselected.

relax> deselect.read(file='unresolved', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz', spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, boolean='AND', change_all=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/unresolved' for reading.
RelaxWarning: Cannot find the spin :9 within the sequence.
RelaxWarning: Cannot find the spin :54 within the sequence.
RelaxWarning: Cannot find the spin :68 within the sequence.
RelaxWarning: Cannot find the spin :69 within the sequence.
No spins deselected.

relax> sequence.display(sep=None, mol_name_flag=True, res_num_flag=True, res_name_flag=True, spin_num_flag=True, spin_name_flag=True)
# mol_name    res_num    res_name    spin_num    spin_name    
None          4          GLY         None        N            
None          70         GLY         None        N            
None          71         GLY         None        N            




=======================================
= Relaxation dispersion auto-analysis =
=======================================


relax> spectrum.error_analysis(subset=['500_reference.in', '500_66.667.in', '500_133.33.in', '500_133.33.in.bis', '500_200.in', '500_266.67.in', '500_333.33.in', '500_400.in', '500_466.67.in', '500_533.33.in', '500_533.33.in.bis', '500_600.in', '500_666.67.in', '500_733.33.in', '500_800.in', '500_866.67.in', '500_933.33.in', '500_933.33.in.bis', '500_1000.in'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Replicated spectra:  ['500_133.33.in', '500_133.33.in.bis']
Standard deviation:  168.156280307

Replicated spectra:  ['500_533.33.in', '500_533.33.in.bis']
Standard deviation:  228.166040629

Replicated spectra:  ['500_933.33.in', '500_933.33.in.bis']
Standard deviation:  58.9901353476

Variance averaging over all spectra.
Standard deviation for all spins:  167.14874889517517

relax> spectrum.error_analysis(subset=['800_reference.in', '800_66.667.in', '800_133.33.in', '800_133.33.in.bis', '800_200.in', '800_266.67.in', '800_333.33.in', '800_400.in', '800_466.67.in', '800_533.33.in', '800_533.33.in.bis', '800_600.in', '800_666.67.in', '800_733.33.in', '800_800.in', '800_866.67.in', '800_933.33.in', '800_933.33.in.bis', '800_1000.in'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Replicated spectra:  ['800_133.33.in', '800_133.33.in.bis']
Standard deviation:  70.6073587542

Replicated spectra:  ['800_533.33.in', '800_533.33.in.bis']
Standard deviation:  370.594781036

Replicated spectra:  ['800_933.33.in', '800_933.33.in.bis']
Standard deviation:  543.183974752

Variance averaging over all spectra.
Standard deviation for all spins:  237.11472526392998



---------------------
- The 'R2eff' model -
---------------------

Detected the presence of results files for the 'R2eff' model - loading these instead of performing optimisation for a second time.

relax> pipe.create(pipe_name='R2eff', pipe_type='relax_disp', bundle='relax_disp')

relax> pipe.switch(pipe_name='R2eff')

relax> results.read(file='results', dir='r2eff_data/R2eff')
Opening the file 'r2eff_data/R2eff/results.bz2' for reading.
RelaxWarning: Model selection in the dispersion auto-analysis has been skipped as only 0 models have been optimised.

relax> state.save(state='final_state', dir='r2eff_data', compress_type=1, force=True)
Opening the file 'r2eff_data/final_state.bz2' for writing.


Writing out the R2eff data files.

Creating r2eff_data/500_66.67.r2eff.
Creating r2eff_data/500_133.33.r2eff.
Creating r2eff_data/500_200.00.r2eff.
Creating r2eff_data/500_266.67.r2eff.
Creating r2eff_data/500_333.33.r2eff.
Creating r2eff_data/500_400.00.r2eff.
Creating r2eff_data/500_466.67.r2eff.
Creating r2eff_data/500_533.33.r2eff.
Creating r2eff_data/500_600.00.r2eff.
Creating r2eff_data/500_666.67.r2eff.
Creating r2eff_data/500_733.33.r2eff.
Creating r2eff_data/500_800.00.r2eff.
Creating r2eff_data/500_866.67.r2eff.
Creating r2eff_data/500_933.33.r2eff.
Creating r2eff_data/500_1000.00.r2eff.
Creating r2eff_data/800_66.67.r2eff.
Creating r2eff_data/800_133.33.r2eff.
Creating r2eff_data/800_200.00.r2eff.
Creating r2eff_data/800_266.67.r2eff.
Creating r2eff_data/800_333.33.r2eff.
Creating r2eff_data/800_400.00.r2eff.
Creating r2eff_data/800_466.67.r2eff.
Creating r2eff_data/800_533.33.r2eff.
Creating r2eff_data/800_600.00.r2eff.
Creating r2eff_data/800_666.67.r2eff.
Creating r2eff_data/800_733.33.r2eff.
Creating r2eff_data/800_800.00.r2eff.
Creating r2eff_data/800_866.67.r2eff.
Creating r2eff_data/800_933.33.r2eff.
Creating r2eff_data/800_1000.00.r2eff.

