


                                     relax repository checkout

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2011 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'generate_distribution.py'
----------------------------------------------------------------------------------------------------
# Script for generating the distribution of PDB structures.

# Python module imports.
from math import acos
from numpy import array, cross, dot, float64, zeros
from numpy.linalg import norm

# relax module imports.
from maths_fns.rotation_matrix import axis_angle_to_R, R_random_hypersphere


# The number of structures.
N = 500

# Create a data pipe.
pipe.create('generate', 'N-state')

# The axis for the rotations (the pivot point to CoM axis).
pivot = array([ 37.254, 0.5, 16.7465])
com = array([ 26.83678091, -12.37906417,  28.34154128])
axis = pivot - com
axis = axis / norm(axis)

# Init a rotation matrix.
R = zeros((3, 3), float64)

# Generate N random rotations within the cone.
i = 0
while 1:
    # The random rotation matrix.
    R_random_hypersphere(R)

    # Skip the rotation if the angle is violated.
    new_axis = dot(R, axis)
    angle = acos(dot(axis, new_axis))
    if angle > (20.0 * 2.0 * pi / 360.0):
        continue

    # Load the PDB as a new model.
    structure.read_pdb('1J7P_1st_NH.pdb', dir='..', set_model_num=i+1)

    # Rotate.
    structure.rotate(R=R, origin=pivot, model=i+1)

    # Increment the index.
    i += 1

    # Termination.
    if i > N:
        break

# Save the PDB file.
structure.write_pdb('distribution.pdb', compress_type=2, force=True)

# Create a PDB for the motional axis system.
end_pt = axis * norm(pivot - com) + pivot
structure.delete()
structure.add_atom(atom_name='C', res_name='AXE', res_num=1, pos=pivot, element='C')
structure.add_atom(atom_name='N', res_name='AXE', res_num=1, pos=end_pt, element='N')
structure.connect_atom(index1=0, index2=1)
structure.write_pdb('axis.pdb', compress_type=0, force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='generate', pipe_type='N-state')

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=1, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 1 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.31633983,  0.83699389,  0.44650907],
       [-0.36947357,  0.54221959, -0.75464375],
       [-0.87373817,  0.07375057,  0.48077278]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=1)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=2, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 2 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.50201865,  0.63686169, -0.58513627],
       [ 0.80323508,  0.09252554, -0.58843218],
       [-0.32060986, -0.76540591, -0.5579992 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=2)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=3, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 3 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.20153465,  0.89399128,  0.40020416],
       [-0.14959596,  0.37570046, -0.91458745],
       [-0.9679901 , -0.24418999,  0.05802083]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=3)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=4, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 4 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.95954487, -0.14697598, -0.24014934],
       [ 0.09488445,  0.97184615, -0.21566643],
       [ 0.26508599,  0.18415518,  0.94647572]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=4)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=5, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 5 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.01698319, -0.06118102, -0.99798219],
       [ 0.98923657,  0.14611282,  0.00787696],
       [ 0.14533607, -0.98737426,  0.06300397]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=5)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=6, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 6 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.66984286,  0.43751733, -0.5999076 ],
       [ 0.60356247, -0.14973798, -0.7831289 ],
       [-0.43246142, -0.88665502, -0.16376812]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=6)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=7, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 7 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.84204845, -0.26583328, -0.4693475 ],
       [ 0.39338193,  0.89798823,  0.1971492 ],
       [ 0.36905971, -0.350642  ,  0.8607236 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=7)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=8, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 8 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.3003081 ,  0.93141063, -0.20564357],
       [ 0.45187385, -0.05094437, -0.89062601],
       [-0.84001492, -0.36038715, -0.4055811 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=8)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=9, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 9 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.36462349,  0.55473937, -0.74787295],
       [ 0.81120096, -0.20508774, -0.54762398],
       [-0.45716815, -0.80635182, -0.3752253 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=9)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=10, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 10 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.1874253 ,  0.93211056,  0.30990589],
       [-0.22765895,  0.34812663, -0.909384  ],
       [-0.95553292,  0.09988872,  0.27745105]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=10)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=11, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 11 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.03221346,  0.26029938, -0.96499043],
       [ 0.98223515, -0.1868265 , -0.01760601],
       [-0.18486862, -0.94728037, -0.26169352]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=11)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=12, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 12 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.1109777 , -0.18618695, -0.9762266 ],
       [ 0.99083389, -0.09685551, -0.09416587],
       [-0.07702047, -0.97772871,  0.19522914]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=12)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=13, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 13 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.48353957,  0.8533525 , -0.194882  ],
       [ 0.1501793 , -0.13846016, -0.9789152 ],
       [-0.86234312, -0.50261148, -0.06120491]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=13)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=14, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 14 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.32926357,  0.80276482, -0.497146  ],
       [ 0.3295871 , -0.39567972, -0.85721054],
       [-0.88484905, -0.44610111, -0.13429801]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=14)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=15, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 15 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.65036134, -0.34925907, -0.67457263],
       [ 0.49007767,  0.87141819,  0.02131255],
       [ 0.58039125, -0.34445384,  0.73790077]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=15)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=16, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 16 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.95722721,  0.18614245,  0.22151085],
       [-0.18011531,  0.9825081 , -0.04728974],
       [-0.22643884,  0.00536953,  0.97401059]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=16)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=17, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 17 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96705257,  0.00355018, -0.254552  ],
       [ 0.01285448,  0.99794632,  0.06275278],
       [ 0.25425201, -0.06395737,  0.96502092]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=17)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=18, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 18 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.45502322, -0.2708955 , -0.84827442],
       [ 0.74006061,  0.64483367,  0.19104928],
       [ 0.49524152, -0.71470634,  0.49389338]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=18)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=19, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 19 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.16801133,  0.98449507, -0.05041487],
       [-0.25029745, -0.09206925, -0.96378132],
       [-0.95347962, -0.14930746,  0.26188528]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=19)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=20, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 20 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.05150229,  0.14956921, -0.98740902],
       [ 0.99606425,  0.06372334,  0.06160632],
       [ 0.07213541, -0.98669569, -0.14569864]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=20)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=21, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 21 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.16055587,  0.30830726, -0.93763983],
       [ 0.9697594 ,  0.22618804, -0.09168248],
       [ 0.18381654, -0.9240052 , -0.33529968]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=21)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=22, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 22 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.50532123,  0.33347666, -0.79589181],
       [ 0.81583313, -0.11591608, -0.56655076],
       [-0.28118812, -0.93560503, -0.21348645]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=22)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=23, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 23 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.02769299,  0.87861629,  0.47672478],
       [-0.1375626 ,  0.46902059, -0.87240829],
       [-0.99010587, -0.0897391 ,  0.10787616]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=23)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=24, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 24 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.73817507, -0.50613901, -0.44600545],
       [ 0.53275103,  0.8429544 , -0.07486136],
       [ 0.41385251, -0.18234908,  0.891894  ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=24)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=25, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 25 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.00643635,  0.97733119,  0.21161835],
       [ 0.06483268,  0.21158533, -0.97520683],
       [-0.99787539,  0.00744301, -0.06472484]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=25)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=26, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 26 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.67596806, -0.2183603 , -0.7038366 ],
       [ 0.50728955,  0.83065501,  0.22949852],
       [ 0.53453203, -0.51218263,  0.67226815]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=26)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=27, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 27 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.9857789 ,  0.02789922, -0.1657154 ],
       [ 0.03898182,  0.92126031,  0.38698818],
       [ 0.16346369, -0.38794467,  0.90707142]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=27)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=28, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 28 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.49046028,  0.16697465, -0.85531759],
       [ 0.87131524,  0.07585089, -0.48482615],
       [-0.01607708, -0.98303922, -0.18268941]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=28)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=29, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 29 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.85189466,  0.48450339,  0.19882644],
       [-0.21020971,  0.66405899, -0.7175218 ],
       [-0.47967423,  0.56945774,  0.66755562]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=29)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=30, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 30 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.22374613,  0.90823466, -0.35362053],
       [ 0.32853363, -0.27130431, -0.90468759],
       [-0.91760739, -0.31859658, -0.23768234]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=30)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=31, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 31 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.39259649,  0.80505766, -0.44469107],
       [ 0.73152165, -0.01972374, -0.68153287],
       [-0.55744423, -0.59286856, -0.58117364]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=31)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=32, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 32 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.99553179,  0.04188019, -0.08463155],
       [-0.06730024,  0.94337519, -0.32482906],
       [ 0.0662354 ,  0.32907338,  0.94197855]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=32)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=33, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 33 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.59729075,  0.44759427,  0.66550968],
       [-0.2572792 ,  0.89286374, -0.36959674],
       [-0.75963884,  0.04953492,  0.64845595]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=33)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=34, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 34 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.61052265,  0.76132622,  0.21827615],
       [-0.58964011,  0.62092767, -0.51650108],
       [-0.52875952,  0.18663124,  0.82799889]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=34)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=35, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 35 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.00501986, -0.3797806 , -0.92506297],
       [ 0.97835335,  0.18951706, -0.08311445],
       [ 0.20688047, -0.90545567,  0.37060828]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=35)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=36, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 36 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.89440242, -0.31071768, -0.32171235],
       [ 0.40235201,  0.87310225,  0.27532766],
       [ 0.19533861, -0.37569533,  0.90592265]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=36)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=37, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 37 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96172304, -0.27056408,  0.04340364],
       [ 0.26615426,  0.95999936,  0.08696627],
       [-0.06519741, -0.0720854 ,  0.99526529]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=37)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=38, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 38 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96252467, -0.05641681,  0.26526102],
       [ 0.06394816,  0.99775608, -0.01983506],
       [-0.26354677,  0.03605469,  0.96397259]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=38)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=39, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 39 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.84022766, -0.47798468, -0.25602369],
       [ 0.52699596,  0.83100372,  0.17806764],
       [ 0.12764303, -0.28454081,  0.9501283 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=39)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=40, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 40 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.84882441, -0.36570529, -0.38178104],
       [ 0.51109903,  0.75230148,  0.41571657],
       [ 0.13518469, -0.54799829,  0.82548348]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=40)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=41, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 41 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.46289039,  0.78925779,  0.40349056],
       [-0.57726784,  0.61384474, -0.53847608],
       [-0.67267699,  0.01633328,  0.73975596]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=41)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=42, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 42 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.71891081, -0.27210445, -0.6396299 ],
       [ 0.5778298 ,  0.74542863,  0.3323385 ],
       [ 0.38636765, -0.60851896,  0.69312676]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=42)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=43, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 43 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.97818765, -0.05026214,  0.20155057],
       [ 0.05559666,  0.99823473, -0.02089082],
       [-0.20014476,  0.03164068,  0.9792553 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=43)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=44, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 44 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.97261826,  0.01969068, -0.23157286],
       [-0.03867315,  0.99622486, -0.0777201 ],
       [ 0.22916828,  0.08454764,  0.969708  ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=44)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=45, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 45 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.70235109, -0.45388837, -0.54835052],
       [ 0.70718138,  0.53281955,  0.46475566],
       [ 0.08122469, -0.71420492,  0.69520779]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=45)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=46, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 46 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.12643686,  0.61041464, -0.78192563],
       [ 0.84108684, -0.35193849, -0.41074595],
       [-0.52591506, -0.70960078, -0.46891372]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=46)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=47, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 47 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.63033346, -0.25975772, -0.73157752],
       [ 0.71903135,  0.55064578,  0.42400842],
       [ 0.29270062, -0.79329386,  0.5338644 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=47)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=48, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 48 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.32303941,  0.75407144,  0.5718582 ],
       [-0.29351112,  0.65428815, -0.69696359],
       [-0.89972038,  0.05729996,  0.43268921]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=48)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=49, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 49 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.16004775,  0.05822954, -0.9853903 ],
       [ 0.97721395,  0.13164702,  0.16649914],
       [ 0.13941886, -0.98958495, -0.03583291]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=49)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=50, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 50 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.98684376,  0.09197487, -0.13296621],
       [-0.11890845,  0.97012698, -0.21145788],
       [ 0.1095453 ,  0.22448669,  0.96830034]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=50)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=51, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 51 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.78044504, -0.46833215, -0.41421073],
       [ 0.60161484,  0.74286452,  0.29361861],
       [ 0.17019142, -0.47834851,  0.86152051]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=51)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=52, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 52 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.67097408, -0.38119565, -0.63599029],
       [ 0.70978373,  0.578306  ,  0.40220544],
       [ 0.21447804, -0.72128499,  0.65859481]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=52)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=53, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 53 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.00724095, -0.35076264, -0.9364364 ],
       [ 0.87721878,  0.4517751 , -0.16243914],
       [ 0.48003623, -0.82028338,  0.31096686]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=53)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=54, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 54 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.01711318,  0.98887094,  0.14778837],
       [-0.45009495,  0.13960564, -0.88200045],
       [-0.89281671, -0.05142497,  0.44747491]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=54)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=55, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 55 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.14774152,  0.70361544, -0.69505234],
       [ 0.80273569, -0.32521382, -0.49985136],
       [-0.57774376, -0.63179212, -0.51676964]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=55)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=56, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 56 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.60887945, -0.54474993, -0.57663969],
       [ 0.62842307,  0.77485465, -0.06844504],
       [ 0.48409737, -0.32069891,  0.81412649]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=56)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=57, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 57 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.93550118, -0.31807009, -0.15384717],
       [ 0.30993479,  0.94780283, -0.07490137],
       [ 0.16964067,  0.02238773,  0.98525166]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=57)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=58, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 58 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.33779589,  0.04392984, -0.94019365],
       [ 0.90431107, -0.26183851, -0.33713809],
       [-0.26098933, -0.96411139,  0.04872173]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=58)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=59, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 59 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.28178706, -0.39146659, -0.87598513],
       [ 0.90910629,  0.40085945,  0.1133025 ],
       [ 0.30679278, -0.82829077,  0.46884175]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=59)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=60, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 60 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.86749863, -0.13279807, -0.47938586],
       [ 0.20477243,  0.97359996,  0.10085323],
       [ 0.45333694, -0.18565505,  0.87179001]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=60)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=61, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 61 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.79064461, -0.29048378, -0.53898078],
       [ 0.41884655,  0.89869379,  0.13006549],
       [ 0.44659676, -0.32858582,  0.83221553]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=61)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=62, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 62 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.29494908, -0.51937309, -0.80203281],
       [ 0.94928594,  0.25494783,  0.18400491],
       [ 0.10890933, -0.81563055,  0.5682302 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=62)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=63, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 63 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.69197457, -0.56785122, -0.44577594],
       [ 0.71200499,  0.63881531,  0.29148566],
       [ 0.119248  , -0.51909536,  0.84635685]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=63)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=64, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 64 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.51292647,  0.45256331, -0.72944697],
       [ 0.74517348, -0.18712251, -0.64007941],
       [-0.4261724 , -0.87187821, -0.24125808]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=64)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=65, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 65 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.59426169,  0.71146928,  0.37505267],
       [-0.31686659,  0.63572075, -0.70388543],
       [-0.73922162,  0.29945049,  0.60322533]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=65)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=66, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 66 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.99635474,  0.0837291 ,  0.01632979],
       [-0.08377628,  0.9964821 ,  0.00222544],
       [-0.016086  , -0.00358538,  0.99986418]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=66)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=67, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 67 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.27031423, -0.05549462, -0.96117145],
       [ 0.93222447, -0.26457325, -0.24689783],
       [-0.24059875, -0.96276754,  0.12325135]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=67)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=68, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 68 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.27876461,  0.95785822,  0.06926705],
       [ 0.33905018,  0.16564185, -0.92607114],
       [-0.89851837, -0.23467086, -0.37093709]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=68)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=69, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 69 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.45673126,  0.12309646, -0.881047  ],
       [ 0.87382304,  0.2477984 , -0.41836497],
       [ 0.16682279, -0.96095953, -0.2207418 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=69)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=70, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 70 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.3605359 ,  0.01581895, -0.93261119],
       [ 0.78408682,  0.53640339,  0.3122167 ],
       [ 0.50519474, -0.84381347,  0.18098924]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=70)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=71, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 71 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.53606012, -0.21220401, -0.81707344],
       [ 0.68461165,  0.67556956,  0.27370176],
       [ 0.49390934, -0.70609859,  0.50742324]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=71)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=72, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 72 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.44739553,  0.88630401,  0.1195928 ],
       [-0.08235076,  0.09232798, -0.99231744],
       [-0.89053669, -0.45380694,  0.03168069]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=72)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=73, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 73 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.03012357,  0.93860183,  0.3436847 ],
       [-0.123242  ,  0.33772942, -0.93314   ],
       [-0.99191934, -0.0704659 ,  0.10550155]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=73)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=74, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 74 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.92828908, -0.22644572, -0.29496053],
       [ 0.30707837,  0.91415666,  0.26461382],
       [ 0.20971946, -0.33621412,  0.91813823]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=74)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=75, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 75 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.6180388 , -0.49980893, -0.60681058],
       [ 0.75281629,  0.59864553,  0.27366249],
       [ 0.22648549, -0.62595093,  0.74625047]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=75)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=76, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 76 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.77479882,  0.38308712,  0.5029225 ],
       [-0.10787519,  0.86394586, -0.49189479],
       [-0.62293637,  0.32686665,  0.71070984]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=76)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=77, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 77 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.30970651,  0.06010063, -0.94893087],
       [ 0.94405787, -0.09948261, -0.31441683],
       [-0.11329877, -0.9932226 , -0.02592806]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=77)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=78, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 78 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.43091731, -0.00808876, -0.90235516],
       [ 0.75249401,  0.55513144,  0.35437529],
       [ 0.49805926, -0.83172331,  0.24530249]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=78)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=79, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 79 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96982584,  0.21053934, -0.12292695],
       [-0.20425089,  0.97696352,  0.06183728],
       [ 0.13311432, -0.03486345,  0.99048731]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=79)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=80, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 80 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.84969639, -0.08724493, -0.5200042 ],
       [ 0.40937508,  0.73070898,  0.54632997],
       [ 0.33230722, -0.67709136,  0.65659668]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=80)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=81, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 81 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.77165956,  0.50344614,  0.38869463],
       [-0.23782777,  0.79518068, -0.55778638],
       [-0.58989786,  0.33797881,  0.73334224]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=81)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=82, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 82 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.80202319, -0.43091944, -0.41360275],
       [ 0.58576223,  0.70285885,  0.40357408],
       [ 0.11679644, -0.56594865,  0.81612543]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=82)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=83, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 83 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.60073655,  0.45222128, -0.65925072],
       [ 0.72808869, -0.03107142, -0.68477838],
       [-0.33015521, -0.89136439, -0.31059146]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=83)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=84, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 84 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.92478581, -0.00834069,  0.38039668],
       [ 0.09733052,  0.971682  , -0.21531571],
       [-0.36782873,  0.23614512,  0.89940953]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=84)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=85, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 85 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.92915775,  0.35338119,  0.10857076],
       [-0.36173418,  0.92966108,  0.06984734],
       [-0.07625128, -0.10417296,  0.99163186]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=85)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=86, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 86 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.48834546,  0.86018979,  0.146943  ],
       [-0.36560716,  0.35457268, -0.86058679],
       [-0.79236994,  0.36654024,  0.4876455 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=86)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=87, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 87 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.19451316,  0.58969092, -0.78385537],
       [ 0.94527078, -0.10073202, -0.31034853],
       [-0.26196905, -0.80132245, -0.5378239 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=87)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=88, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 88 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.92976003, -0.04864386, -0.36493844],
       [ 0.15898307,  0.94709753,  0.27880218],
       [ 0.33207028, -0.31723816,  0.88830698]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=88)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=89, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 89 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.46414353, -0.46012543, -0.7568721 ],
       [ 0.79224009,  0.59780587,  0.12240831],
       [ 0.39613941, -0.65643944,  0.64199753]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=89)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=90, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 90 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.54949515,  0.81640687, -0.17758067],
       [ 0.31660555,  0.00677613, -0.94853308],
       [-0.77318562, -0.57743736, -0.2622024 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=90)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=91, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 91 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.45104218,  0.85614306,  0.25215078],
       [-0.58005826,  0.49591645, -0.64621923],
       [-0.67830183,  0.14520999,  0.72029209]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=91)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=92, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 92 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.57307597, -0.00453804, -0.81948968],
       [ 0.6489801 ,  0.6131288 ,  0.45044191],
       [ 0.5004086 , -0.78996993,  0.35431447]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=92)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=93, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 93 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.43270486,  0.74294142, -0.51069026],
       [ 0.61644745, -0.16952297, -0.76893075],
       [-0.65784424, -0.64753379, -0.38463093]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=93)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=94, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 94 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.05707415,  0.98307868,  0.17406565],
       [ 0.09764219,  0.17901046, -0.97898992],
       [-0.99358369, -0.03887886, -0.10620683]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=94)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=95, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 95 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.97828768,  0.14029516,  0.15254667],
       [-0.14441252,  0.98938497,  0.01619878],
       [-0.14865477, -0.03787671,  0.98816351]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=95)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=96, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 96 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.55245211,  0.67880301,  0.48375938],
       [-0.55812987,  0.73229871, -0.39016618],
       [-0.61910235, -0.05445242,  0.7834202 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=96)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=97, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 97 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.36493434,  0.36854526, -0.85498381],
       [ 0.77467294, -0.3891842 , -0.49841499],
       [-0.51643467, -0.84422157, -0.14347536]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=97)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=98, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 98 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96461078,  0.11752673,  0.2360371 ],
       [-0.16059797,  0.97184389,  0.17241738],
       [-0.20912756, -0.20422274,  0.95632564]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=98)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=99, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 99 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.51185801,  0.64605021, -0.56623361],
       [ 0.57217466, -0.2352695 , -0.78566177],
       [-0.64079445, -0.7261318 , -0.24922898]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=99)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=100, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 100 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.8562889 , -0.02583   , -0.51585089],
       [ 0.12466238,  0.97955687,  0.15788489],
       [ 0.50122711, -0.19950228,  0.8420037 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=100)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=101, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 101 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.83531423,  0.54244786,  0.08944529],
       [-0.4783841 ,  0.79733772, -0.36796904],
       [-0.27092212,  0.26458057,  0.92552597]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=101)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=102, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 102 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.2411075 , -0.15270858, -0.95840871],
       [ 0.74233424,  0.66514384,  0.08076845],
       [ 0.62514562, -0.73093349,  0.27373197]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=102)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=103, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 103 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.33491963, -0.04603403, -0.94112152],
       [ 0.91234631, -0.26546335, -0.31169444],
       [-0.23548472, -0.96302133,  0.13090787]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=103)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=104, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 104 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.91683346, -0.21266238, -0.33792176],
       [ 0.36581403,  0.78654849,  0.49751539],
       [ 0.15998904, -0.57975528,  0.79892886]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=104)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=105, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 105 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.09944383, -0.2701274 , -0.95767537],
       [ 0.98995195,  0.07037748, -0.12264646],
       [ 0.10052895, -0.96024903,  0.26041454]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=105)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=106, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 106 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.90663078,  0.32692989,  0.26671611],
       [-0.34445373,  0.93858155,  0.02040368],
       [-0.24366424, -0.11036996,  0.96355914]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=106)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=107, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 107 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.49384416,  0.86834944,  0.0456857 ],
       [ 0.02503568,  0.06671655, -0.99745783],
       [-0.86918994, -0.49144495, -0.0546873 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=107)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=108, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 108 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.35717306,  0.90516381,  0.23044715],
       [-0.31830264,  0.34990837, -0.88104913],
       [-0.87812917,  0.24133507,  0.41309387]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=108)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=109, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 109 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.27822815,  0.91860648,  0.2806265 ],
       [-0.20606643,  0.34244574, -0.91666109],
       [-0.93815016,  0.19721321,  0.284572  ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=109)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=110, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 110 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.18182028,  0.85600378,  0.48394103],
       [-0.36093047,  0.51588877, -0.77690924],
       [-0.91469699, -0.0334112 ,  0.40275688]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=110)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=111, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 111 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.18775414,  0.88212299,  0.43198081],
       [-0.43418348,  0.46903754, -0.76908289],
       [-0.88104091, -0.04316044,  0.47106697]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=111)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=112, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 112 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.10742153, -0.04209233, -0.99332213],
       [ 0.98380601, -0.14868545, -0.10009183],
       [-0.14347945, -0.9879883 ,  0.0573827 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=112)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=113, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 113 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.79694679,  0.38826593,  0.46273684],
       [-0.19509199,  0.89044797, -0.4111466 ],
       [-0.5716773 ,  0.23738571,  0.78538723]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=113)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=114, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 114 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.35998361,  0.92720963, -0.10341229],
       [ 0.53294625,  0.11339289, -0.83851676],
       [-0.76575459, -0.35696548, -0.53497247]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=114)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=115, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 115 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.55713343, -0.33558865, -0.75959371],
       [ 0.73613929,  0.62291077,  0.2647284 ],
       [ 0.38431926, -0.70665581,  0.5940844 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=115)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=116, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 116 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.46279374,  0.76611106, -0.44597735],
       [ 0.58167246, -0.11720054, -0.80493551],
       [-0.66893878, -0.63193186, -0.39138603]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=116)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=117, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 117 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.32518768,  0.9204114 , -0.21701573],
       [ 0.61166701,  0.02970758, -0.79055735],
       [-0.72119099, -0.38982087, -0.57264583]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=117)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=118, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 118 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.42083362,  0.85432878, -0.3049941 ],
       [ 0.49023342, -0.06870457, -0.86887909],
       [-0.7632629 , -0.51517183, -0.38990733]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=118)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=119, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 119 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.97586439, -0.15364276,  0.15518564],
       [ 0.16280359,  0.98548631, -0.04808037],
       [-0.14554613,  0.0721847 ,  0.9867146 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=119)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=120, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 120 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.92810905, -0.22506767, -0.29657737],
       [ 0.18215923,  0.96924205, -0.1654928 ],
       [ 0.32470234,  0.09957105,  0.94056047]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=120)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=121, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 121 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.16391137,  0.16057479, -0.97331845],
       [ 0.97296266,  0.18906312, -0.13266046],
       [ 0.1627167 , -0.96874706, -0.18722286]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=121)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=122, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 122 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.03736008, -0.06998624, -0.99684811],
       [ 0.90341658,  0.42401652, -0.06362759],
       [ 0.42713312, -0.90294624,  0.04738544]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=122)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=123, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 123 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.27075733,  0.96043525,  0.06522735],
       [-0.01662317,  0.07241292, -0.9972362 ],
       [-0.9625041 ,  0.26892472,  0.0355718 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=123)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=124, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 124 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.74536876,  0.64070306,  0.18418739],
       [-0.48591228,  0.71129638, -0.50788455],
       [-0.45641501,  0.28906237,  0.84150359]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=124)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=125, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 125 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.10761205,  0.9616593 ,  0.25225192],
       [ 0.02846452,  0.25660149, -0.96609805],
       [-0.9937854 , -0.09678357, -0.05498658]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=125)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=126, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 126 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.85015612,  0.23292413,  0.47220856],
       [-0.22757361,  0.97128594, -0.06938212],
       [-0.4748103 , -0.04847657,  0.87875207]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=126)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=127, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 127 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.82850656,  0.5389134 ,  0.15214871],
       [-0.44298549,  0.7969613 , -0.41062945],
       [-0.34255035,  0.27280952,  0.89901848]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=127)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=128, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 128 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.80118491,  0.22522843,  0.55441401],
       [-0.19464489,  0.97417128, -0.11447134],
       [-0.5658764 , -0.01620114,  0.82433089]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=128)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=129, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 129 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.44685394,  0.70301369, -0.553257  ],
       [ 0.61908851, -0.20342736, -0.75851613],
       [-0.64579484, -0.68146098, -0.34432538]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=129)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=130, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 130 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.27368156,  0.14537354, -0.95077071],
       [ 0.96028989,  0.09704248, -0.26158382],
       [ 0.05423778, -0.98460616, -0.16615948]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=130)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=131, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 131 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.67090814, -0.24434817, -0.70012587],
       [ 0.69712254,  0.52969018,  0.48316506],
       [ 0.2527893 , -0.8122329 ,  0.52571407]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=131)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=132, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 132 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.31844581,  0.3837912 , -0.86677366],
       [ 0.8054766 , -0.37254994, -0.46088392],
       [-0.49979967, -0.84493246, -0.19049786]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=132)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=133, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 133 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.33289584, -0.56509593, -0.75488207],
       [ 0.93371716,  0.30937395,  0.18016667],
       [ 0.13172939, -0.76482308,  0.63062907]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=133)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=134, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 134 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.9436397 , -0.32936013, -0.03265004],
       [ 0.32911467,  0.92331713,  0.19791162],
       [-0.03503786, -0.19750287,  0.97967595]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=134)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=135, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 135 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.08862401,  0.98860713, -0.12166237],
       [ 0.08448525, -0.12916355, -0.98801772],
       [-0.99247571,  0.07728341, -0.09496971]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=135)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=136, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 136 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.91988785,  0.39001757, -0.04114159],
       [-0.37830042,  0.85476979, -0.35532717],
       [-0.10341725,  0.34242503,  0.93383616]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=136)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=137, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 137 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.71401722,  0.41317886, -0.56521026],
       [ 0.54681529, -0.17505571, -0.81874815],
       [-0.43723271, -0.89366589, -0.10093973]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=137)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=138, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 138 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.5742078 ,  0.56227296, -0.59509202],
       [ 0.43678615, -0.40439045, -0.80354603],
       [-0.69246174, -0.72133035, -0.01338889]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=138)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=139, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 139 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.39573832, -0.579706  , -0.71227251],
       [ 0.87144042,  0.48178569,  0.0920551 ],
       [ 0.28979781, -0.65713279,  0.6958403 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=139)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=140, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 140 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.34021019,  0.89698033,  0.28228234],
       [ 0.0904436 ,  0.26758449, -0.9592802 ],
       [-0.93598984,  0.35188753,  0.00990884]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=140)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=141, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 141 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.64555799, -0.2558715 , -0.71957255],
       [ 0.653212  ,  0.67315971,  0.34665559],
       [ 0.39568796, -0.69381971,  0.60170196]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=141)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=142, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 142 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.99246302, -0.06970476, -0.10078887],
       [ 0.10276959,  0.92142615,  0.37471624],
       [ 0.06674999, -0.38225004,  0.92164491]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=142)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=143, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 143 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.09471028,  0.19936258, -0.97533816],
       [ 0.99496545,  0.05120557, -0.08614959],
       [ 0.03276774, -0.97858702, -0.20320858]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=143)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=144, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 144 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.90314564,  0.24139894,  0.35504155],
       [-0.28923934,  0.95323675,  0.08763736],
       [-0.31728309, -0.18184128,  0.93073368]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=144)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=145, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 145 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.39273256, -0.38402611, -0.83563454],
       [ 0.91835058,  0.21210007,  0.33413435],
       [ 0.04892183, -0.89863091,  0.4359692 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=145)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=146, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 146 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.39064114, -0.42499673, -0.81656431],
       [ 0.719217  ,  0.69456684, -0.01743021],
       [ 0.57456627, -0.58047798,  0.57699126]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=146)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=147, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 147 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.37688101, -0.39937296, -0.83574036],
       [ 0.87963858,  0.43697074,  0.1878631 ],
       [ 0.29016664, -0.8059515 ,  0.51598983]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=147)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=148, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 148 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.39766151, -0.02601529, -0.91716331],
       [ 0.90501934,  0.17564268,  0.38741406],
       [ 0.15101433, -0.98411018,  0.09339068]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=148)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=149, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 149 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.73174419, -0.51162149, -0.45032643],
       [ 0.59746123,  0.79945402,  0.06255669],
       [ 0.32800993, -0.31482807,  0.89066984]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=149)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=150, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 150 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.39497189,  0.90617252, -0.15115745],
       [ 0.36266443,  0.00262223, -0.93191611],
       [-0.8440804 , -0.4229001 , -0.32967225]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=150)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=151, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 151 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.7580118 , -0.46589264, -0.45646703],
       [ 0.63453485,  0.68870504,  0.35078612],
       [ 0.15094247, -0.55554425,  0.81767166]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=151)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=152, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 152 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.18078493,  0.11276607, -0.97703665],
       [ 0.97560277,  0.14637611, -0.16362541],
       [ 0.12456343, -0.98278067, -0.13647748]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=152)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=153, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 153 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.5916839 ,  0.79742084,  0.11844906],
       [-0.57504862,  0.52044764, -0.6312316 ],
       [-0.56500377,  0.30537561,  0.76649624]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=153)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=154, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 154 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.47258586, -0.56040908, -0.68015018],
       [ 0.79369198,  0.60608515,  0.05209435],
       [ 0.38303478, -0.5644488 ,  0.73121947]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=154)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=155, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 155 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.6983893 , -0.25463175, -0.66889091],
       [ 0.6659045 ,  0.57373613,  0.47686272],
       [ 0.2623425 , -0.77845329,  0.5702516 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=155)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=156, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 156 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.97109285,  0.18243872,  0.15393115],
       [-0.0919426 ,  0.88098987, -0.46411573],
       [-0.22028446,  0.43654664,  0.87229685]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=156)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=157, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 157 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.33392087, -0.03987413, -0.94175735],
       [ 0.93071285,  0.14423108, -0.33611156],
       [ 0.14923283, -0.98874034, -0.01105041]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=157)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=158, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 158 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.66710975, -0.26801346, -0.69507796],
       [ 0.45556743,  0.88501117,  0.09598717],
       [ 0.5894259 , -0.38068886,  0.71249779]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=158)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=159, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 159 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.6580775 ,  0.60657531,  0.4460946 ],
       [-0.47835751,  0.7943404 , -0.37442946],
       [-0.58147063,  0.0330109 ,  0.8128974 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=159)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=160, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 160 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.75272125, -0.34081445, -0.56325503],
       [ 0.58516261,  0.73838742,  0.33521447],
       [ 0.30165449, -0.58191884,  0.75523178]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=160)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=161, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 161 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.95904346, -0.03480732, -0.28111224],
       [ 0.16950342,  0.86564346,  0.47109447],
       [ 0.22694544, -0.49944955,  0.83608966]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=161)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=162, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 162 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.62848496,  0.69380414, -0.3516283 ],
       [ 0.5994078 ,  0.14391157, -0.78740063],
       [-0.49569844, -0.7056382 , -0.50631787]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=162)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=163, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 163 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.36540165, -0.29899625, -0.88152304],
       [ 0.82303733,  0.54617061,  0.1559077 ],
       [ 0.43484616, -0.78249531,  0.44565672]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=163)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=164, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 164 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.53692679,  0.78749412,  0.30259318],
       [-0.23225773,  0.48280396, -0.84436763],
       [-0.81102773,  0.38308399,  0.44213197]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=164)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=165, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 165 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.19589232,  0.95806643,  0.20912893],
       [-0.01897651,  0.21692443, -0.97600394],
       [-0.98044178,  0.18722314,  0.06067459]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=165)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=166, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 166 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.89415054, -0.00381107, -0.44775024],
       [ 0.0808584 ,  0.98489867,  0.15308997],
       [ 0.44040518, -0.17308985,  0.88095583]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=166)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=167, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 167 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.88930243,  0.03767007, -0.45576546],
       [ 0.17410727,  0.8936627 ,  0.41358631],
       [ 0.42288041, -0.44715539,  0.78817778]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=167)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=168, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 168 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.36437347,  0.20423505, -0.90858132],
       [ 0.87926559, -0.24597384, -0.40790793],
       [-0.30679634, -0.94751513, -0.08995051]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=168)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=169, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 169 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.21314642,  0.53190251, -0.81954153],
       [ 0.73666386, -0.46351413, -0.4924236 ],
       [-0.64179043, -0.70868496, -0.29303698]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=169)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=170, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 170 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.14471929,  0.95274502, -0.26708286],
       [ 0.00300669, -0.26949975, -0.96299577],
       [-0.98946818, -0.1401671 ,  0.03613721]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=170)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=171, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 171 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.75453102, -0.36641932, -0.5444445 ],
       [ 0.62598724,  0.65093   ,  0.42945327],
       [ 0.19703528, -0.66485113,  0.7205207 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=171)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=172, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 172 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.44980978,  0.7323786 ,  0.51116802],
       [-0.46561337,  0.68070046, -0.56555378],
       [-0.76215179,  0.01638496,  0.64719099]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=172)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=173, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 173 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.29523166,  0.95177079,  0.08349027],
       [-0.34389131,  0.18738636, -0.92012234],
       [-0.89139051,  0.24293767,  0.38262809]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=173)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=174, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 174 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.1090894 ,  0.96933651, -0.22019591],
       [ 0.45832575, -0.14751708, -0.87645663],
       [-0.88206406, -0.19653359, -0.42817933]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=174)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=175, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 175 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.91603188, -0.23633558, -0.32408499],
       [ 0.2732057 ,  0.95920207,  0.07273262],
       [ 0.29367369, -0.15516727,  0.94322791]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=175)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=176, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 176 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.49680682, -0.45436924, -0.739413  ],
       [ 0.75168667,  0.65111783,  0.10494156],
       [ 0.43376277, -0.60794257,  0.66502307]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=176)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=177, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 177 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.64419856, -0.09778061, -0.75858234],
       [ 0.50886168,  0.79523963,  0.32962664],
       [ 0.57102364, -0.59835849,  0.56204903]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=177)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=178, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 178 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.60227561, -0.56367813, -0.56527078],
       [ 0.65162015,  0.75618633, -0.05977803],
       [ 0.46114561, -0.33233898,  0.82273661]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=178)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=179, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 179 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.99323873,  0.02196116, -0.11399357],
       [ 0.01351932,  0.95338086,  0.30146669],
       [ 0.11529985, -0.30096951,  0.94663789]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=179)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=180, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 180 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.01598385, -0.4015949 , -0.91567792],
       [ 0.92788911,  0.34714723, -0.13605364],
       [ 0.3725135 , -0.84747291,  0.37818429]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=180)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=181, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 181 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.23633255, -0.08815002, -0.96766549],
       [ 0.88174041,  0.43789112,  0.17545717],
       [ 0.40826557, -0.89469601,  0.18121336]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=181)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=182, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 182 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.95888995,  0.24618475,  0.14114933],
       [-0.17546744,  0.90527352, -0.38689926],
       [-0.22302744,  0.3462267 ,  0.91125509]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=182)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=183, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 183 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.19617916,  0.94593653,  0.25829794],
       [-0.01390557,  0.26607394, -0.96385232],
       [-0.98046947,  0.18549595,  0.06535195]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=183)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=184, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 184 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.05250618,  0.95903539,  0.27837785],
       [-0.46248382,  0.27041836, -0.84438299],
       [-0.88507165, -0.08440993,  0.45773698]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=184)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=185, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 185 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.41628268,  0.90920794,  0.00704691],
       [ 0.11436331,  0.06004715, -0.9916226 ],
       [-0.90201428, -0.41198941, -0.12897662]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=185)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=186, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 186 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.01191786,  0.12313747, -0.99231806],
       [ 0.9936064 , -0.10996384, -0.02557882],
       [-0.11226881, -0.98627842, -0.12103964]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=186)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=187, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 187 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.93151298, -0.12664639,  0.34094612],
       [ 0.12914166,  0.99150552,  0.01546716],
       [-0.34000882,  0.02962249,  0.93995559]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=187)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=188, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 188 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.46539866,  0.82842511, -0.31163426],
       [ 0.64081714,  0.07250531, -0.76426198],
       [-0.61053868, -0.55538708, -0.56461289]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=188)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=189, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 189 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.52563608,  0.57518775, -0.62679005],
       [ 0.74799448, -0.03847636, -0.66258873],
       [-0.40522952, -0.81711604, -0.4100127 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=189)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=190, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 190 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96271852,  0.26831448, -0.03435686],
       [-0.26715666,  0.92317859, -0.2763487 ],
       [-0.04243084,  0.27522468,  0.96044313]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=190)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=191, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 191 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.59318238, -0.23647326, -0.76955511],
       [ 0.75456405,  0.49653917,  0.42904772],
       [ 0.28065595, -0.83518216,  0.47297251]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=191)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=192, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 192 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.16061103,  0.97810224, -0.13236352],
       [ 0.41881811, -0.05389688, -0.90646926],
       [-0.89375359, -0.2010252 , -0.4009905 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=192)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=193, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 193 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.29425587, -0.07107045, -0.95308052],
       [ 0.82728545,  0.51827543,  0.21677028],
       [ 0.47855226, -0.85225558,  0.21130113]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=193)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=194, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 194 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.97303627,  0.22099297,  0.06604939],
       [-0.2303895 ,  0.94488803,  0.23260972],
       [-0.01100416, -0.24155478,  0.97032479]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=194)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=195, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 195 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.33262027,  0.81769293,  0.46983191],
       [-0.43969394,  0.57520069, -0.68979229],
       [-0.83428592,  0.02285665,  0.55085803]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=195)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=196, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 196 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.99560565, -0.07697164,  0.05333617],
       [ 0.08130816,  0.99309442, -0.0845722 ],
       [-0.04645819,  0.08853723,  0.99498884]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=196)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=197, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 197 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.77962808, -0.22371787, -0.58491911],
       [ 0.47939678,  0.81416883,  0.32757876],
       [ 0.40293769, -0.53579794,  0.74199851]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=197)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=198, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 198 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.43501559,  0.48885003, -0.75616604],
       [ 0.82722225, -0.11469712, -0.55004356],
       [-0.35561888, -0.8647949 , -0.35449259]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=198)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=199, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 199 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.06087238,  0.90028122,  0.43103164],
       [-0.40746106,  0.41662596, -0.81264894],
       [-0.91119155, -0.12616073,  0.39219056]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=199)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=200, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 200 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.95155425,  0.26683941, -0.15277839],
       [-0.29088993,  0.94223236, -0.16607596],
       [ 0.09963713,  0.20247198,  0.97420611]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=200)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=201, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 201 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.757764  , -0.38276145, -0.52847648],
       [ 0.56290651,  0.79307946,  0.23272567],
       [ 0.33004542, -0.47383398,  0.81642598]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=201)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=202, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 202 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.26446495,  0.9597826 , -0.09421067],
       [ 0.18282564, -0.04602113, -0.98206764],
       [-0.94690711, -0.27694659, -0.16330189]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=202)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=203, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 203 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.65801409,  0.66186249,  0.35910376],
       [-0.42757074,  0.72096547, -0.54533664],
       [-0.61983928,  0.20529693,  0.75739847]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=203)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=204, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 204 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.47497569,  0.48832845, -0.73207474],
       [ 0.67973373, -0.32475593, -0.657644  ],
       [-0.55889189, -0.80998081, -0.17768214]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=204)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=205, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 205 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.98901348,  0.00343504, -0.14778545],
       [ 0.05414317,  0.92184213,  0.38376503],
       [ 0.1375531 , -0.38755036,  0.91152831]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=205)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=206, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 206 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.93876326,  0.30793328, -0.15459829],
       [-0.3315602 ,  0.9294007 , -0.16211778],
       [ 0.0937623 ,  0.20344886,  0.97458565]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=206)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=207, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 207 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.50549578,  0.78704705,  0.35359716],
       [-0.61547218,  0.61612211, -0.49151555],
       [-0.6047049 ,  0.03082983,  0.79585269]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=207)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=208, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 208 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.57449174,  0.29599426, -0.7631164 ],
       [ 0.68092222, -0.34453541, -0.64625094],
       [-0.45420719, -0.89088874, -0.00361632]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=208)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=209, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 209 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.31412545,  0.51709426, -0.79620269],
       [ 0.76613475, -0.35721875, -0.53425866],
       [-0.56068061, -0.77782279, -0.28395238]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=209)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=210, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 210 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.98293725,  0.16700607, -0.07709298],
       [-0.18382751,  0.90662027, -0.3797988 ],
       [ 0.00646535,  0.3874902 ,  0.92185115]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=210)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=211, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 211 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.77572857, -0.16318743, -0.60960237],
       [ 0.42226992,  0.85208889,  0.30924526],
       [ 0.46897047, -0.49730713,  0.72989884]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=211)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=212, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 212 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.76791796, -0.14439859, -0.62406014],
       [ 0.27699997,  0.95331315,  0.12027076],
       [ 0.57755781, -0.26522272,  0.77206469]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=212)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=213, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 213 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.57092896,  0.18255426, -0.80044617],
       [ 0.80252374, -0.08157992, -0.59101638],
       [-0.17319289, -0.97980542, -0.09992779]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=213)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=214, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 214 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.30801735,  0.89156243,  0.33202672],
       [ 0.10993097,  0.31330368, -0.94326878],
       [-0.9450082 ,  0.32704317, -0.00150735]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=214)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=215, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 215 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.61633111,  0.41497671,  0.66927595],
       [-0.11661691,  0.88861388, -0.44358299],
       [-0.77880451,  0.1953451 ,  0.59607368]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=215)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=216, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 216 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.05690365,  0.96757631,  0.24608547],
       [-0.12947775,  0.23725123, -0.96278106],
       [-0.98994822, -0.08664835,  0.11177915]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=216)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=217, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 217 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.79154897,  0.3804204 ,  0.47825782],
       [-0.32134964,  0.92478256, -0.20374402],
       [-0.51979288,  0.00758539,  0.85425864]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=217)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=218, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 218 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.58156078, -0.03335936, -0.81281868],
       [ 0.50838807,  0.79492211,  0.33111993],
       [ 0.63508159, -0.60579369,  0.47925503]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=218)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=219, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 219 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.10867899,  0.93140136,  0.34739081],
       [ 0.13642665,  0.36012874, -0.92287326],
       [-0.98467083, -0.05290357, -0.1662064 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=219)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=220, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 220 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.04499654,  0.98962607,  0.13643883],
       [-0.02695411,  0.13773014, -0.99010297],
       [-0.99862345,  0.04087362,  0.03287187]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=220)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=221, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 221 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.37999187,  0.7136922 ,  0.5884298 ],
       [-0.38305359,  0.70045106, -0.60219453],
       [-0.84194781,  0.00342888,  0.53954807]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=221)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=222, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 222 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.24861025, -0.49129615, -0.83475807],
       [ 0.86509406,  0.50025927, -0.03678216],
       [ 0.4356664 , -0.71299983,  0.54938696]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=222)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=223, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 223 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.84149565,  0.51840227,  0.15213202],
       [-0.41896998,  0.80394957, -0.42205361],
       [-0.34110002,  0.29141753,  0.89371505]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=223)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=224, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 224 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.45041912, -0.05411317, -0.89117584],
       [ 0.81232685,  0.43902011,  0.3839094 ],
       [ 0.37046956, -0.8968462 ,  0.24170063]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=224)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=225, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 225 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.04482633, -0.24663877, -0.9680702 ],
       [ 0.99239064,  0.12223535,  0.01481014],
       [ 0.11467964, -0.96136769,  0.25024137]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=225)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=226, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 226 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.9283264 ,  0.32199349,  0.18582328],
       [-0.33184465,  0.94303564,  0.02372583],
       [-0.16759841, -0.08368978,  0.98229669]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=226)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=227, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 227 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.08703589,  0.14966493, -0.98489855],
       [ 0.97851211,  0.17265811,  0.1127086 ],
       [ 0.18691925, -0.97354486, -0.1314215 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=227)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=228, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 228 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.46538079,  0.78316685, -0.41239594],
       [ 0.24403282, -0.33433578, -0.9103118 ],
       [-0.85080474, -0.52427976, -0.03552497]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=228)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=229, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 229 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96633813,  0.23902809, -0.09516398],
       [-0.2459657 ,  0.96679865, -0.06929094],
       [ 0.07544193,  0.09036555,  0.99304712]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=229)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=230, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 230 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.63612956,  0.76244451,  0.11839574],
       [-0.3875579 ,  0.44842147, -0.80542974],
       [-0.66718667,  0.46647246,  0.58074555]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=230)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=231, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 231 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.08101652,  0.94841872,  0.30649348],
       [-0.14693358,  0.31550922, -0.93747771],
       [-0.98582293,  0.030917  ,  0.16491601]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=231)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=232, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 232 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.24704445, -0.15358981, -0.95675452],
       [ 0.96817507,  0.00171135, -0.25026808],
       [ 0.04007597, -0.98813321,  0.14827904]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=232)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=233, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 233 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.64213553,  0.43321951,  0.63244195],
       [-0.30401385,  0.9012688 , -0.30869099],
       [-0.70373115,  0.00595034,  0.71044145]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=233)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=234, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 234 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.08134611,  0.36028759, -0.92928772],
       [ 0.93316683, -0.29999606, -0.19799504],
       [-0.35011781, -0.8832866 , -0.31180492]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=234)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=235, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 235 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.54981429,  0.43089616, -0.71556464],
       [ 0.6932608 , -0.24245645, -0.67867837],
       [-0.46593317, -0.86921998, -0.16541739]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=235)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=236, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 236 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.2931144 , -0.17273369, -0.9403441 ],
       [ 0.92178201,  0.31212294,  0.22999393],
       [ 0.25377526, -0.9342068 ,  0.25071053]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=236)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=237, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 237 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.92372466, -0.05115013, -0.37962668],
       [ 0.2216331 ,  0.87968109,  0.42076115],
       [ 0.31242842, -0.47280528,  0.82391968]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=237)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=238, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 238 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.50959446, -0.1126202 , -0.85301241],
       [ 0.54928707,  0.80566634,  0.22177795],
       [ 0.66226671, -0.5815655 ,  0.47242393]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=238)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=239, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 239 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.28098573,  0.90194444, -0.32793788],
       [ 0.65898362, -0.06709132, -0.74915909],
       [-0.69770166, -0.4266087 , -0.57551491]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=239)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=240, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 240 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.26935401,  0.91798093,  0.29113471],
       [-0.47053419,  0.38921365, -0.79190297],
       [-0.84026543,  0.0763134 ,  0.53677767]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=240)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=241, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 241 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.39743236,  0.02592479, -0.91726519],
       [ 0.77840317,  0.51982116,  0.35195804],
       [ 0.4859383 , -0.85388164,  0.18641382]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=241)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=242, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 242 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.95409503, -0.02586978,  0.29838469],
       [ 0.05587822,  0.99414534, -0.09248067],
       [-0.2942453 ,  0.10490856,  0.94995468]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=242)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=243, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 243 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.09909213, -0.0789122 , -0.99194436],
       [ 0.99447926, -0.04243663, -0.0959694 ],
       [-0.03452162, -0.99597791,  0.08268169]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=243)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=244, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 244 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.67646193,  0.67995667,  0.28294556],
       [-0.18451058,  0.52840374, -0.82870099],
       [-0.71299025,  0.50837823,  0.48290421]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=244)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=245, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 245 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.01934083,  0.33782459, -0.94101035],
       [ 0.99786636,  0.05218031,  0.03924224],
       [ 0.0623592 , -0.93976154, -0.33609459]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=245)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=246, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 246 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.98962008, -0.14332735, -0.010458  ],
       [ 0.13784266,  0.9261311 ,  0.35111336],
       [-0.04063867, -0.34891039,  0.93627455]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=246)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=247, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 247 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.55733996,  0.78447418,  0.27197872],
       [-0.58789348,  0.60417371, -0.53791764],
       [-0.58630489,  0.13990847,  0.79791741]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=247)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=248, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 248 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96511472,  0.25794446, -0.04492483],
       [-0.25796927,  0.90744463, -0.3316566 ],
       [-0.04478218,  0.3316759 ,  0.94232991]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=248)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=249, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 249 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.47641828,  0.87160128,  0.1154852 ],
       [-0.24663704,  0.25856213, -0.93397848],
       [-0.84391693,  0.41648149,  0.33815289]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=249)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=250, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 250 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.11576101,  0.91968804,  0.37519767],
       [ 0.1748668 ,  0.39070724, -0.90375299],
       [-0.97776326, -0.03900974, -0.20605157]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=250)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=251, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 251 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.24999269,  0.25908099, -0.93294196],
       [ 0.96819922,  0.07653377, -0.23818661],
       [ 0.00969194, -0.96281858, -0.2699749 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=251)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=252, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 252 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.27323128,  0.64379189, -0.71475637],
       [ 0.66297124, -0.41235263, -0.62484754],
       [-0.69700345, -0.64459081, -0.31414787]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=252)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=253, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 253 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.28906462,  0.88966674,  0.35346109],
       [-0.33532861,  0.4399306 , -0.8330761 ],
       [-0.89665844,  0.12228721,  0.42549909]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=253)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=254, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 254 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.42429705,  0.25551736, -0.86872487],
       [ 0.76058559, -0.42006194, -0.49503284],
       [-0.49140774, -0.87078059, -0.01611178]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=254)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=255, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 255 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.54042313, -0.48719456, -0.68599147],
       [ 0.72593244,  0.68219098,  0.08739314],
       [ 0.42539973, -0.54521273,  0.72234212]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=255)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=256, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 256 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.29653478, -0.11074884, -0.94857884],
       [ 0.91381821,  0.32150745,  0.24813151],
       [ 0.27749489, -0.94040824,  0.19654245]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=256)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=257, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 257 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.75219488,  0.64625686,  0.12866598],
       [-0.47205347,  0.66472243, -0.57905925],
       [-0.45974817,  0.37482818,  0.8050686 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=257)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=258, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 258 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.63080706, -0.27203343, -0.72669132],
       [ 0.44625595,  0.89333707,  0.05295763],
       [ 0.63477404, -0.35769637,  0.68491987]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=258)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=259, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 259 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.97229805, -0.08722416, -0.21686042],
       [ 0.17737262,  0.87956425,  0.44148123],
       [ 0.15223484, -0.46771644,  0.87066979]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=259)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=260, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 260 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.62075329,  0.46832439, -0.62875879],
       [ 0.55377188, -0.30579071, -0.77448612],
       [-0.55497934, -0.82895374, -0.06952429]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=260)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=261, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 261 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.9496092 ,  0.29806452, -0.0969531 ],
       [-0.31325798,  0.89208874, -0.32564877],
       [-0.01057358,  0.33961041,  0.94050676]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=261)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=262, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 262 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.45059996,  0.65819601, -0.60310669],
       [ 0.78352177, -0.03219518, -0.6205297 ],
       [-0.4278473 , -0.75215788, -0.50120376]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=262)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=263, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 263 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.3460969 ,  0.87854947, -0.3291926 ],
       [ 0.10641984, -0.31185088, -0.94415245],
       [-0.93214363, -0.36180086,  0.01443553]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=263)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=264, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 264 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.1633819 ,  0.98651318, -0.00990486],
       [ 0.13152207,  0.01182975, -0.99124265],
       [-0.97775677, -0.16325381, -0.13168103]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=264)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=265, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 265 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.17590087,  0.97992954, -0.0937922 ],
       [ 0.11035705, -0.07504753, -0.99105459],
       [-0.97820254, -0.18467799, -0.09494121]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=265)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=266, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 266 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.29139163,  0.80086603, -0.52316777],
       [ 0.77810851, -0.11969694, -0.61661964],
       [-0.55645131, -0.5867591 , -0.58828199]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=266)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=267, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 267 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96128436,  0.24323626, -0.12949323],
       [-0.23040177,  0.96725176,  0.10648499],
       [ 0.15115357, -0.07252688,  0.98584606]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=267)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=268, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 268 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.16684579,  0.9741733 ,  0.15214748],
       [-0.17993874,  0.12163491, -0.97612858],
       [-0.96942485, -0.19024017,  0.15499724]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=268)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=269, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 269 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.32342819, -0.29022733, -0.90064549],
       [ 0.75034309,  0.65856619,  0.05723473],
       [ 0.57652359, -0.69430445,  0.43076894]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=269)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=270, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 270 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.02889556,  0.99443874,  0.10127511],
       [-0.03870984,  0.10012816, -0.99422125],
       [-0.99883262, -0.03264892,  0.03560131]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=270)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=271, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 271 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.41789196,  0.64361039, -0.64119573],
       [ 0.66626272, -0.26269618, -0.69791454],
       [-0.61762472, -0.71885769, -0.31903499]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=271)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=272, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 272 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.82509191,  0.55345061,  0.11364756],
       [-0.52669891,  0.82623759, -0.19979916],
       [-0.20447885,  0.10499462,  0.97322378]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=272)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=273, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 273 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.11664522, -0.49509902, -0.86097088],
       [ 0.94842748,  0.31280216, -0.05138212],
       [ 0.29475279, -0.81057496,  0.50605239]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=273)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=274, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 274 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.62213811,  0.75454775,  0.20881059],
       [-0.53506072,  0.60448903, -0.59017205],
       [-0.5715367 ,  0.25544218,  0.77980452]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=274)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=275, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 275 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.21474194,  0.0707287 , -0.97410644],
       [ 0.94457901,  0.26861092, -0.1887291 ],
       [ 0.24830706, -0.96064854, -0.12449088]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=275)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=276, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 276 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.0864517 , -0.03786345, -0.99553627],
       [ 0.9865746 , -0.13571847,  0.09083528],
       [-0.13855199, -0.99002366,  0.02562203]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=276)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=277, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 277 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.90897379, -0.34617076, -0.23223362],
       [ 0.41244073,  0.82770178,  0.38052912],
       [ 0.06049213, -0.4416736 ,  0.89513414]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=277)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=278, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 278 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.06213665, -0.14920931, -0.98685137],
       [ 0.99724471,  0.03086246, -0.06745739],
       [ 0.04052193, -0.98832388,  0.14688051]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=278)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=279, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 279 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.37546374, -0.36864843, -0.85036775],
       [ 0.76867635,  0.63648119,  0.06346938],
       [ 0.51784519, -0.67748803,  0.52234694]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=279)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=280, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 280 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.0692483 ,  0.98317158, -0.16905124],
       [ 0.09413626, -0.16226193, -0.98224713],
       [-0.99314804, -0.0839328 , -0.08131573]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=280)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=281, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 281 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.342023  ,  0.77521279, -0.53109829],
       [ 0.72848109, -0.13827392, -0.67096619],
       [-0.59357861, -0.61638093, -0.517435  ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=281)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=282, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 282 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.02511335,  0.99908417, -0.03464311],
       [-0.18496153, -0.03869941, -0.9819835 ],
       [-0.98242483, -0.01825325,  0.18576401]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=282)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=283, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 283 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.85309737,  0.24816378,  0.45895492],
       [-0.25679758,  0.9654313 , -0.04469227],
       [-0.45418046, -0.07973165,  0.88733476]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=283)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=284, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 284 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.47359358,  0.64703524, -0.5975404 ],
       [ 0.67244839, -0.17250744, -0.71975993],
       [-0.5687902 , -0.74268875, -0.35339938]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=284)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=285, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 285 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.83542396,  0.53200213,  0.13798746],
       [-0.4529222 ,  0.80862947, -0.37547285],
       [-0.31133308,  0.25118143,  0.91650401]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=285)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=286, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 286 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96660273,  0.19882024,  0.16170863],
       [-0.20790219,  0.97728346,  0.04115484],
       [-0.14985275, -0.07339996,  0.98598002]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=286)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=287, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 287 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.10768451,  0.06482173, -0.99206965],
       [ 0.88760411,  0.44323503,  0.1253062 ],
       [ 0.44784259, -0.89405864, -0.00980648]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=287)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=288, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 288 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.27571565,  0.66906114, -0.6901725 ],
       [ 0.68734488, -0.3647016 , -0.62813196],
       [-0.6719657 , -0.64757235, -0.35932181]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=288)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=289, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 289 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.93334999,  0.35748644,  0.03257684],
       [-0.31203597,  0.85283879, -0.41868788],
       [-0.17745803,  0.38061718,  0.90754571]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=289)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=290, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 290 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.71270282,  0.56122645,  0.42080823],
       [-0.36889792,  0.8101173 , -0.45565807],
       [-0.59663139,  0.16951351,  0.78440816]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=290)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=291, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 291 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.86804766,  0.40866466,  0.28193343],
       [-0.18240763,  0.79066037, -0.58445157],
       [-0.4617583 ,  0.45590501,  0.76087443]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=291)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=292, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 292 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.61183091,  0.65490149,  0.44358425],
       [-0.06033197,  0.5978016 , -0.79937056],
       [-0.78868434,  0.46231731,  0.405265  ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=292)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=293, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 293 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.10501579,  0.13808347, -0.98483737],
       [ 0.93492291,  0.32383008,  0.14509731],
       [ 0.3389555 , -0.93598453, -0.09509013]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=293)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=294, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 294 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.2989201 ,  0.95410983, -0.01792202],
       [ 0.02966269, -0.00948167, -0.99951499],
       [-0.95381702, -0.29930673, -0.02546721]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=294)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=295, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 295 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.09910681,  0.93543216,  0.3393295 ],
       [-0.15004121,  0.3511575 , -0.92421645],
       [-0.98369989,  0.04068274,  0.17515547]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=295)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=296, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 296 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.07497379,  0.90384832,  0.4212329 ],
       [-0.10714393,  0.427278  , -0.89774924],
       [-0.99141268,  0.02217511,  0.12887651]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=296)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=297, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 297 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.34806835,  0.93565788,  0.05824741],
       [-0.35296516,  0.18835798, -0.9164807 ],
       [-0.86848375,  0.29843862,  0.39581608]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=297)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=298, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 298 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.62268716,  0.77465936,  0.11028857],
       [-0.39342698,  0.43179873, -0.81164344],
       [-0.67636965,  0.46200945,  0.57364742]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=298)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=299, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 299 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.98267971,  0.06237186, -0.17450026],
       [-0.07004463,  0.99681384, -0.03815643],
       [ 0.17156439,  0.04971835,  0.98391755]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=299)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=300, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 300 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.94425891, -0.32641632, -0.04274925],
       [ 0.32434854,  0.94467529, -0.04885303],
       [ 0.05633059,  0.03226426,  0.99789072]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=300)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=301, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 301 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.09036614,  0.99161476,  0.09238031],
       [-0.39615526,  0.12089636, -0.91018958],
       [-0.91372587,  0.04565338,  0.40375835]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=301)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=302, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 302 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.15586553,  0.9849269 ,  0.07499959],
       [ 0.00509977,  0.07512415, -0.99716115],
       [-0.98776512,  0.15580553,  0.00668637]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=302)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=303, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 303 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.38592107,  0.08769314, -0.91835442],
       [ 0.91092264, -0.12120551, -0.39437185],
       [-0.14589333, -0.98874624, -0.03310591]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=303)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=304, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 304 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ -3.13670615e-02,   9.74008212e-01,   2.24330359e-01],
       [  1.39017361e-01,   2.26510720e-01,  -9.64036860e-01],
       [ -9.89793050e-01,   9.46810987e-04,  -1.42509027e-01]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=304)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=305, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 305 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.81391056, -0.33095117, -0.47751536],
       [ 0.42149869,  0.90201974,  0.09326976],
       [ 0.39986054, -0.27718534,  0.87365888]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=305)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=306, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 306 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.48616531,  0.81311163,  0.32014491],
       [-0.5743828 ,  0.57343319, -0.58417358],
       [-0.65858005,  0.1001192 ,  0.74582066]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=306)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=307, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 307 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.28211025,  0.03435203, -0.95876678],
       [ 0.91074079,  0.30458248,  0.27889195],
       [ 0.30160407, -0.9518663 ,  0.05464004]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=307)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=308, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 308 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.49205122,  0.82584242, -0.27544492],
       [ 0.53818017,  0.03986087, -0.8418867 ],
       [-0.68428627, -0.56249037, -0.4640656 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=308)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=309, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 309 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.25257391, -0.31735356, -0.91405314],
       [ 0.95943141,  0.20446975,  0.19412235],
       [ 0.1252908 , -0.92600153,  0.3561227 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=309)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=310, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 310 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96820857, -0.17175554,  0.18185763],
       [ 0.15505151,  0.98257456,  0.10250009],
       [-0.19629364, -0.07104416,  0.97796806]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=310)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=311, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 311 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.68441439,  0.59534343, -0.42088376],
       [ 0.47081929, -0.07987911, -0.87860601],
       [-0.55669214, -0.79949079, -0.22562876]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=311)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=312, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 312 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.79341126,  0.59587142,  0.12424098],
       [-0.46493349,  0.72501187, -0.50812857],
       [-0.39285548,  0.34539114,  0.85227316]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=312)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=313, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 313 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.85876961, -0.0859401 , -0.50510301],
       [ 0.36432412,  0.79558699,  0.48405504],
       [ 0.36025364, -0.59971297,  0.71453598]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=313)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=314, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 314 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.57795444, -0.34858562, -0.73787311],
       [ 0.7792901 ,  0.50413228,  0.37223325],
       [ 0.2422305 , -0.79015107,  0.56301481]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=314)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=315, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 315 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.26566057,  0.03772902, -0.96332808],
       [ 0.90682779,  0.32940052,  0.26298034],
       [ 0.32724276, -0.94343618,  0.053295  ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=315)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=316, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 316 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.94650745, -0.23176173,  0.22452202],
       [ 0.23976727,  0.97079158, -0.00868142],
       [-0.21595207,  0.06205006,  0.97443034]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=316)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=317, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 317 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.63592817, -0.18404137, -0.74948258],
       [ 0.70715053,  0.52790304,  0.47037911],
       [ 0.30908491, -0.82912433,  0.46585336]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=317)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=318, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 318 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.36060895,  0.28295891, -0.88876062],
       [ 0.91102598, -0.09744966, -0.40066848],
       [-0.19998214, -0.95416865, -0.2226417 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=318)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=319, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 319 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.50168671,  0.74232496,  0.44414423],
       [-0.47561173,  0.66556463, -0.57516711],
       [-0.72256759,  0.07731349,  0.68696339]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=319)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=320, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 320 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.65202396, -0.28877456, -0.70105207],
       [ 0.6924641 ,  0.60339132,  0.39549006],
       [ 0.30880126, -0.74332239,  0.59339161]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=320)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=321, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 321 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.75452911,  0.27920825,  0.59390957],
       [-0.09258635,  0.94121948, -0.32485946],
       [-0.64970269,  0.190128  ,  0.73602837]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=321)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=322, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 322 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.21289664, -0.24973203, -0.94462105],
       [ 0.88488764,  0.45922268,  0.07802811],
       [ 0.41430529, -0.85249542,  0.31875175]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=322)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=323, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 323 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.89843084,  0.21243354,  0.38430978],
       [-0.08015264,  0.939824  , -0.33212408],
       [-0.43173785,  0.26758707,  0.86139398]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=323)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=324, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 324 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.28291222,  0.10228081, -0.95367673],
       [ 0.91344648, -0.27452372, -0.30042012],
       [-0.2925341 , -0.95612518, -0.01576194]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=324)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=325, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 325 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.81913963, -0.39112514, -0.41956095],
       [ 0.56570574,  0.67176984,  0.47822829],
       [ 0.09480129, -0.62908378,  0.77153504]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=325)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=326, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 326 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.99751153,  0.05246078,  0.04710222],
       [-0.05145966,  0.99842781, -0.02222182],
       [-0.04819394,  0.01974266,  0.99864287]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=326)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=327, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 327 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.391137  ,  0.65565402,  0.64585575],
       [-0.31338576,  0.75470993, -0.57636992],
       [-0.86533301,  0.02303761,  0.50066761]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=327)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=328, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 328 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.2103423 ,  0.11784568, -0.9704991 ],
       [ 0.96673317,  0.12271661,  0.22442731],
       [ 0.14554415, -0.98542023, -0.08811283]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=328)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=329, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 329 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.09419069, -0.22127522, -0.97065204],
       [ 0.98524244,  0.16068336,  0.05897625],
       [ 0.14291765, -0.9618826 ,  0.23314461]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=329)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=330, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 330 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.94219943, -0.00202366,  0.33504648],
       [ 0.1251197 ,  0.92976533, -0.34623907],
       [-0.31081393,  0.36814717,  0.87627756]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=330)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=331, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 331 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.02056259, -0.46697861, -0.8840295 ],
       [ 0.96782853,  0.23107831, -0.09955275],
       [ 0.25076905, -0.85354191,  0.45670679]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=331)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=332, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 332 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.46378111,  0.76402055,  0.44853057],
       [-0.42706601,  0.63636254, -0.64238411],
       [-0.77622271,  0.10637345,  0.62142014]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=332)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=333, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 333 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.405254  ,  0.5081093 , -0.75999614],
       [ 0.89970624,  0.07420208, -0.4301427 ],
       [-0.16216621, -0.85809032, -0.48721979]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=333)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=334, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 334 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.22243611,  0.83330428, -0.50608908],
       [ 0.53318225, -0.33061654, -0.77872292],
       [-0.81623456, -0.44305381, -0.37076199]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=334)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=335, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 335 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.47721882,  0.68394219, -0.55180184],
       [ 0.60619846, -0.19839689, -0.77017017],
       [-0.63622765, -0.70204113, -0.31992597]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=335)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=336, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 336 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.28424757,  0.46535515, -0.83824096],
       [ 0.9379768 , -0.04604009, -0.34362747],
       [-0.1985015 , -0.88392584, -0.42340555]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=336)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=337, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 337 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.30038407,  0.71033404, -0.63654926],
       [ 0.69705974, -0.29204876, -0.65483985],
       [-0.65105846, -0.64041633, -0.40741847]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=337)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=338, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 338 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.51138869, -0.38529331, -0.76813455],
       [ 0.63123242,  0.77495248,  0.03153239],
       [ 0.58311855, -0.50099673,  0.63951155]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=338)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=339, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 339 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.38986704, -0.6058628 , -0.69349402],
       [ 0.88299809,  0.45970665,  0.0947848 ],
       [ 0.26137723, -0.64930737,  0.71420017]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=339)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=340, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 340 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.5890606 ,  0.78574409, -0.18871628],
       [ 0.44944175,  0.12448222, -0.88459386],
       [-0.67157258, -0.60589636, -0.42647376]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=340)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=341, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 341 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.54741146,  0.62039478,  0.56165026],
       [-0.21212444,  0.75208301, -0.62399869],
       [-0.80953315,  0.22244429,  0.54329975]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=341)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=342, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 342 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.16458869,  0.12835903, -0.97797471],
       [ 0.92882962,  0.31350148,  0.19746481],
       [ 0.33194291, -0.94087235, -0.06762487]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=342)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=343, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 343 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.11037018, -0.07901382, -0.99074479],
       [ 0.97316105,  0.21112023,  0.09157408],
       [ 0.20193065, -0.97426129,  0.10019455]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=343)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=344, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 344 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.05892254,  0.94100139,  0.33323343],
       [ 0.11633492,  0.32506611, -0.9385085 ],
       [-0.9914607 ,  0.09406599, -0.0903176 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=344)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=345, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 345 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.34573171,  0.72472082, -0.59602796],
       [ 0.3698039 , -0.47855171, -0.79638768],
       [-0.86238893, -0.49574993, -0.10255408]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=345)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=346, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 346 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.46987141,  0.37102293, -0.80097618],
       [ 0.66665382, -0.44561923, -0.59749158],
       [-0.57861347, -0.81471804, -0.03796011]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=346)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=347, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 347 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.88643781, -0.07810444, -0.45621015],
       [ 0.34627952,  0.7659256 ,  0.54170884],
       [ 0.30711317, -0.63816743,  0.70599138]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=347)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=348, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 348 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.08870212, -0.30617594, -0.94783344],
       [ 0.97561113,  0.21852678,  0.02071159],
       [ 0.2007856 , -0.92655401,  0.31809245]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=348)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=349, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 349 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.56549958,  0.77096439, -0.29295755],
       [ 0.56964955,  0.10824869, -0.81472794],
       [-0.59641396, -0.62761144, -0.50039411]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=349)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=350, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 350 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.10400588,  0.96225114,  0.25150649],
       [-0.38168666,  0.19489811, -0.90350983],
       [-0.91842151, -0.18996701,  0.34700787]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=350)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=351, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 351 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.95718612,  0.07615536,  0.27927601],
       [-0.0675166 ,  0.99689835, -0.04043741],
       [-0.28148932,  0.01985037,  0.95935902]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=351)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=352, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 352 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.60150243,  0.76601728,  0.22674294],
       [-0.3850883 ,  0.5267011 , -0.75782119],
       [-0.69992988,  0.36851523,  0.61179628]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=352)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=353, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 353 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.32616746,  0.11647324, -0.93810915],
       [ 0.9069561 , -0.24125809, -0.34528997],
       [-0.26654346, -0.96344617, -0.02694558]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=353)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=354, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 354 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.82499083, -0.18404161, -0.5343396 ],
       [ 0.31997313,  0.93146075,  0.17319952],
       [ 0.46584044, -0.31386233,  0.82733495]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=354)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=355, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 355 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.31643278,  0.71689413, -0.62123514],
       [ 0.73989233, -0.22331821, -0.63457727],
       [-0.59365784, -0.66044817, -0.45975927]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=355)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=356, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 356 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.49609214,  0.86684701, -0.04968757],
       [-0.03400454, -0.07657894, -0.9964835 ],
       [-0.86760376, -0.49265803,  0.06746694]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=356)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=357, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 357 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.34452415,  0.76194972, -0.54839377],
       [ 0.65750606, -0.22110241, -0.72027738],
       [-0.67006634, -0.60872518, -0.42481144]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=357)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=358, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 358 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.38808743,  0.76718115, -0.5107066 ],
       [ 0.52241764, -0.27339128, -0.80767383],
       [-0.75925487, -0.5802502 , -0.29468925]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=358)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=359, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 359 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.54441443, -0.45944004, -0.70180323],
       [ 0.82220942,  0.45794431,  0.3380217 ],
       [ 0.1660861 , -0.76105312,  0.62706742]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=359)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=360, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 360 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.9161212 , -0.12057167, -0.38234071],
       [ 0.30370345,  0.83127781,  0.46555496],
       [ 0.26169861, -0.54262296,  0.79816926]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=360)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=361, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 361 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.18408491,  0.97855144, -0.09246522],
       [ 0.46238263,  0.00319972, -0.88667472],
       [-0.86736097, -0.20597775, -0.45305421]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=361)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=362, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 362 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96186684,  0.10948867,  0.25064797],
       [-0.0254476 ,  0.94823313, -0.31655387],
       [-0.27233177,  0.29810428,  0.91486023]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=362)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=363, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 363 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.94106614, -0.33418679,  0.05209327],
       [ 0.33585556,  0.94151961, -0.02723732],
       [-0.03994449,  0.04312794,  0.99827071]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=363)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=364, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 364 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.60404316, -0.13839528, -0.78484304],
       [ 0.69165907,  0.58026148,  0.43000506],
       [ 0.39590351, -0.80258542,  0.44622533]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=364)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=365, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 365 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.18741175, -0.08876659, -0.9782624 ],
       [ 0.88618108,  0.44490274,  0.12940111],
       [ 0.42374512, -0.89116892,  0.16204327]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=365)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=366, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 366 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.36424396,  0.91356403, -0.18090633],
       [ 0.57531464,  0.06797291, -0.81510291],
       [-0.73235196, -0.40097437, -0.55034548]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=366)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=367, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 367 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.91709244,  0.35850518,  0.17440037],
       [-0.22081008,  0.8209877 , -0.52651885],
       [-0.33194029,  0.4443571 ,  0.83208317]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=367)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=368, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 368 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.52439977,  0.84635591, -0.09320167],
       [ 0.05533967, -0.07535052, -0.99562032],
       [-0.84967193, -0.52726082, -0.00732326]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=368)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=369, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 369 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.08632033,  0.44807504, -0.88981884],
       [ 0.99581726,  0.01195844, -0.09058136],
       [-0.0299464 , -0.89391597, -0.44723311]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=369)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=370, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 370 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.34053326,  0.85784989, -0.38487747],
       [ 0.38824953, -0.24451892, -0.88852282],
       [-0.85632902, -0.45200007, -0.24979299]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=370)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=371, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 371 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.91148249,  0.3931107 ,  0.12109356],
       [-0.25644257,  0.77324305, -0.57994171],
       [-0.32161604,  0.49755317,  0.80560782]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=371)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=372, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 372 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.16575354,  0.83228837,  0.52898189],
       [-0.27809073,  0.55408072, -0.78464011],
       [-0.9461455 , -0.01704809,  0.32329252]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=372)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=373, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 373 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.03891678,  0.10790048, -0.9933997 ],
       [ 0.95347805, -0.29340742, -0.06922198],
       [-0.29893993, -0.94987871, -0.09146226]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=373)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=374, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 374 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.11587283,  0.98720434,  0.10954945],
       [ 0.13552023,  0.12497412, -0.982861  ],
       [-0.98397548, -0.09904072, -0.14826727]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=374)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=375, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 375 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.47055336,  0.79662669,  0.3794278 ],
       [-0.40010237,  0.57589502, -0.71292568],
       [-0.7864462 ,  0.18365961,  0.58972156]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=375)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=376, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 376 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.94785686, -0.2322018 ,  0.21828811],
       [ 0.25219071,  0.96526575, -0.06827787],
       [-0.19485179,  0.11976788,  0.9734929 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=376)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=377, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 377 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.84848881, -0.22172547, -0.48052529],
       [ 0.28257875,  0.95754119,  0.05713254],
       [ 0.44745502, -0.18426256,  0.87511789]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=377)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=378, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 378 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.9871991 , -0.05474351, -0.1498035 ],
       [ 0.02185298,  0.9768179 , -0.21295361],
       [ 0.15798857,  0.20695396,  0.96551006]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=378)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=379, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 379 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.1060109 ,  0.05396979, -0.99289927],
       [ 0.90134669,  0.42689638, -0.07303164],
       [ 0.4199236 , -0.90268862, -0.09390116]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=379)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=380, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 380 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.7794354 ,  0.44695554,  0.43898884],
       [-0.37255723,  0.89404082, -0.24878128],
       [-0.50366811,  0.03036047,  0.86336358]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=380)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=381, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 381 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.16785817,  0.93420175,  0.31478678],
       [-0.17847585,  0.34283961, -0.92228378],
       [-0.9695205 ,  0.09863103,  0.22428088]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=381)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=382, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 382 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.77914601,  0.49356934,  0.38642051],
       [-0.29680937,  0.83345822, -0.46610256],
       [-0.55211928,  0.24846872,  0.79588164]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=382)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=383, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 383 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.3276036 ,  0.79563327,  0.50955233],
       [ 0.02321583,  0.53237262, -0.84619171],
       [-0.94452999,  0.28904513,  0.1559359 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=383)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=384, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 384 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.73377517,  0.63897486,  0.23083573],
       [-0.45885829,  0.71666919, -0.52519934],
       [-0.50102203,  0.27945734,  0.81907296]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=384)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=385, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 385 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.5261076 ,  0.66161397, -0.53430118],
       [ 0.48371887, -0.28393203, -0.82788807],
       [-0.69944753, -0.69400977, -0.17065636]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=385)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=386, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 386 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.19119992,  0.03624055, -0.98088185],
       [ 0.86440789,  0.46721819,  0.18575832],
       [ 0.46501783, -0.88339899,  0.05800546]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=386)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=387, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 387 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[  2.74382094e-01,   9.61015202e-01,   3.41210730e-02],
       [  8.41407764e-03,   3.30822192e-02,  -9.99417215e-01],
       [ -9.61583938e-01,   2.74509285e-01,   9.91112041e-04]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=387)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=388, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 388 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.52286492,  0.83945157,  0.14809908],
       [-0.43199353,  0.41072804, -0.80292221],
       [-0.73484275,  0.35584202,  0.57739293]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=388)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=389, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 389 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.12382241, -0.348449  , -0.92911318],
       [ 0.96021546,  0.19411168, -0.20076587],
       [ 0.25030838, -0.91700815,  0.31055074]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=389)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=390, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 390 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.42714512,  0.36112906, -0.82893477],
       [ 0.8563586 , -0.13263151, -0.49905795],
       [-0.29016719, -0.92303558, -0.25260307]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=390)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=391, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 391 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.80737656,  0.28922886,  0.51428567],
       [-0.22560928,  0.95671093, -0.18386041],
       [-0.54520046,  0.03241696,  0.8376787 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=391)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=392, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 392 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.27727411,  0.17258266, -0.94516364],
       [ 0.92819605, -0.20594509, -0.30990113],
       [-0.24813537, -0.96322471, -0.1030873 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=392)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=393, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 393 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.62294214,  0.00701713, -0.78223644],
       [ 0.53135305,  0.73008473,  0.42969783],
       [ 0.57411413, -0.6833206 ,  0.45107197]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=393)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=394, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 394 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.13635953,  0.8757502 ,  0.46310653],
       [-0.50923568,  0.46294685, -0.72550619],
       [-0.8497559 , -0.13690068,  0.50909047]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=394)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=395, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 395 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.86806896,  0.42513093,  0.25635907],
       [-0.16519573,  0.73432671, -0.65838792],
       [-0.46815238,  0.52917669,  0.70767604]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=395)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=396, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 396 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.87531932, -0.21234776, -0.43442435],
       [ 0.292455  ,  0.94795488,  0.12590321],
       [ 0.38507942, -0.23725509,  0.89186538]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=396)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=397, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 397 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.8703888 ,  0.36053229,  0.33532044],
       [-0.28034998,  0.92275614, -0.26443333],
       [-0.40475575,  0.13615272,  0.90423184]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=397)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=398, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 398 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.46069167, -0.39135953, -0.79661842],
       [ 0.71959275,  0.69010089,  0.077117  ],
       [ 0.5195666 , -0.608768  ,  0.59954322]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=398)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=399, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 399 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.3010639 ,  0.95270467,  0.04140462],
       [-0.41154752,  0.16897528, -0.89558696],
       [-0.86022623,  0.25258893,  0.4429556 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=399)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=400, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 400 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.58053879,  0.81349463, -0.03465816],
       [ 0.04741905, -0.00871458, -0.99883707],
       [-0.81285063, -0.58150712, -0.033516  ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=400)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=401, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 401 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.68182804,  0.71892573,  0.13511596],
       [-0.56417416,  0.63438111, -0.52845825],
       [-0.46563725,  0.28408872,  0.83813815]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=401)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=402, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 402 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.65217669,  0.39432881,  0.64743366],
       [-0.06046978,  0.87839832, -0.47408839],
       [-0.75565135,  0.27003923,  0.59671589]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=402)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=403, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 403 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.79889532,  0.39869138,  0.45034592],
       [-0.40756968,  0.90947201, -0.08214384],
       [-0.44232705, -0.11792301,  0.88906746]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=403)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=404, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 404 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.95538036,  0.1481314 , -0.25554934],
       [-0.17048975,  0.98304107, -0.0675537 ],
       [ 0.24120867,  0.10810802,  0.96443301]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=404)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=405, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 405 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.55342053,  0.46512239, -0.69093189],
       [ 0.63873812, -0.29538813, -0.71046426],
       [-0.53454591, -0.83451005, -0.13361754]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=405)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=406, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 406 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.42813369,  0.35569037, -0.83077428],
       [ 0.90156089,  0.1046654 , -0.41980129],
       [-0.06236596, -0.92872467, -0.36548731]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=406)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=407, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 407 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.45982778, -0.1636346 , -0.87280131],
       [ 0.83310752,  0.41972652,  0.36022425],
       [ 0.30739271, -0.89277845,  0.32932713]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=407)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=408, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 408 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.1350224 ,  0.80859422, -0.57266424],
       [ 0.57379992, -0.40737201, -0.71049398],
       [-0.80778871, -0.4245273 , -0.40896695]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=408)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=409, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 409 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.27246183,  0.88574097, -0.37580245],
       [ 0.59822564, -0.14996146, -0.78717066],
       [-0.75358518, -0.43928862, -0.48901419]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=409)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=410, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 410 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.27276782, -0.49009474, -0.82789182],
       [ 0.94455547,  0.29991603,  0.13366127],
       [ 0.18279135, -0.81844824,  0.54472911]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=410)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=411, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 411 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.79224072,  0.25229102,  0.55561126],
       [-0.01464512,  0.91812568, -0.39601863],
       [-0.61003291,  0.30560509,  0.73107139]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=411)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=412, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 412 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.31177408, -0.00285512, -0.95015197],
       [ 0.94845854, -0.06068746, -0.31103605],
       [-0.05677426, -0.99815273,  0.02162874]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=412)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=413, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 413 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.0289255 ,  0.93367972,  0.35693906],
       [-0.2892317 ,  0.33399527, -0.8971021 ],
       [-0.956822  , -0.12918722,  0.26038879]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=413)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=414, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 414 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.4902019 , -0.57022727, -0.65919872],
       [ 0.80235682,  0.59065652,  0.08572285],
       [ 0.34047852, -0.5709341 ,  0.74706669]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=414)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=415, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 415 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.96510697,  0.21757669,  0.14570148],
       [-0.13273275,  0.88611968, -0.4440427 ],
       [-0.22572229,  0.40920935,  0.88407984]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=415)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=416, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 416 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.8465516 ,  0.24578387,  0.47216594],
       [-0.19878727,  0.96881758, -0.14790575],
       [-0.49379552,  0.03134927,  0.86901278]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=416)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=417, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 417 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.76414099, -0.2159423 , -0.60783014],
       [ 0.51152483,  0.7769263 ,  0.36705294],
       [ 0.39297697, -0.59140041,  0.70414108]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=417)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=418, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 418 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.22062757,  0.52358971, -0.82290783],
       [ 0.792842  , -0.39513064, -0.46397558],
       [-0.56808894, -0.75480169, -0.3279472 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=418)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=419, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 419 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.98027297,  0.1447194 , -0.13461502],
       [-0.13066849,  0.98552937,  0.10797037],
       [ 0.14829246, -0.08825049,  0.98499807]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=419)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=420, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 420 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.48089079,  0.53600365, -0.69386175],
       [ 0.72792132, -0.19706833, -0.65673025],
       [-0.48874799, -0.8208923 , -0.29540014]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=420)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=421, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 421 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.28628713,  0.90821589,  0.30525984],
       [-0.49787824,  0.41321612, -0.76247603],
       [-0.81863114,  0.06630484,  0.57047939]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=421)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=422, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 422 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.10394841,  0.22184613, -0.96952515],
       [ 0.97648277,  0.16236127,  0.14184578],
       [ 0.18888127, -0.96146925, -0.19975173]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=422)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=423, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 423 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.98780373, -0.14470651,  0.05747892],
       [ 0.11411986,  0.92399001,  0.36499195],
       [-0.10592666, -0.35398092,  0.92923466]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=423)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=424, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 424 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.81104108,  0.50087606,  0.3022177 ],
       [-0.34158148,  0.8248843 , -0.45043089],
       [-0.47490469,  0.26208598,  0.84010504]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=424)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=425, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 425 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.9311086 , -0.3647032 , -0.00532515],
       [ 0.36473392,  0.93108618,  0.006906  ],
       [ 0.00243953, -0.0083725 ,  0.99996197]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=425)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=426, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 426 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.13604187,  0.98842649, -0.06712435],
       [-0.18101249, -0.09141297, -0.97922324],
       [-0.97402623, -0.12106501,  0.19135353]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=426)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=427, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 427 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.01741602,  0.95538896,  0.2948366 ],
       [-0.4092932 ,  0.27585469, -0.86970297],
       [-0.91223668, -0.10552785,  0.3958385 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=427)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=428, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 428 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.58896223,  0.74052538,  0.32364432],
       [-0.4388819 ,  0.62934744, -0.64133024],
       [-0.67860605,  0.23567765,  0.69566506]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=428)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=429, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 429 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.91835258,  0.39015596,  0.06638429],
       [-0.28531472,  0.76892557, -0.57214419],
       [-0.27427005,  0.50648968,  0.81746202]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=429)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=430, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 430 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.08457061,  0.94625025, -0.31218308],
       [ 0.14926031, -0.29773981, -0.94290634],
       [-0.98517469, -0.1263387 , -0.11605757]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=430)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=431, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 431 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.02214178, -0.33196728, -0.943031  ],
       [ 0.87039457,  0.45766281, -0.18154352],
       [ 0.49185672, -0.82482876,  0.27880905]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=431)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=432, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 432 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.17759497,  0.05650065, -0.98248038],
       [ 0.96697792, -0.17542166, -0.1848809 ],
       [-0.18279423, -0.98287075, -0.02348088]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=432)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=433, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 433 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.40445505, -0.4426451 , -0.80030083],
       [ 0.73094446,  0.68238977, -0.00802488],
       [ 0.54966927, -0.58172976,  0.59954497]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=433)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=434, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 434 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.33457423,  0.43644099, -0.83521216],
       [ 0.71354082, -0.4616065 , -0.52704737],
       [-0.61556444, -0.77229444, -0.15697682]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=434)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=435, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 435 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.52165342,  0.85297602,  0.01759608],
       [ 0.17012474,  0.12420916, -0.97756312],
       [-0.83602349, -0.50695562, -0.20990646]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=435)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=436, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 436 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.08972971,  0.05528229, -0.99443071],
       [ 0.93661289,  0.3348448 ,  0.10312734],
       [ 0.33868107, -0.94065022, -0.02173258]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=436)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=437, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 437 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.23771686,  0.96189907,  0.13505878],
       [-0.24709727,  0.07458501, -0.96611594],
       [-0.93937939, -0.2630347 ,  0.21995252]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=437)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=438, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 438 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.87464338, -0.18868194, -0.44654012],
       [ 0.17438099,  0.9819425 , -0.07334982],
       [ 0.4523165 , -0.01371318,  0.89175206]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=438)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=439, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 439 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.40972908,  0.46927314, -0.78224344],
       [ 0.81800436, -0.19050898, -0.54274782],
       [-0.40372137, -0.86225811, -0.3058104 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=439)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=440, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 440 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.00499088,  0.96306539,  0.26922135],
       [-0.19136342,  0.26516893, -0.94502142],
       [-0.98150656, -0.04680263,  0.18561891]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=440)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=441, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 441 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.29992806,  0.87673197,  0.37601091],
       [-0.58588928,  0.48035268, -0.65268296],
       [-0.75284587, -0.02454282,  0.65773912]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=441)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=442, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 442 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.09467759, -0.45844474, -0.88366542],
       [ 0.92332841,  0.37227582, -0.09420917],
       [ 0.37215697, -0.80699389,  0.45854123]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=442)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=443, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 443 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.8332199 , -0.35328404, -0.42536454],
       [ 0.48470701,  0.8368588 ,  0.25441395],
       [ 0.26608967, -0.41815995,  0.86852665]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=443)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=444, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 444 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.66104473, -0.4385684 , -0.608833  ],
       [ 0.59115734,  0.80412253,  0.06260948],
       [ 0.4621178 , -0.40130377,  0.79082389]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=444)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=445, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 445 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.46343404,  0.85578495,  0.2299152 ],
       [-0.39861679,  0.43305731, -0.80843431],
       [-0.79141237,  0.28300792,  0.54182375]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=445)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=446, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 446 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.31061966, -0.42063014, -0.85239998],
       [ 0.8400873 ,  0.54103661,  0.03914985],
       [ 0.44471198, -0.72825111,  0.52142264]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=446)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=447, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 447 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.66794256,  0.73766491,  0.09850492],
       [-0.48833763,  0.53431466, -0.68995232],
       [-0.56158624,  0.41274486,  0.71712103]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=447)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=448, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 448 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.42302105,  0.8775211 ,  0.22585374],
       [ 0.0668049 ,  0.27877883, -0.95802895],
       [-0.90365386, -0.39017827, -0.17655202]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=448)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=449, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 449 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.77466801, -0.28208376, -0.56596663],
       [ 0.55170803,  0.73887442,  0.38688868],
       [ 0.30904325, -0.61195861,  0.72801025]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=449)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=450, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 450 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.38706958, -0.57500278, -0.72079744],
       [ 0.89049438,  0.43588427,  0.13047857],
       [ 0.23915872, -0.69237035,  0.68075429]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=450)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=451, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 451 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.24492826,  0.42634762, -0.87076854],
       [ 0.9455008 , -0.09372604, -0.31183917],
       [-0.21456557, -0.89969058, -0.38015586]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=451)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=452, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 452 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.52091111,  0.81557262,  0.251978  ],
       [-0.39542499,  0.49216082, -0.77551067],
       [-0.75649897,  0.30433373,  0.57886984]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=452)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=453, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 453 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.71510292,  0.38623104, -0.58262629],
       [ 0.58559974, -0.12412972, -0.80103979],
       [-0.38170767, -0.9140117 , -0.13741127]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=453)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=454, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 454 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.26648979,  0.04082498, -0.96297275],
       [ 0.84840843,  0.46416727,  0.25446391],
       [ 0.45736892, -0.88480623,  0.08905958]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=454)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=455, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 455 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.16396791,  0.93454928, -0.31580399],
       [ 0.57876463, -0.16810905, -0.79797923],
       [-0.79884043, -0.31361917, -0.51331958]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=455)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=456, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 456 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.93919116, -0.32365177,  0.1147584 ],
       [ 0.32774913,  0.94458726, -0.01831457],
       [-0.10247178,  0.05481284,  0.99322459]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=456)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=457, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 457 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.94255397, -0.32407719, -0.08103078],
       [ 0.32430489,  0.94589207, -0.01070182],
       [ 0.08011459, -0.01619164,  0.99665414]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=457)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=458, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 458 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.08855461,  0.12609531, -0.98805772],
       [ 0.95704309,  0.2641795 ,  0.11948935],
       [ 0.27609164, -0.95619515, -0.09728434]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=458)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=459, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 459 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.58781433, -0.223413  , -0.77753518],
       [ 0.74770599,  0.51699794,  0.41671199],
       [ 0.30888521, -0.82631699,  0.47094603]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=459)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=460, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 460 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[  9.91522692e-01,  -1.29933628e-01,   5.88221117e-05],
       [  1.29821641e-01,   9.90649125e-01,  -4.19601352e-02],
       [  5.39376051e-03,   4.16120626e-02,   9.99119284e-01]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=460)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=461, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 461 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.97172488, -0.14866076, -0.18344136],
       [ 0.11057561,  0.9729671 , -0.20275122],
       [ 0.20862356,  0.17673427,  0.96189459]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=461)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=462, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 462 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.40253614,  0.68867729,  0.60306571],
       [-0.35731051,  0.72474425, -0.58913069],
       [-0.84278933,  0.02166468,  0.53780739]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=462)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=463, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 463 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.83170806,  0.53371871,  0.15299035],
       [-0.35994368,  0.72812234, -0.58333387],
       [-0.42273189,  0.43009557,  0.79769389]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=463)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=464, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 464 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.41454856,  0.48460853, -0.77026234],
       [ 0.84173018, -0.11752417, -0.52695196],
       [-0.34588985, -0.86680023, -0.35919015]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=464)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=465, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 465 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.44046387,  0.89759723, -0.01762917],
       [ 0.02338226, -0.00816036, -0.99969329],
       [-0.89746579, -0.44074098, -0.01739351]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=465)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=466, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 466 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.41677215,  0.90612551,  0.07237082],
       [ 0.19528661,  0.16700861, -0.96642189],
       [-0.88778607, -0.38864468, -0.24655872]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=466)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=467, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 467 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.94553119,  0.17693891, -0.27324603],
       [-0.19858086,  0.97862545, -0.05345904],
       [ 0.25794653,  0.10480862,  0.96045757]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=467)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=468, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 468 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.6257798 , -0.16290972, -0.76279752],
       [ 0.42252958,  0.89283135,  0.1559517 ],
       [ 0.65564349, -0.41989594,  0.62755   ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=468)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=469, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 469 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.37458182, -0.29500602, -0.87901076],
       [ 0.81181726,  0.5623481 ,  0.15721754],
       [ 0.44792991, -0.77248693,  0.45013635]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=469)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=470, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 470 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.59476083,  0.30441149, -0.74403844],
       [ 0.65368307, -0.35559532, -0.66801977],
       [-0.46792948, -0.88367732,  0.01250553]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=470)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=471, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 471 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.87812914,  0.46178507,  0.12507504],
       [-0.44547375,  0.88455654, -0.13824927],
       [-0.17447739,  0.06568307,  0.982468  ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=471)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=472, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 472 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.64957019, -0.33428918, -0.68286844],
       [ 0.63559463,  0.73163282,  0.24644043],
       [ 0.41722659, -0.59410787,  0.68771928]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=472)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=473, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 473 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.99042963, -0.09672343, -0.09845672],
       [ 0.13034222,  0.89007797,  0.43677468],
       [ 0.04538782, -0.44542765,  0.89416674]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=473)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=474, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 474 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.33457505,  0.88593212, -0.32122238],
       [ 0.06235806, -0.31930628, -0.94559768],
       [-0.94030368, -0.3364042 ,  0.05158691]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=474)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=475, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 475 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.68992594,  0.50839988, -0.51529774],
       [ 0.64920993,  0.11968826, -0.75113327],
       [-0.32020098, -0.85276274, -0.41263428]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=475)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=476, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 476 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.62881387,  0.47435453,  0.61610137],
       [-0.13943897,  0.84830482, -0.51081866],
       [-0.76495091,  0.23530132,  0.59956934]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=476)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=477, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 477 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.66355179,  0.59868915,  0.4486316 ],
       [-0.10796947,  0.67002674, -0.73444316],
       [-0.74029833,  0.43890256,  0.5092376 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=477)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=478, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 478 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.01674949,  0.06994946, -0.99740991],
       [ 0.8776612 ,  0.47685367,  0.04818083],
       [ 0.4789888 , -0.87619498, -0.05340488]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=478)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=479, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 479 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.76188216, -0.25617931, -0.59490145],
       [ 0.54771722,  0.74508188,  0.38060324],
       [ 0.34574762, -0.61581259,  0.70797841]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=479)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=480, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 480 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.08262858,  0.22172035, -0.97160311],
       [ 0.9296616 , -0.33408284, -0.1552996 ],
       [-0.35902901, -0.91609429, -0.1785201 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=480)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=481, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 481 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.09149397, -0.15589192, -0.98352761],
       [ 0.8881    ,  0.45954629,  0.0097773 ],
       [ 0.45045226, -0.87436544,  0.18049333]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=481)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=482, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 482 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.58681647,  0.62124914, -0.51932258],
       [ 0.61858385, -0.06990463, -0.78260294],
       [-0.52249446, -0.78048885, -0.34327349]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=482)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=483, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 483 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.3906074 ,  0.84097602, -0.37441313],
       [ 0.28429614, -0.27663955, -0.91795766],
       [-0.87555786, -0.46500526, -0.13102878]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=483)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=484, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 484 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.12434055,  0.97189175,  0.19991463],
       [ 0.16369288,  0.17862535, -0.97020494],
       [-0.97864399,  0.15336042, -0.13688139]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=484)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=485, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 485 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.06892183, -0.22586476, -0.9717175 ],
       [ 0.97838035,  0.17507782, -0.11008927],
       [ 0.19499147, -0.95829686,  0.20891496]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=485)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=486, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 486 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.99894375,  0.01843204,  0.04209094],
       [-0.0129128 ,  0.9917131 , -0.12782169],
       [-0.04409815,  0.12714317,  0.99090361]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=486)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=487, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 487 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.61525604,  0.61132303, -0.49773905],
       [ 0.57154466, -0.08894997, -0.81573562],
       [-0.54295184, -0.78636636, -0.29467141]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=487)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=488, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 488 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.85925209, -0.28527081, -0.42462503],
       [ 0.41492159,  0.87416628,  0.25233585],
       [ 0.29920883, -0.3930062 ,  0.86949422]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=488)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=489, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 489 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.37086413,  0.84766743,  0.37936753],
       [-0.01610336,  0.41430705, -0.9099947 ],
       [-0.92854751,  0.3313753 ,  0.16730191]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=489)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=490, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 490 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.99088337, -0.13421349, -0.01169988],
       [ 0.13416626,  0.99094752, -0.00473569],
       [ 0.01222956,  0.00312279,  0.99992034]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=490)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=491, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 491 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.85085236, -0.19229289, -0.48895163],
       [ 0.35562136,  0.89582029,  0.26653229],
       [ 0.38676053, -0.40066128,  0.83059427]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=491)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=492, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 492 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.55918771,  0.66142426, -0.49982703],
       [ 0.54929721, -0.15597854, -0.82094048],
       [-0.62095224, -0.73361342, -0.27609722]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=492)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=493, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 493 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.86891333, -0.40222864, -0.28844713],
       [ 0.47040527,  0.8523681 ,  0.22844583],
       [ 0.15397568, -0.33418667,  0.92984448]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=493)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=494, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 494 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.19021568,  0.0289981 , -0.98131397],
       [ 0.94699447, -0.25816099, -0.19119199],
       [-0.25888119, -0.96566662,  0.02164523]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=494)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=495, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 495 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.38161965, -0.09576261, -0.9193454 ],
       [ 0.9078703 ,  0.22563976,  0.35335282],
       [ 0.17360289, -0.96949276,  0.1730486 ]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=495)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=496, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 496 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.32259633,  0.65547627, -0.68284879],
       [ 0.63341126, -0.38658551, -0.67032963],
       [-0.70336462, -0.64876999, -0.29047498]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=496)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=497, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 497 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.4922934 , -0.00866032, -0.87038624],
       [ 0.86863571, -0.06904846, -0.49061626],
       [-0.05584994, -0.99757572,  0.04151476]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=497)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=498, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 498 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[-0.21684401,  0.97576114,  0.02947663],
       [ 0.02100138,  0.03485099, -0.99917183],
       [-0.97598034, -0.21604538, -0.02804956]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=498)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=499, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 499 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.92623113,  0.07726163,  0.36895331],
       [-0.08987872,  0.99580582,  0.01710485],
       [-0.3660843 , -0.0490041 ,  0.92929053]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=499)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=500, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 500 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.84407865, -0.29632702, -0.44690215],
       [ 0.51903894,  0.66079003,  0.54217628],
       [ 0.134647  , -0.68959904,  0.71156401]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=500)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='..', read_mol=None, set_mol_name=None, read_model=None, set_model_num=501, parser='internal')

Internal relax PDB parser.
Opening the file '../1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model 501 (from the original molecule number 1 of model None)

relax> structure.rotate(R=array([[ 0.71606662, -0.41319688, -0.56259839],
       [ 0.50688351,  0.86192942,  0.01211489],
       [ 0.47991427, -0.29384692,  0.82664157]]), origin=array([ 37.254 ,   0.5   ,  16.7465]), model=501)

relax> structure.write_pdb(file='distribution.pdb', dir=None, model_num=None, compress_type=2, force=True)
Opening the file 'distribution.pdb.gz' for writing.

Creating the PDB records

REMARK
HET
HETNAM
FORMUL

MODEL 1
ATOM, HETATM, TER
ENDMDL

MODEL 2
ATOM, HETATM, TER
ENDMDL

MODEL 3
ATOM, HETATM, TER
ENDMDL

MODEL 4
ATOM, HETATM, TER
ENDMDL

MODEL 5
ATOM, HETATM, TER
ENDMDL

MODEL 6
ATOM, HETATM, TER
ENDMDL

MODEL 7
ATOM, HETATM, TER
ENDMDL

MODEL 8
ATOM, HETATM, TER
ENDMDL

MODEL 9
ATOM, HETATM, TER
ENDMDL

MODEL 10
ATOM, HETATM, TER
ENDMDL

MODEL 11
ATOM, HETATM, TER
ENDMDL

MODEL 12
ATOM, HETATM, TER
ENDMDL

MODEL 13
ATOM, HETATM, TER
ENDMDL

MODEL 14
ATOM, HETATM, TER
ENDMDL

MODEL 15
ATOM, HETATM, TER
ENDMDL

MODEL 16
ATOM, HETATM, TER
ENDMDL

MODEL 17
ATOM, HETATM, TER
ENDMDL

MODEL 18
ATOM, HETATM, TER
ENDMDL

MODEL 19
ATOM, HETATM, TER
ENDMDL

MODEL 20
ATOM, HETATM, TER
ENDMDL

MODEL 21
ATOM, HETATM, TER
ENDMDL

MODEL 22
ATOM, HETATM, TER
ENDMDL

MODEL 23
ATOM, HETATM, TER
ENDMDL

MODEL 24
ATOM, HETATM, TER
ENDMDL

MODEL 25
ATOM, HETATM, TER
ENDMDL

MODEL 26
ATOM, HETATM, TER
ENDMDL

MODEL 27
ATOM, HETATM, TER
ENDMDL

MODEL 28
ATOM, HETATM, TER
ENDMDL

MODEL 29
ATOM, HETATM, TER
ENDMDL

MODEL 30
ATOM, HETATM, TER
ENDMDL

MODEL 31
ATOM, HETATM, TER
ENDMDL

MODEL 32
ATOM, HETATM, TER
ENDMDL

MODEL 33
ATOM, HETATM, TER
ENDMDL

MODEL 34
ATOM, HETATM, TER
ENDMDL

MODEL 35
ATOM, HETATM, TER
ENDMDL

MODEL 36
ATOM, HETATM, TER
ENDMDL

MODEL 37
ATOM, HETATM, TER
ENDMDL

MODEL 38
ATOM, HETATM, TER
ENDMDL

MODEL 39
ATOM, HETATM, TER
ENDMDL

MODEL 40
ATOM, HETATM, TER
ENDMDL

MODEL 41
ATOM, HETATM, TER
ENDMDL

MODEL 42
ATOM, HETATM, TER
ENDMDL

MODEL 43
ATOM, HETATM, TER
ENDMDL

MODEL 44
ATOM, HETATM, TER
ENDMDL

MODEL 45
ATOM, HETATM, TER
ENDMDL

MODEL 46
ATOM, HETATM, TER
ENDMDL

MODEL 47
ATOM, HETATM, TER
ENDMDL

MODEL 48
ATOM, HETATM, TER
ENDMDL

MODEL 49
ATOM, HETATM, TER
ENDMDL

MODEL 50
ATOM, HETATM, TER
ENDMDL

MODEL 51
ATOM, HETATM, TER
ENDMDL

MODEL 52
ATOM, HETATM, TER
ENDMDL

MODEL 53
ATOM, HETATM, TER
ENDMDL

MODEL 54
ATOM, HETATM, TER
ENDMDL

MODEL 55
ATOM, HETATM, TER
ENDMDL

MODEL 56
ATOM, HETATM, TER
ENDMDL

MODEL 57
ATOM, HETATM, TER
ENDMDL

MODEL 58
ATOM, HETATM, TER
ENDMDL

MODEL 59
ATOM, HETATM, TER
ENDMDL

MODEL 60
ATOM, HETATM, TER
ENDMDL

MODEL 61
ATOM, HETATM, TER
ENDMDL

MODEL 62
ATOM, HETATM, TER
ENDMDL

MODEL 63
ATOM, HETATM, TER
ENDMDL

MODEL 64
ATOM, HETATM, TER
ENDMDL

MODEL 65
ATOM, HETATM, TER
ENDMDL

MODEL 66
ATOM, HETATM, TER
ENDMDL

MODEL 67
ATOM, HETATM, TER
ENDMDL

MODEL 68
ATOM, HETATM, TER
ENDMDL

MODEL 69
ATOM, HETATM, TER
ENDMDL

MODEL 70
ATOM, HETATM, TER
ENDMDL

MODEL 71
ATOM, HETATM, TER
ENDMDL

MODEL 72
ATOM, HETATM, TER
ENDMDL

MODEL 73
ATOM, HETATM, TER
ENDMDL

MODEL 74
ATOM, HETATM, TER
ENDMDL

MODEL 75
ATOM, HETATM, TER
ENDMDL

MODEL 76
ATOM, HETATM, TER
ENDMDL

MODEL 77
ATOM, HETATM, TER
ENDMDL

MODEL 78
ATOM, HETATM, TER
ENDMDL

MODEL 79
ATOM, HETATM, TER
ENDMDL

MODEL 80
ATOM, HETATM, TER
ENDMDL

MODEL 81
ATOM, HETATM, TER
ENDMDL

MODEL 82
ATOM, HETATM, TER
ENDMDL

MODEL 83
ATOM, HETATM, TER
ENDMDL

MODEL 84
ATOM, HETATM, TER
ENDMDL

MODEL 85
ATOM, HETATM, TER
ENDMDL

MODEL 86
ATOM, HETATM, TER
ENDMDL

MODEL 87
ATOM, HETATM, TER
ENDMDL

MODEL 88
ATOM, HETATM, TER
ENDMDL

MODEL 89
ATOM, HETATM, TER
ENDMDL

MODEL 90
ATOM, HETATM, TER
ENDMDL

MODEL 91
ATOM, HETATM, TER
ENDMDL

MODEL 92
ATOM, HETATM, TER
ENDMDL

MODEL 93
ATOM, HETATM, TER
ENDMDL

MODEL 94
ATOM, HETATM, TER
ENDMDL

MODEL 95
ATOM, HETATM, TER
ENDMDL

MODEL 96
ATOM, HETATM, TER
ENDMDL

MODEL 97
ATOM, HETATM, TER
ENDMDL

MODEL 98
ATOM, HETATM, TER
ENDMDL

MODEL 99
ATOM, HETATM, TER
ENDMDL

MODEL 100
ATOM, HETATM, TER
ENDMDL

MODEL 101
ATOM, HETATM, TER
ENDMDL

MODEL 102
ATOM, HETATM, TER
ENDMDL

MODEL 103
ATOM, HETATM, TER
ENDMDL

MODEL 104
ATOM, HETATM, TER
ENDMDL

MODEL 105
ATOM, HETATM, TER
ENDMDL

MODEL 106
ATOM, HETATM, TER
ENDMDL

MODEL 107
ATOM, HETATM, TER
ENDMDL

MODEL 108
ATOM, HETATM, TER
ENDMDL

MODEL 109
ATOM, HETATM, TER
ENDMDL

MODEL 110
ATOM, HETATM, TER
ENDMDL

MODEL 111
ATOM, HETATM, TER
ENDMDL

MODEL 112
ATOM, HETATM, TER
ENDMDL

MODEL 113
ATOM, HETATM, TER
ENDMDL

MODEL 114
ATOM, HETATM, TER
ENDMDL

MODEL 115
ATOM, HETATM, TER
ENDMDL

MODEL 116
ATOM, HETATM, TER
ENDMDL

MODEL 117
ATOM, HETATM, TER
ENDMDL

MODEL 118
ATOM, HETATM, TER
ENDMDL

MODEL 119
ATOM, HETATM, TER
ENDMDL

MODEL 120
ATOM, HETATM, TER
ENDMDL

MODEL 121
ATOM, HETATM, TER
ENDMDL

MODEL 122
ATOM, HETATM, TER
ENDMDL

MODEL 123
ATOM, HETATM, TER
ENDMDL

MODEL 124
ATOM, HETATM, TER
ENDMDL

MODEL 125
ATOM, HETATM, TER
ENDMDL

MODEL 126
ATOM, HETATM, TER
ENDMDL

MODEL 127
ATOM, HETATM, TER
ENDMDL

MODEL 128
ATOM, HETATM, TER
ENDMDL

MODEL 129
ATOM, HETATM, TER
ENDMDL

MODEL 130
ATOM, HETATM, TER
ENDMDL

MODEL 131
ATOM, HETATM, TER
ENDMDL

MODEL 132
ATOM, HETATM, TER
ENDMDL

MODEL 133
ATOM, HETATM, TER
ENDMDL

MODEL 134
ATOM, HETATM, TER
ENDMDL

MODEL 135
ATOM, HETATM, TER
ENDMDL

MODEL 136
ATOM, HETATM, TER
ENDMDL

MODEL 137
ATOM, HETATM, TER
ENDMDL

MODEL 138
ATOM, HETATM, TER
ENDMDL

MODEL 139
ATOM, HETATM, TER
ENDMDL

MODEL 140
ATOM, HETATM, TER
ENDMDL

MODEL 141
ATOM, HETATM, TER
ENDMDL

MODEL 142
ATOM, HETATM, TER
ENDMDL

MODEL 143
ATOM, HETATM, TER
ENDMDL

MODEL 144
ATOM, HETATM, TER
ENDMDL

MODEL 145
ATOM, HETATM, TER
ENDMDL

MODEL 146
ATOM, HETATM, TER
ENDMDL

MODEL 147
ATOM, HETATM, TER
ENDMDL

MODEL 148
ATOM, HETATM, TER
ENDMDL

MODEL 149
ATOM, HETATM, TER
ENDMDL

MODEL 150
ATOM, HETATM, TER
ENDMDL

MODEL 151
ATOM, HETATM, TER
ENDMDL

MODEL 152
ATOM, HETATM, TER
ENDMDL

MODEL 153
ATOM, HETATM, TER
ENDMDL

MODEL 154
ATOM, HETATM, TER
ENDMDL

MODEL 155
ATOM, HETATM, TER
ENDMDL

MODEL 156
ATOM, HETATM, TER
ENDMDL

MODEL 157
ATOM, HETATM, TER
ENDMDL

MODEL 158
ATOM, HETATM, TER
ENDMDL

MODEL 159
ATOM, HETATM, TER
ENDMDL

MODEL 160
ATOM, HETATM, TER
ENDMDL

MODEL 161
ATOM, HETATM, TER
ENDMDL

MODEL 162
ATOM, HETATM, TER
ENDMDL

MODEL 163
ATOM, HETATM, TER
ENDMDL

MODEL 164
ATOM, HETATM, TER
ENDMDL

MODEL 165
ATOM, HETATM, TER
ENDMDL

MODEL 166
ATOM, HETATM, TER
ENDMDL

MODEL 167
ATOM, HETATM, TER
ENDMDL

MODEL 168
ATOM, HETATM, TER
ENDMDL

MODEL 169
ATOM, HETATM, TER
ENDMDL

MODEL 170
ATOM, HETATM, TER
ENDMDL

MODEL 171
ATOM, HETATM, TER
ENDMDL

MODEL 172
ATOM, HETATM, TER
ENDMDL

MODEL 173
ATOM, HETATM, TER
ENDMDL

MODEL 174
ATOM, HETATM, TER
ENDMDL

MODEL 175
ATOM, HETATM, TER
ENDMDL

MODEL 176
ATOM, HETATM, TER
ENDMDL

MODEL 177
ATOM, HETATM, TER
ENDMDL

MODEL 178
ATOM, HETATM, TER
ENDMDL

MODEL 179
ATOM, HETATM, TER
ENDMDL

MODEL 180
ATOM, HETATM, TER
ENDMDL

MODEL 181
ATOM, HETATM, TER
ENDMDL

MODEL 182
ATOM, HETATM, TER
ENDMDL

MODEL 183
ATOM, HETATM, TER
ENDMDL

MODEL 184
ATOM, HETATM, TER
ENDMDL

MODEL 185
ATOM, HETATM, TER
ENDMDL

MODEL 186
ATOM, HETATM, TER
ENDMDL

MODEL 187
ATOM, HETATM, TER
ENDMDL

MODEL 188
ATOM, HETATM, TER
ENDMDL

MODEL 189
ATOM, HETATM, TER
ENDMDL

MODEL 190
ATOM, HETATM, TER
ENDMDL

MODEL 191
ATOM, HETATM, TER
ENDMDL

MODEL 192
ATOM, HETATM, TER
ENDMDL

MODEL 193
ATOM, HETATM, TER
ENDMDL

MODEL 194
ATOM, HETATM, TER
ENDMDL

MODEL 195
ATOM, HETATM, TER
ENDMDL

MODEL 196
ATOM, HETATM, TER
ENDMDL

MODEL 197
ATOM, HETATM, TER
ENDMDL

MODEL 198
ATOM, HETATM, TER
ENDMDL

MODEL 199
ATOM, HETATM, TER
ENDMDL

MODEL 200
ATOM, HETATM, TER
ENDMDL

MODEL 201
ATOM, HETATM, TER
ENDMDL

MODEL 202
ATOM, HETATM, TER
ENDMDL

MODEL 203
ATOM, HETATM, TER
ENDMDL

MODEL 204
ATOM, HETATM, TER
ENDMDL

MODEL 205
ATOM, HETATM, TER
ENDMDL

MODEL 206
ATOM, HETATM, TER
ENDMDL

MODEL 207
ATOM, HETATM, TER
ENDMDL

MODEL 208
ATOM, HETATM, TER
ENDMDL

MODEL 209
ATOM, HETATM, TER
ENDMDL

MODEL 210
ATOM, HETATM, TER
ENDMDL

MODEL 211
ATOM, HETATM, TER
ENDMDL

MODEL 212
ATOM, HETATM, TER
ENDMDL

MODEL 213
ATOM, HETATM, TER
ENDMDL

MODEL 214
ATOM, HETATM, TER
ENDMDL

MODEL 215
ATOM, HETATM, TER
ENDMDL

MODEL 216
ATOM, HETATM, TER
ENDMDL

MODEL 217
ATOM, HETATM, TER
ENDMDL

MODEL 218
ATOM, HETATM, TER
ENDMDL

MODEL 219
ATOM, HETATM, TER
ENDMDL

MODEL 220
ATOM, HETATM, TER
ENDMDL

MODEL 221
ATOM, HETATM, TER
ENDMDL

MODEL 222
ATOM, HETATM, TER
ENDMDL

MODEL 223
ATOM, HETATM, TER
ENDMDL

MODEL 224
ATOM, HETATM, TER
ENDMDL

MODEL 225
ATOM, HETATM, TER
ENDMDL

MODEL 226
ATOM, HETATM, TER
ENDMDL

MODEL 227
ATOM, HETATM, TER
ENDMDL

MODEL 228
ATOM, HETATM, TER
ENDMDL

MODEL 229
ATOM, HETATM, TER
ENDMDL

MODEL 230
ATOM, HETATM, TER
ENDMDL

MODEL 231
ATOM, HETATM, TER
ENDMDL

MODEL 232
ATOM, HETATM, TER
ENDMDL

MODEL 233
ATOM, HETATM, TER
ENDMDL

MODEL 234
ATOM, HETATM, TER
ENDMDL

MODEL 235
ATOM, HETATM, TER
ENDMDL

MODEL 236
ATOM, HETATM, TER
ENDMDL

MODEL 237
ATOM, HETATM, TER
ENDMDL

MODEL 238
ATOM, HETATM, TER
ENDMDL

MODEL 239
ATOM, HETATM, TER
ENDMDL

MODEL 240
ATOM, HETATM, TER
ENDMDL

MODEL 241
ATOM, HETATM, TER
ENDMDL

MODEL 242
ATOM, HETATM, TER
ENDMDL

MODEL 243
ATOM, HETATM, TER
ENDMDL

MODEL 244
ATOM, HETATM, TER
ENDMDL

MODEL 245
ATOM, HETATM, TER
ENDMDL

MODEL 246
ATOM, HETATM, TER
ENDMDL

MODEL 247
ATOM, HETATM, TER
ENDMDL

MODEL 248
ATOM, HETATM, TER
ENDMDL

MODEL 249
ATOM, HETATM, TER
ENDMDL

MODEL 250
ATOM, HETATM, TER
ENDMDL

MODEL 251
ATOM, HETATM, TER
ENDMDL

MODEL 252
ATOM, HETATM, TER
ENDMDL

MODEL 253
ATOM, HETATM, TER
ENDMDL

MODEL 254
ATOM, HETATM, TER
ENDMDL

MODEL 255
ATOM, HETATM, TER
ENDMDL

MODEL 256
ATOM, HETATM, TER
ENDMDL

MODEL 257
ATOM, HETATM, TER
ENDMDL

MODEL 258
ATOM, HETATM, TER
ENDMDL

MODEL 259
ATOM, HETATM, TER
ENDMDL

MODEL 260
ATOM, HETATM, TER
ENDMDL

MODEL 261
ATOM, HETATM, TER
ENDMDL

MODEL 262
ATOM, HETATM, TER
ENDMDL

MODEL 263
ATOM, HETATM, TER
ENDMDL

MODEL 264
ATOM, HETATM, TER
ENDMDL

MODEL 265
ATOM, HETATM, TER
ENDMDL

MODEL 266
ATOM, HETATM, TER
ENDMDL

MODEL 267
ATOM, HETATM, TER
ENDMDL

MODEL 268
ATOM, HETATM, TER
ENDMDL

MODEL 269
ATOM, HETATM, TER
ENDMDL

MODEL 270
ATOM, HETATM, TER
ENDMDL

MODEL 271
ATOM, HETATM, TER
ENDMDL

MODEL 272
ATOM, HETATM, TER
ENDMDL

MODEL 273
ATOM, HETATM, TER
ENDMDL

MODEL 274
ATOM, HETATM, TER
ENDMDL

MODEL 275
ATOM, HETATM, TER
ENDMDL

MODEL 276
ATOM, HETATM, TER
ENDMDL

MODEL 277
ATOM, HETATM, TER
ENDMDL

MODEL 278
ATOM, HETATM, TER
ENDMDL

MODEL 279
ATOM, HETATM, TER
ENDMDL

MODEL 280
ATOM, HETATM, TER
ENDMDL

MODEL 281
ATOM, HETATM, TER
ENDMDL

MODEL 282
ATOM, HETATM, TER
ENDMDL

MODEL 283
ATOM, HETATM, TER
ENDMDL

MODEL 284
ATOM, HETATM, TER
ENDMDL

MODEL 285
ATOM, HETATM, TER
ENDMDL

MODEL 286
ATOM, HETATM, TER
ENDMDL

MODEL 287
ATOM, HETATM, TER
ENDMDL

MODEL 288
ATOM, HETATM, TER
ENDMDL

MODEL 289
ATOM, HETATM, TER
ENDMDL

MODEL 290
ATOM, HETATM, TER
ENDMDL

MODEL 291
ATOM, HETATM, TER
ENDMDL

MODEL 292
ATOM, HETATM, TER
ENDMDL

MODEL 293
ATOM, HETATM, TER
ENDMDL

MODEL 294
ATOM, HETATM, TER
ENDMDL

MODEL 295
ATOM, HETATM, TER
ENDMDL

MODEL 296
ATOM, HETATM, TER
ENDMDL

MODEL 297
ATOM, HETATM, TER
ENDMDL

MODEL 298
ATOM, HETATM, TER
ENDMDL

MODEL 299
ATOM, HETATM, TER
ENDMDL

MODEL 300
ATOM, HETATM, TER
ENDMDL

MODEL 301
ATOM, HETATM, TER
ENDMDL

MODEL 302
ATOM, HETATM, TER
ENDMDL

MODEL 303
ATOM, HETATM, TER
ENDMDL

MODEL 304
ATOM, HETATM, TER
ENDMDL

MODEL 305
ATOM, HETATM, TER
ENDMDL

MODEL 306
ATOM, HETATM, TER
ENDMDL

MODEL 307
ATOM, HETATM, TER
ENDMDL

MODEL 308
ATOM, HETATM, TER
ENDMDL

MODEL 309
ATOM, HETATM, TER
ENDMDL

MODEL 310
ATOM, HETATM, TER
ENDMDL

MODEL 311
ATOM, HETATM, TER
ENDMDL

MODEL 312
ATOM, HETATM, TER
ENDMDL

MODEL 313
ATOM, HETATM, TER
ENDMDL

MODEL 314
ATOM, HETATM, TER
ENDMDL

MODEL 315
ATOM, HETATM, TER
ENDMDL

MODEL 316
ATOM, HETATM, TER
ENDMDL

MODEL 317
ATOM, HETATM, TER
ENDMDL

MODEL 318
ATOM, HETATM, TER
ENDMDL

MODEL 319
ATOM, HETATM, TER
ENDMDL

MODEL 320
ATOM, HETATM, TER
ENDMDL

MODEL 321
ATOM, HETATM, TER
ENDMDL

MODEL 322
ATOM, HETATM, TER
ENDMDL

MODEL 323
ATOM, HETATM, TER
ENDMDL

MODEL 324
ATOM, HETATM, TER
ENDMDL

MODEL 325
ATOM, HETATM, TER
ENDMDL

MODEL 326
ATOM, HETATM, TER
ENDMDL

MODEL 327
ATOM, HETATM, TER
ENDMDL

MODEL 328
ATOM, HETATM, TER
ENDMDL

MODEL 329
ATOM, HETATM, TER
ENDMDL

MODEL 330
ATOM, HETATM, TER
ENDMDL

MODEL 331
ATOM, HETATM, TER
ENDMDL

MODEL 332
ATOM, HETATM, TER
ENDMDL

MODEL 333
ATOM, HETATM, TER
ENDMDL

MODEL 334
ATOM, HETATM, TER
ENDMDL

MODEL 335
ATOM, HETATM, TER
ENDMDL

MODEL 336
ATOM, HETATM, TER
ENDMDL

MODEL 337
ATOM, HETATM, TER
ENDMDL

MODEL 338
ATOM, HETATM, TER
ENDMDL

MODEL 339
ATOM, HETATM, TER
ENDMDL

MODEL 340
ATOM, HETATM, TER
ENDMDL

MODEL 341
ATOM, HETATM, TER
ENDMDL

MODEL 342
ATOM, HETATM, TER
ENDMDL

MODEL 343
ATOM, HETATM, TER
ENDMDL

MODEL 344
ATOM, HETATM, TER
ENDMDL

MODEL 345
ATOM, HETATM, TER
ENDMDL

MODEL 346
ATOM, HETATM, TER
ENDMDL

MODEL 347
ATOM, HETATM, TER
ENDMDL

MODEL 348
ATOM, HETATM, TER
ENDMDL

MODEL 349
ATOM, HETATM, TER
ENDMDL

MODEL 350
ATOM, HETATM, TER
ENDMDL

MODEL 351
ATOM, HETATM, TER
ENDMDL

MODEL 352
ATOM, HETATM, TER
ENDMDL

MODEL 353
ATOM, HETATM, TER
ENDMDL

MODEL 354
ATOM, HETATM, TER
ENDMDL

MODEL 355
ATOM, HETATM, TER
ENDMDL

MODEL 356
ATOM, HETATM, TER
ENDMDL

MODEL 357
ATOM, HETATM, TER
ENDMDL

MODEL 358
ATOM, HETATM, TER
ENDMDL

MODEL 359
ATOM, HETATM, TER
ENDMDL

MODEL 360
ATOM, HETATM, TER
ENDMDL

MODEL 361
ATOM, HETATM, TER
ENDMDL

MODEL 362
ATOM, HETATM, TER
ENDMDL

MODEL 363
ATOM, HETATM, TER
ENDMDL

MODEL 364
ATOM, HETATM, TER
ENDMDL

MODEL 365
ATOM, HETATM, TER
ENDMDL

MODEL 366
ATOM, HETATM, TER
ENDMDL

MODEL 367
ATOM, HETATM, TER
ENDMDL

MODEL 368
ATOM, HETATM, TER
ENDMDL

MODEL 369
ATOM, HETATM, TER
ENDMDL

MODEL 370
ATOM, HETATM, TER
ENDMDL

MODEL 371
ATOM, HETATM, TER
ENDMDL

MODEL 372
ATOM, HETATM, TER
ENDMDL

MODEL 373
ATOM, HETATM, TER
ENDMDL

MODEL 374
ATOM, HETATM, TER
ENDMDL

MODEL 375
ATOM, HETATM, TER
ENDMDL

MODEL 376
ATOM, HETATM, TER
ENDMDL

MODEL 377
ATOM, HETATM, TER
ENDMDL

MODEL 378
ATOM, HETATM, TER
ENDMDL

MODEL 379
ATOM, HETATM, TER
ENDMDL

MODEL 380
ATOM, HETATM, TER
ENDMDL

MODEL 381
ATOM, HETATM, TER
ENDMDL

MODEL 382
ATOM, HETATM, TER
ENDMDL

MODEL 383
ATOM, HETATM, TER
ENDMDL

MODEL 384
ATOM, HETATM, TER
ENDMDL

MODEL 385
ATOM, HETATM, TER
ENDMDL

MODEL 386
ATOM, HETATM, TER
ENDMDL

MODEL 387
ATOM, HETATM, TER
ENDMDL

MODEL 388
ATOM, HETATM, TER
ENDMDL

MODEL 389
ATOM, HETATM, TER
ENDMDL

MODEL 390
ATOM, HETATM, TER
ENDMDL

MODEL 391
ATOM, HETATM, TER
ENDMDL

MODEL 392
ATOM, HETATM, TER
ENDMDL

MODEL 393
ATOM, HETATM, TER
ENDMDL

MODEL 394
ATOM, HETATM, TER
ENDMDL

MODEL 395
ATOM, HETATM, TER
ENDMDL

MODEL 396
ATOM, HETATM, TER
ENDMDL

MODEL 397
ATOM, HETATM, TER
ENDMDL

MODEL 398
ATOM, HETATM, TER
ENDMDL

MODEL 399
ATOM, HETATM, TER
ENDMDL

MODEL 400
ATOM, HETATM, TER
ENDMDL

MODEL 401
ATOM, HETATM, TER
ENDMDL

MODEL 402
ATOM, HETATM, TER
ENDMDL

MODEL 403
ATOM, HETATM, TER
ENDMDL

MODEL 404
ATOM, HETATM, TER
ENDMDL

MODEL 405
ATOM, HETATM, TER
ENDMDL

MODEL 406
ATOM, HETATM, TER
ENDMDL

MODEL 407
ATOM, HETATM, TER
ENDMDL

MODEL 408
ATOM, HETATM, TER
ENDMDL

MODEL 409
ATOM, HETATM, TER
ENDMDL

MODEL 410
ATOM, HETATM, TER
ENDMDL

MODEL 411
ATOM, HETATM, TER
ENDMDL

MODEL 412
ATOM, HETATM, TER
ENDMDL

MODEL 413
ATOM, HETATM, TER
ENDMDL

MODEL 414
ATOM, HETATM, TER
ENDMDL

MODEL 415
ATOM, HETATM, TER
ENDMDL

MODEL 416
ATOM, HETATM, TER
ENDMDL

MODEL 417
ATOM, HETATM, TER
ENDMDL

MODEL 418
ATOM, HETATM, TER
ENDMDL

MODEL 419
ATOM, HETATM, TER
ENDMDL

MODEL 420
ATOM, HETATM, TER
ENDMDL

MODEL 421
ATOM, HETATM, TER
ENDMDL

MODEL 422
ATOM, HETATM, TER
ENDMDL

MODEL 423
ATOM, HETATM, TER
ENDMDL

MODEL 424
ATOM, HETATM, TER
ENDMDL

MODEL 425
ATOM, HETATM, TER
ENDMDL

MODEL 426
ATOM, HETATM, TER
ENDMDL

MODEL 427
ATOM, HETATM, TER
ENDMDL

MODEL 428
ATOM, HETATM, TER
ENDMDL

MODEL 429
ATOM, HETATM, TER
ENDMDL

MODEL 430
ATOM, HETATM, TER
ENDMDL

MODEL 431
ATOM, HETATM, TER
ENDMDL

MODEL 432
ATOM, HETATM, TER
ENDMDL

MODEL 433
ATOM, HETATM, TER
ENDMDL

MODEL 434
ATOM, HETATM, TER
ENDMDL

MODEL 435
ATOM, HETATM, TER
ENDMDL

MODEL 436
ATOM, HETATM, TER
ENDMDL

MODEL 437
ATOM, HETATM, TER
ENDMDL

MODEL 438
ATOM, HETATM, TER
ENDMDL

MODEL 439
ATOM, HETATM, TER
ENDMDL

MODEL 440
ATOM, HETATM, TER
ENDMDL

MODEL 441
ATOM, HETATM, TER
ENDMDL

MODEL 442
ATOM, HETATM, TER
ENDMDL

MODEL 443
ATOM, HETATM, TER
ENDMDL

MODEL 444
ATOM, HETATM, TER
ENDMDL

MODEL 445
ATOM, HETATM, TER
ENDMDL

MODEL 446
ATOM, HETATM, TER
ENDMDL

MODEL 447
ATOM, HETATM, TER
ENDMDL

MODEL 448
ATOM, HETATM, TER
ENDMDL

MODEL 449
ATOM, HETATM, TER
ENDMDL

MODEL 450
ATOM, HETATM, TER
ENDMDL

MODEL 451
ATOM, HETATM, TER
ENDMDL

MODEL 452
ATOM, HETATM, TER
ENDMDL

MODEL 453
ATOM, HETATM, TER
ENDMDL

MODEL 454
ATOM, HETATM, TER
ENDMDL

MODEL 455
ATOM, HETATM, TER
ENDMDL

MODEL 456
ATOM, HETATM, TER
ENDMDL

MODEL 457
ATOM, HETATM, TER
ENDMDL

MODEL 458
ATOM, HETATM, TER
ENDMDL

MODEL 459
ATOM, HETATM, TER
ENDMDL

MODEL 460
ATOM, HETATM, TER
ENDMDL

MODEL 461
ATOM, HETATM, TER
ENDMDL

MODEL 462
ATOM, HETATM, TER
ENDMDL

MODEL 463
ATOM, HETATM, TER
ENDMDL

MODEL 464
ATOM, HETATM, TER
ENDMDL

MODEL 465
ATOM, HETATM, TER
ENDMDL

MODEL 466
ATOM, HETATM, TER
ENDMDL

MODEL 467
ATOM, HETATM, TER
ENDMDL

MODEL 468
ATOM, HETATM, TER
ENDMDL

MODEL 469
ATOM, HETATM, TER
ENDMDL

MODEL 470
ATOM, HETATM, TER
ENDMDL

MODEL 471
ATOM, HETATM, TER
ENDMDL

MODEL 472
ATOM, HETATM, TER
ENDMDL

MODEL 473
ATOM, HETATM, TER
ENDMDL

MODEL 474
ATOM, HETATM, TER
ENDMDL

MODEL 475
ATOM, HETATM, TER
ENDMDL

MODEL 476
ATOM, HETATM, TER
ENDMDL

MODEL 477
ATOM, HETATM, TER
ENDMDL

MODEL 478
ATOM, HETATM, TER
ENDMDL

MODEL 479
ATOM, HETATM, TER
ENDMDL

MODEL 480
ATOM, HETATM, TER
ENDMDL

MODEL 481
ATOM, HETATM, TER
ENDMDL

MODEL 482
ATOM, HETATM, TER
ENDMDL

MODEL 483
ATOM, HETATM, TER
ENDMDL

MODEL 484
ATOM, HETATM, TER
ENDMDL

MODEL 485
ATOM, HETATM, TER
ENDMDL

MODEL 486
ATOM, HETATM, TER
ENDMDL

MODEL 487
ATOM, HETATM, TER
ENDMDL

MODEL 488
ATOM, HETATM, TER
ENDMDL

MODEL 489
ATOM, HETATM, TER
ENDMDL

MODEL 490
ATOM, HETATM, TER
ENDMDL

MODEL 491
ATOM, HETATM, TER
ENDMDL

MODEL 492
ATOM, HETATM, TER
ENDMDL

MODEL 493
ATOM, HETATM, TER
ENDMDL

MODEL 494
ATOM, HETATM, TER
ENDMDL

MODEL 495
ATOM, HETATM, TER
ENDMDL

MODEL 496
ATOM, HETATM, TER
ENDMDL

MODEL 497
ATOM, HETATM, TER
ENDMDL

MODEL 498
ATOM, HETATM, TER
ENDMDL

MODEL 499
ATOM, HETATM, TER
ENDMDL

MODEL 500
ATOM, HETATM, TER
ENDMDL

MODEL 501
ATOM, HETATM, TER
ENDMDL
CONECT

MASTER
END

relax> structure.delete()
Deleting the following structural data:

Models.

Index   Model number
0       1       
1       2       
2       3       
3       4       
4       5       
5       6       
6       7       
7       8       
8       9       
9       10      
10      11      
11      12      
12      13      
13      14      
14      15      
15      16      
16      17      
17      18      
18      19      
19      20      
20      21      
21      22      
22      23      
23      24      
24      25      
25      26      
26      27      
27      28      
28      29      
29      30      
30      31      
31      32      
32      33      
33      34      
34      35      
35      36      
36      37      
37      38      
38      39      
39      40      
40      41      
41      42      
42      43      
43      44      
44      45      
45      46      
46      47      
47      48      
48      49      
49      50      
50      51      
51      52      
52      53      
53      54      
54      55      
55      56      
56      57      
57      58      
58      59      
59      60      
60      61      
61      62      
62      63      
63      64      
64      65      
65      66      
66      67      
67      68      
68      69      
69      70      
70      71      
71      72      
72      73      
73      74      
74      75      
75      76      
76      77      
77      78      
78      79      
79      80      
80      81      
81      82      
82      83      
83      84      
84      85      
85      86      
86      87      
87      88      
88      89      
89      90      
90      91      
91      92      
92      93      
93      94      
94      95      
95      96      
96      97      
97      98      
98      99      
99      100     
100     101     
101     102     
102     103     
103     104     
104     105     
105     106     
106     107     
107     108     
108     109     
109     110     
110     111     
111     112     
112     113     
113     114     
114     115     
115     116     
116     117     
117     118     
118     119     
119     120     
120     121     
121     122     
122     123     
123     124     
124     125     
125     126     
126     127     
127     128     
128     129     
129     130     
130     131     
131     132     
132     133     
133     134     
134     135     
135     136     
136     137     
137     138     
138     139     
139     140     
140     141     
141     142     
142     143     
143     144     
144     145     
145     146     
146     147     
147     148     
148     149     
149     150     
150     151     
151     152     
152     153     
153     154     
154     155     
155     156     
156     157     
157     158     
158     159     
159     160     
160     161     
161     162     
162     163     
163     164     
164     165     
165     166     
166     167     
167     168     
168     169     
169     170     
170     171     
171     172     
172     173     
173     174     
174     175     
175     176     
176     177     
177     178     
178     179     
179     180     
180     181     
181     182     
182     183     
183     184     
184     185     
185     186     
186     187     
187     188     
188     189     
189     190     
190     191     
191     192     
192     193     
193     194     
194     195     
195     196     
196     197     
197     198     
198     199     
199     200     
200     201     
201     202     
202     203     
203     204     
204     205     
205     206     
206     207     
207     208     
208     209     
209     210     
210     211     
211     212     
212     213     
213     214     
214     215     
215     216     
216     217     
217     218     
218     219     
219     220     
220     221     
221     222     
222     223     
223     224     
224     225     
225     226     
226     227     
227     228     
228     229     
229     230     
230     231     
231     232     
232     233     
233     234     
234     235     
235     236     
236     237     
237     238     
238     239     
239     240     
240     241     
241     242     
242     243     
243     244     
244     245     
245     246     
246     247     
247     248     
248     249     
249     250     
250     251     
251     252     
252     253     
253     254     
254     255     
255     256     
256     257     
257     258     
258     259     
259     260     
260     261     
261     262     
262     263     
263     264     
264     265     
265     266     
266     267     
267     268     
268     269     
269     270     
270     271     
271     272     
272     273     
273     274     
274     275     
275     276     
276     277     
277     278     
278     279     
279     280     
280     281     
281     282     
282     283     
283     284     
284     285     
285     286     
286     287     
287     288     
288     289     
289     290     
290     291     
291     292     
292     293     
293     294     
294     295     
295     296     
296     297     
297     298     
298     299     
299     300     
300     301     
301     302     
302     303     
303     304     
304     305     
305     306     
306     307     
307     308     
308     309     
309     310     
310     311     
311     312     
312     313     
313     314     
314     315     
315     316     
316     317     
317     318     
318     319     
319     320     
320     321     
321     322     
322     323     
323     324     
324     325     
325     326     
326     327     
327     328     
328     329     
329     330     
330     331     
331     332     
332     333     
333     334     
334     335     
335     336     
336     337     
337     338     
338     339     
339     340     
340     341     
341     342     
342     343     
343     344     
344     345     
345     346     
346     347     
347     348     
348     349     
349     350     
350     351     
351     352     
352     353     
353     354     
354     355     
355     356     
356     357     
357     358     
358     359     
359     360     
360     361     
361     362     
362     363     
363     364     
364     365     
365     366     
366     367     
367     368     
368     369     
369     370     
370     371     
371     372     
372     373     
373     374     
374     375     
375     376     
376     377     
377     378     
378     379     
379     380     
380     381     
381     382     
382     383     
383     384     
384     385     
385     386     
386     387     
387     388     
388     389     
389     390     
390     391     
391     392     
392     393     
393     394     
394     395     
395     396     
396     397     
397     398     
398     399     
399     400     
400     401     
401     402     
402     403     
403     404     
404     405     
405     406     
406     407     
407     408     
408     409     
409     410     
410     411     
411     412     
412     413     
413     414     
414     415     
415     416     
416     417     
417     418     
418     419     
419     420     
420     421     
421     422     
422     423     
423     424     
424     425     
425     426     
426     427     
427     428     
428     429     
429     430     
430     431     
431     432     
432     433     
433     434     
434     435     
435     436     
436     437     
437     438     
438     439     
439     440     
440     441     
441     442     
442     443     
443     444     
444     445     
445     446     
446     447     
447     448     
448     449     
449     450     
450     451     
451     452     
452     453     
453     454     
454     455     
455     456     
456     457     
457     458     
458     459     
459     460     
460     461     
461     462     
462     463     
463     464     
464     465     
465     466     
466     467     
467     468     
468     469     
469     470     
470     471     
471     472     
472     473     
473     474     
474     475     
475     476     
476     477     
477     478     
478     479     
479     480     
480     481     
481     482     
482     483     
483     484     
484     485     
485     486     
486     487     
487     488     
488     489     
489     490     
490     491     
491     492     
492     493     
493     494     
494     495     
495     496     
496     497     
497     498     
498     499     
499     500     
500     501     


relax> structure.add_atom(atom_name='C', res_name='AXE', res_num=1, pos=array([ 37.254 ,   0.5   ,  16.7465]), element='C', atom_num=None, chain_id=None, segment_id=None, pdb_record=None)
Adding molecule 'None' to model None (from the original molecule number None of model None)

relax> structure.add_atom(atom_name='N', res_name='AXE', res_num=1, pos=array([ 47.67121909,  13.37906417,   5.15145872]), element='N', atom_num=None, chain_id=None, segment_id=None, pdb_record=None)

relax> structure.connect_atom(index1=0, index2=1)

relax> structure.write_pdb(file='axis.pdb', dir=None, model_num=None, compress_type=0, force=True)
Opening the file 'axis.pdb' for writing.

Creating the PDB records

REMARK
HET
HETNAM
FORMUL
ATOM, HETATM, TER
CONECT

MASTER
END

