


                                  relax repository checkout r21506
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = '15N_SQ_CPMG.py'
----------------------------------------------------------------------------------------------------
"""Optimise the SQ data in relax.

To run this, type:

$ rm -f optimise_sq.log; ../../../../../relax --tee optimise_sq.log optimise_sq.py
"""

# relax module imports.
from specific_analyses.relax_disp.disp_data import generate_r20_key
from specific_analyses.relax_disp.variables import EXP_TYPE_CPMG_SQ


# Create a data pipe.
pipe.create('R2eff', 'relax_disp')

# Create the spin system.
spin.create(res_name='Asp', res_num=9, spin_name='N')
spin.element('N', spin_id='@N')
spin.isotope('15N', spin_id='@N')

# The spectral data - experiment ID, R2eff file name, experiment type, spin ID string, spectrometer frequency in Hertz, relaxation time.
data = [
    ['15N_CPMG_500_MHz', 'ns_500.res', EXP_TYPE_CPMG_SQ, ':9@N', 500e6, 0.04],
    ['15N_CPMG_600_MHz', 'ns_600.res', EXP_TYPE_CPMG_SQ, ':9@N', 600e6, 0.04],
    ['15N_CPMG_800_MHz', 'ns_800.res', EXP_TYPE_CPMG_SQ, ':9@N', 800e6, 0.04]
]
cpmg_frqs = [50.0, 100.0, 150.0, 200.0, 250.0, 300.0, 350.0, 400.0, 450.0, 500.0, 600.0, 700.0, 800.0, 900.0, 1000.0]

# Loop over the files, reading in the data.
for id, file, exp_type, spin_id, H_frq, relax_time in data:
    # Loop over each CPMG frequency.
    for cpmg_frq in cpmg_frqs:
        # The id.
        new_id = "%s_%s" % (id, cpmg_frq)

        # Set the NMR field strength.
        spectrometer.frequency(id=new_id, frq=H_frq)

        # Set the relaxation dispersion experiment type.
        relax_disp.exp_type(spectrum_id=new_id, exp_type=exp_type)

        # Relaxation dispersion CPMG constant time delay T (in s).
        relax_disp.relax_time(spectrum_id=new_id, time=relax_time)

    # Read the R2eff data.
    relax_disp.r2eff_read_spin(id=id, file=file, dir='..', spin_id=spin_id, disp_point_col=1, data_col=2, error_col=3)

# Change the model.
relax_disp.select_model('MMQ 2-site')

# The R20 keys.
r20_key1 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=500e6)
r20_key2 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=600e6)
r20_key3 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=800e6)

# Manually set the parameter values to the cpmg_fit results.
spin = cdp.mol[0].res[0].spin[0]
spin.r2 = {r20_key1: 8.400699, r20_key2: 8.847946, r20_key3: 10.289079}
spin.pA = 0.950701
spin.kex = 435.592
spin.dw = 4.356895
spin.chi2 = 17.49720

# Optimisation.
minimise(min_algor='simplex')

# Monte Carlo simulations.
monte_carlo.setup(number=3)
monte_carlo.create_data(method='back_calc')
monte_carlo.initial_values()
minimise(min_algor='simplex')
monte_carlo.error_analysis()

# Plot the dispersion curves.
relax_disp.plot_disp_curves(dir='disp_curves', force=True)

# Save the results.
state.save('state', dir='sq', compress_type=1, force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='R2eff', pipe_type='relax_disp', bundle=None)

relax> spin.create(spin_name='N', spin_num=None, res_name='Asp', res_num=9, mol_name=None)

relax> spin.element(element='N', spin_id='@N', force=False)

relax> spin.isotope(isotope='15N', spin_id='@N', force=False)

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_50.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_50.0', time=0.04)
Setting the '15N_CPMG_500_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_100.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_100.0', time=0.04)
Setting the '15N_CPMG_500_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_150.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_150.0', time=0.04)
Setting the '15N_CPMG_500_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_200.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_200.0', time=0.04)
Setting the '15N_CPMG_500_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_250.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_250.0', time=0.04)
Setting the '15N_CPMG_500_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_300.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_300.0', time=0.04)
Setting the '15N_CPMG_500_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_350.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_350.0', time=0.04)
Setting the '15N_CPMG_500_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_400.0', time=0.04)
Setting the '15N_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_450.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_450.0', time=0.04)
Setting the '15N_CPMG_500_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_500.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_500.0', time=0.04)
Setting the '15N_CPMG_500_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_600.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_600.0', time=0.04)
Setting the '15N_CPMG_500_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_700.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_700.0', time=0.04)
Setting the '15N_CPMG_500_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_800.0', time=0.04)
Setting the '15N_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_900.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_900.0', time=0.04)
Setting the '15N_CPMG_500_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_1000.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_1000.0', time=0.04)
Setting the '15N_CPMG_500_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_CPMG_500_MHz', spin_id=':9@N', file='ns_500.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../ns_500.res' for reading.
The spectrum ID '15N_CPMG_500_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_CPMG_500_MHz_50.0', '15N_CPMG_500_MHz_100.0', '15N_CPMG_500_MHz_150.0', '15N_CPMG_500_MHz_200.0', '15N_CPMG_500_MHz_250.0', '15N_CPMG_500_MHz_300.0', '15N_CPMG_500_MHz_350.0', '15N_CPMG_500_MHz_400.0', '15N_CPMG_500_MHz_500.0', '15N_CPMG_500_MHz_600.0', '15N_CPMG_500_MHz_700.0', '15N_CPMG_500_MHz_800.0', '15N_CPMG_500_MHz_900.0', '15N_CPMG_500_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      27.157670000000000       0.543150000000000    
 100.000000000000000      26.557810000000000       0.531160000000000    
 150.000000000000000      24.734620000000000       0.494690000000000    
 200.000000000000000      20.986170000000001       0.419720000000000    
 250.000000000000000      17.824420000000000       0.356490000000000    
 300.000000000000000      15.553520000000001       0.311070000000000    
 350.000000000000000      13.789580000000001       0.275790000000000    
 400.000000000000000      12.483340000000000       0.249670000000000    
 500.000000000000000      11.557240000000000       0.231140000000000    
 600.000000000000000      10.538740000000001       0.210770000000000    
 700.000000000000000      10.073950000000000       0.201480000000000    
 800.000000000000000       9.629519999999999       0.192590000000000    
 900.000000000000000       9.499940000000000       0.190000000000000    
1000.000000000000000       8.713500000000000       0.174270000000000    

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_50.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_50.0', time=0.04)
Setting the '15N_CPMG_600_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_100.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_100.0', time=0.04)
Setting the '15N_CPMG_600_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_150.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_150.0', time=0.04)
Setting the '15N_CPMG_600_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_200.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_200.0', time=0.04)
Setting the '15N_CPMG_600_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_250.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_250.0', time=0.04)
Setting the '15N_CPMG_600_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_300.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_300.0', time=0.04)
Setting the '15N_CPMG_600_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_350.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_350.0', time=0.04)
Setting the '15N_CPMG_600_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_400.0', time=0.04)
Setting the '15N_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_450.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_450.0', time=0.04)
Setting the '15N_CPMG_600_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_500.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_500.0', time=0.04)
Setting the '15N_CPMG_600_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_600.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_600.0', time=0.04)
Setting the '15N_CPMG_600_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_700.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_700.0', time=0.04)
Setting the '15N_CPMG_600_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_800.0', time=0.04)
Setting the '15N_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_900.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_900.0', time=0.04)
Setting the '15N_CPMG_600_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_1000.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_1000.0', time=0.04)
Setting the '15N_CPMG_600_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_CPMG_600_MHz', spin_id=':9@N', file='ns_600.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../ns_600.res' for reading.
The spectrum ID '15N_CPMG_600_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_CPMG_600_MHz_50.0', '15N_CPMG_600_MHz_100.0', '15N_CPMG_600_MHz_150.0', '15N_CPMG_600_MHz_200.0', '15N_CPMG_600_MHz_250.0', '15N_CPMG_600_MHz_300.0', '15N_CPMG_600_MHz_350.0', '15N_CPMG_600_MHz_400.0', '15N_CPMG_600_MHz_500.0', '15N_CPMG_600_MHz_600.0', '15N_CPMG_600_MHz_800.0', '15N_CPMG_600_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      28.712740000000000       0.574250000000000    
 100.000000000000000      28.156870000000001       0.648350000000000    
 150.000000000000000      27.460400000000000       0.630540000000000    
 200.000000000000000      24.311219999999999       0.555910000000000    
 250.000000000000000      21.550129999999999       0.497780000000000    
 300.000000000000000      18.737749999999998       0.444820000000000    
 350.000000000000000      16.154080000000000       0.401140000000000    
 400.000000000000000      14.696420000000000       0.378420000000000    
 500.000000000000000      13.146250000000000       0.262930000000000    
 600.000000000000000      11.594429999999999       0.334260000000000    
 800.000000000000000      10.244870000000001       0.316700000000000    
1000.000000000000000       9.741450000000000       0.310380000000000    

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_50.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_50.0', time=0.04)
Setting the '15N_CPMG_800_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_100.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_100.0', time=0.04)
Setting the '15N_CPMG_800_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_150.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_150.0', time=0.04)
Setting the '15N_CPMG_800_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_200.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_200.0', time=0.04)
Setting the '15N_CPMG_800_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_250.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_250.0', time=0.04)
Setting the '15N_CPMG_800_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_300.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_300.0', time=0.04)
Setting the '15N_CPMG_800_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_350.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_350.0', time=0.04)
Setting the '15N_CPMG_800_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_400.0', time=0.04)
Setting the '15N_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_450.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_450.0', time=0.04)
Setting the '15N_CPMG_800_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_500.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_500.0', time=0.04)
Setting the '15N_CPMG_800_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_600.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_600.0', time=0.04)
Setting the '15N_CPMG_800_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_700.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_700.0', time=0.04)
Setting the '15N_CPMG_800_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_800.0', time=0.04)
Setting the '15N_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_900.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_900.0', time=0.04)
Setting the '15N_CPMG_800_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_1000.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_1000.0', time=0.04)
Setting the '15N_CPMG_800_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_CPMG_800_MHz', spin_id=':9@N', file='ns_800.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../ns_800.res' for reading.
The spectrum ID '15N_CPMG_800_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_450.0' CPMG frequency is set to 450.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_CPMG_800_MHz_50.0', '15N_CPMG_800_MHz_100.0', '15N_CPMG_800_MHz_150.0', '15N_CPMG_800_MHz_200.0', '15N_CPMG_800_MHz_250.0', '15N_CPMG_800_MHz_300.0', '15N_CPMG_800_MHz_350.0', '15N_CPMG_800_MHz_400.0', '15N_CPMG_800_MHz_450.0', '15N_CPMG_800_MHz_500.0', '15N_CPMG_800_MHz_600.0', '15N_CPMG_800_MHz_700.0', '15N_CPMG_800_MHz_800.0', '15N_CPMG_800_MHz_900.0', '15N_CPMG_800_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      30.671690000000002       0.613430000000000    
 100.000000000000000      30.627970000000001       0.612560000000000    
 150.000000000000000      29.828849999999999       0.596580000000000    
 200.000000000000000      29.389659999999999       0.587790000000000    
 250.000000000000000      27.570190000000000       0.551400000000000    
 300.000000000000000      24.543270000000000       0.490870000000000    
 350.000000000000000      22.107839999999999       0.442160000000000    
 400.000000000000000      20.068380000000001       0.401370000000000    
 450.000000000000000      18.443570000000001       0.368870000000000    
 500.000000000000000      17.131820000000001       0.342640000000000    
 600.000000000000000      15.412590000000000       0.308250000000000    
 700.000000000000000      13.930770000000001       0.278620000000000    
 800.000000000000000      13.458140000000000       0.269160000000000    
 900.000000000000000      12.694400000000000       0.253890000000000    
1000.000000000000000      12.142960000000000       0.242860000000000    

relax> relax_disp.select_model(model='MMQ 2-site')
The reduced numerical solution for the 2-site Bloch-McConnell equations for MQ CPMG data using 3D magnetisation vectors, whereby the simplification R20A = R20B is assumed.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':9@N']
----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [      0.8400699,       0.8847946,       1.0289079,        4.356895,               0,        0.950701,       0.0435592]    fk: 18.9602051799       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [      0.8400699,       0.8847946,       1.0289079,        4.356895,               0,        0.950701,       0.0435592]    fk: 18.8908480579       
	k: 100      xk: [    0.833423957,    0.8756699767,     1.021929365,     4.356740146, 0.0001785630266,    0.9503103081,    0.0433176863]    fk: 17.3158193955       
	k: 200      xk: [   0.8334239996,    0.8756697311,     1.021929958,     4.356738445, 0.0001785542029,    0.9503103525,   0.04331773055]    fk: 17.3132244996       
	k: 300      xk: [   0.8334239983,    0.8756697315,     1.021929953,     4.356738446, 0.0001785542519,    0.9503103522,   0.04331773056]    fk: 17.3132244985       
	k: 400      xk: [   0.8334239987,    0.8756697309,     1.021929953,      4.35673846, 0.0001785542387,    0.9503103522,   0.04331773056]    fk: 17.3132244985       

	Parameter values: [0.83342399858672989, 0.87566973087923627, 1.0219299532510291, 4.3567384595002405, 0.00017855423987993166, 0.9503103521744436, 0.04331773055714408]
	Function value:   17.31322449847784
	Iterations:       477
	Function calls:   968
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [   0.8334239986,    0.8756697309,     1.021929953,      4.35673846, 0.0001785542399,    0.9503103522,   0.04331773056]    fk: 17.3823570773       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8334239986,    0.8756697309,     1.021929953,      4.35673846, 0.0001785542399,    0.9503103522,   0.04331773056]    fk: 17.3816657516       
	k: 100      xk: [   0.8334239986,    0.8756697309,     1.021929953,      4.35673846, 0.0001785542399,    0.9503103522,   0.04331773056]    fk: 17.3816657516       
	k: 200      xk: [   0.8334239986,    0.8756697309,     1.021929953,     4.356738459, 0.0001785542405,    0.9503103522,   0.04331773056]    fk: 17.3816657516       
	k: 300      xk: [   0.8334240069,    0.8756696954,     1.021929927,     4.356738429,  0.000178554222,    0.9503103516,   0.04331773074]    fk: 17.3816657497       
	k: 400      xk: [   0.8334240071,    0.8756696943,     1.021929926,     4.356738428, 0.0001785542214,    0.9503103516,   0.04331773074]    fk: 17.3816657496       

	Parameter values: [0.83342400712573161, 0.87566969427269248, 1.0219299257744683, 4.3567384278905195, 0.00017855422139609198, 0.95031035161433453, 0.043317730744435873]
	Function value:   17.381665749619785
	Iterations:       428
	Function calls:   938
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [   0.8334240071,    0.8756696943,     1.021929926,     4.356738428, 0.0001785542214,    0.9503103516,   0.04331773074]    fk: 17.3823570754       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8334240071,    0.8756696943,     1.021929926,     4.356738428, 0.0001785542214,    0.9503103516,   0.04331773074]    fk: 17.3823501621       
	k: 100      xk: [   0.8334240071,    0.8756696943,     1.021929926,     4.356738428, 0.0001785542214,    0.9503103516,   0.04331773074]    fk: 17.3823501621       
	k: 200      xk: [   0.8334240036,    0.8756696936,     1.021929923,     4.356738428, 0.0001785544138,    0.9503103514,    0.0433177306]    fk: 17.3823501613       
	k: 300      xk: [   0.8334240036,    0.8756696936,     1.021929923,     4.356738428, 0.0001785544017,    0.9503103514,    0.0433177306]    fk: 17.3823501613       

	Parameter values: [0.83342400364988212, 0.87566969357858393, 1.0219299231651107, 4.3567384278904955, 0.00017855440168388335, 0.95031035136544784, 0.043317730602553429]
	Function value:   17.382350161286166
	Iterations:       315
	Function calls:   709
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [   0.8334240036,    0.8756696936,     1.021929923,     4.356738428, 0.0001785544017,    0.9503103514,    0.0433177306]    fk: 17.3823570745       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8334240036,    0.8756696936,     1.021929923,     4.356738428, 0.0001785544017,    0.9503103514,    0.0433177306]    fk: 17.3823570054       
	k: 100      xk: [   0.8334240036,    0.8756696936,     1.021929923,     4.356738428, 0.0001785544017,    0.9503103514,    0.0433177306]    fk: 17.3823570054       
	k: 200      xk: [   0.8334239965,    0.8756696726,     1.021929925,     4.356738436, 0.0001785542789,    0.9503103513,    0.0433177306]    fk: 17.3823570053       
	k: 300      xk: [   0.8334239753,    0.8756696103,     1.021929929,     4.356738459, 0.0001785539365,    0.9503103512,    0.0433177306]    fk: 17.382357005        

	Parameter values: [0.83342397444938188, 0.87566960785457204, 1.0219299291541839, 4.3567384598227452, 0.00017855394620126935, 0.95031035123314322, 0.043317730602307591]
	Function value:   17.382357004954006
	Iterations:       400
	Function calls:   853
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.8334239744,    0.8756696079,     1.021929929,      4.35673846, 0.0001785539462,    0.9503103512,    0.0433177306]    fk: 17.3823570741       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8334239744,    0.8756696079,     1.021929929,      4.35673846, 0.0001785539462,    0.9503103512,    0.0433177306]    fk: 17.3823570734       
	k: 100      xk: [   0.8334239744,    0.8756696079,     1.021929929,      4.35673846, 0.0001785539462,    0.9503103512,    0.0433177306]    fk: 17.3823570734       
	k: 200      xk: [   0.8334239721,    0.8756696045,     1.021929925,     4.356738452, 0.0001785539266,     0.950310351,   0.04331773074]    fk: 17.3823570725       
	k: 300      xk: [   0.8334239722,    0.8756696039,     1.021929924,     4.356738451, 0.0001785537403,    0.9503103509,   0.04331773063]    fk: 17.3823570721       
	k: 400      xk: [   0.8334239721,    0.8756696038,     1.021929924,     4.356738451, 0.0001785537253,    0.9503103508,   0.04331773063]    fk: 17.3823570721       

	Parameter values: [0.83342397208957308, 0.87566960380046566, 1.0219299238160517, 4.3567384510863469, 0.00017855372526454576, 0.95031035084970095, 0.043317730625358611]
	Function value:   17.382357072069965
	Iterations:       487
	Function calls:   1055
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.8334239721,    0.8756696038,     1.021929924,     4.356738451, 0.0001785537253,    0.9503103508,   0.04331773063]    fk: 17.3823570728       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8334239721,    0.8756696038,     1.021929924,     4.356738451, 0.0001785537253,    0.9503103508,   0.04331773063]    fk: 17.3823570728       
	k: 100      xk: [   0.8334239721,    0.8756696038,     1.021929924,     4.356738451, 0.0001785537253,    0.9503103508,   0.04331773063]    fk: 17.3823570728       
	k: 200      xk: [   0.8334239219,    0.8756696234,     1.021929891,     4.356738429, 0.0001785564913,    0.9503103487,    0.0433177296]    fk: 17.3823461081       
	k: 300      xk: [   0.8334239208,    0.8756696252,     1.021929888,     4.356738428,  0.000178556287,    0.9503103486,   0.04331772959]    fk: 17.3823461079       

	Parameter values: [0.83342392072401594, 0.87566962516796243, 1.0219298880906909, 4.3567384278934256, 0.00017855627049132125, 0.95031034862849495, 0.043317729593313634]
	Function value:   17.382346107926683
	Iterations:       397
	Function calls:   828
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [   0.8334239207,    0.8756696252,     1.021929888,     4.356738428, 0.0001785562705,    0.9503103486,   0.04331772959]    fk: 17.3823461079       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8334239207,    0.8756696252,     1.021929888,     4.356738428, 0.0001785562705,    0.9503103486,   0.04331772959]    fk: 17.3823461079       
	k: 100      xk: [   0.8334232907,    0.8756773545,     1.021932031,     4.356737221, 0.0001786689453,    0.9503101745,   0.04331763249]    fk: 17.3746802714       
	k: 200      xk: [   0.8334232029,    0.8756773667,     1.021932034,     4.356737228, 0.0001786688142,    0.9503101722,   0.04331763243]    fk: 17.3746802409       
	k: 300      xk: [    0.833423233,    0.8756773995,     1.021932049,     4.356737158, 0.0001786676137,    0.9503101721,   0.04331763239]    fk: 17.3746058287       
	k: 400      xk: [    0.833423233,    0.8756773998,     1.021932049,     4.356737158, 0.0001786675746,    0.9503101721,   0.04331763239]    fk: 17.3746058287       

	Parameter values: [0.83342323301954235, 0.87567739979643611, 1.0219320492076749, 4.3567371579343934, 0.00017866757457306908, 0.95031017211545576, 0.043317632389125768]
	Function value:   17.374605828728967
	Iterations:       403
	Function calls:   972
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    0.833423233,    0.8756773998,     1.021932049,     4.356737158, 0.0001786675746,    0.9503101721,   0.04331763239]    fk: 17.3746058287       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.833423233,    0.8756773998,     1.021932049,     4.356737158, 0.0001786675746,    0.9503101721,   0.04331763239]    fk: 17.3746058287       
	k: 100      xk: [    0.833423233,    0.8756773998,     1.021932049,     4.356737158, 0.0001786675746,    0.9503101721,   0.04331763239]    fk: 17.3746058287       
	k: 200      xk: [    0.833423233,    0.8756773998,     1.021932049,     4.356737158, 0.0001786675746,    0.9503101721,   0.04331763239]    fk: 17.3746058287       

	Parameter values: [0.833423233032619, 0.87567739978799675, 1.0219320492033057, 4.3567371578896363, 0.00017866811982408923, 0.95031017211538682, 0.043317632389082983]
	Function value:   17.374605828728914
	Iterations:       268
	Function calls:   638
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [    0.833423233,    0.8756773998,     1.021932049,     4.356737158, 0.0001786681198,    0.9503101721,   0.04331763239]    fk: 17.3746058287       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.833423233,    0.8756773998,     1.021932049,     4.356737158, 0.0001786681198,    0.9503101721,   0.04331763239]    fk: 17.3746058287       
	k: 100      xk: [    0.833423233,    0.8756773998,     1.021932049,     4.356737158, 0.0001786681198,    0.9503101721,   0.04331763239]    fk: 17.3746058287       
	k: 200      xk: [    0.833423233,    0.8756773998,     1.021932049,     4.356737158, 0.0001786681198,    0.9503101721,   0.04331763239]    fk: 17.3746058287       

	Parameter values: [0.833423233032619, 0.87567739978799675, 1.0219320492033057, 4.3567371578896363, 0.00017866811982408923, 0.95031017211538682, 0.043317632389082983]
	Function value:   17.374605828728914
	Iterations:       267
	Function calls:   646
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.833423233032619, 0.87567739978799675, 1.0219320492033057, 4.3567371578896363, 0.00017866811982408923, 0.95031017211538682, 0.043317632389082983]
Function value:   17.374605828728914
Iterations:       3442
Function calls:   7607
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (SQ CPMG - 500.00000000 MHz)         8.334232330326190
r2 (SQ CPMG - 600.00000000 MHz)         8.756773997879968
r2 (SQ CPMG - 800.00000000 MHz)        10.219320492033058
dw                           4.356737157889636
dwH                          0.000178668119824
pA                           0.950310172115387
kex                        433.176323890829849

relax> monte_carlo.setup(number=3)

relax> monte_carlo.create_data(method='back_calc')
Traceback (most recent call last):
  File "/data/relax/branches/relax_disp/multi/processor.py", line 494, in run
    self.callback.init_master(self)
  File "/data/relax/branches/relax_disp/multi/__init__.py", line 318, in default_init_master
    self.master.run()
  File "/data/relax/branches/relax_disp/relax.py", line 193, in run
    self.interpreter.run(self.script_file)
  File "/data/relax/branches/relax_disp/prompt/interpreter.py", line 278, in run
    return run_script(intro=self.__intro_string, local=locals(), script_file=script_file, quit=self.__quit_flag, show_script=self.__show_script, raise_relax_error=self.__raise_relax_error)
  File "/data/relax/branches/relax_disp/prompt/interpreter.py", line 576, in run_script
    return console.interact(intro, local, script_file, quit, show_script=show_script, raise_relax_error=raise_relax_error)
  File "/data/relax/branches/relax_disp/prompt/interpreter.py", line 468, in interact_script
    exec_script(script_file, local)
  File "/data/relax/branches/relax_disp/prompt/interpreter.py", line 341, in exec_script
    runpy.run_module(module, globals)
  File "/usr/lib64/python2.7/runpy.py", line 180, in run_module
    fname, loader, pkg_name)
  File "/usr/lib64/python2.7/runpy.py", line 72, in _run_code
    exec code in run_globals
  File "/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Korzhnev_et_al_2005/relax_results/15N_SQ_CPMG.py", line 69, in <module>
    monte_carlo.create_data(method='back_calc')
  File "/data/relax/branches/relax_disp/prompt/uf_objects.py", line 221, in __call__
    self._backend(*new_args, **uf_kargs)
  File "/data/relax/branches/relax_disp/pipe_control/monte_carlo.py", line 67, in create_data
    data = create_mc_data(data_index)
  File "/data/relax/branches/relax_disp/specific_analyses/relax_disp/api.py", line 773, in create_mc_data
    values = self._back_calc_r2eff(spin=spin, spin_id=spin_id)
  File "/data/relax/branches/relax_disp/specific_analyses/relax_disp/api.py", line 169, in _back_calc_r2eff
    results[param_key] = model.back_calc[0][frq_index][point_index]
IndexError: list index out of range
