


                                  relax repository checkout r21506
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'optimise.py'
----------------------------------------------------------------------------------------------------
"""Optimise the SQ data in relax.

To run this, type:

$ rm -f optimise.log; ../../../../../../relax --tee optimise.log optimise.py
"""

# relax module imports.
from specific_analyses.relax_disp.disp_data import generate_r20_key
from specific_analyses.relax_disp.variables import EXP_TYPE_CPMG_DQ, EXP_TYPE_CPMG_MQ, EXP_TYPE_CPMG_PROTON_MQ, EXP_TYPE_CPMG_PROTON_SQ, EXP_TYPE_CPMG_SQ, EXP_TYPE_CPMG_ZQ


# Create a data pipe.
pipe.create('R2eff', 'relax_disp')

# Create the spin system.
spin.create(res_name='Asp', res_num=9, spin_name='N')
spin.element('N', spin_id='@N')
spin.isotope('15N', spin_id='@N')

# The spectral data - experiment ID, R2eff file name, experiment type, spin ID string, spectrometer frequency in Hertz, relaxation time.
data = [
    ['15N_CPMG_500_MHz', 'ns_500.res', EXP_TYPE_CPMG_SQ, ':9@N', 500e6, 0.04],
    ['15N_CPMG_600_MHz', 'ns_600.res', EXP_TYPE_CPMG_SQ, ':9@N', 600e6, 0.04],
    ['15N_CPMG_800_MHz', 'ns_800.res', EXP_TYPE_CPMG_SQ, ':9@N', 800e6, 0.04]
]
cpmg_frqs = [50.0, 100.0, 150.0, 200.0, 250.0, 300.0, 350.0, 400.0, 450.0, 500.0, 600.0, 700.0, 800.0, 900.0, 1000.0]

# Loop over the files, reading in the data.
for id, file, exp_type, spin_id, H_frq, relax_time in data:
    # Loop over each CPMG frequency.
    for cpmg_frq in cpmg_frqs:
        # The id.
        new_id = "%s_%s" % (id, cpmg_frq)

        # Set the NMR field strength.
        spectrometer.frequency(id=new_id, frq=H_frq)

        # Set the relaxation dispersion experiment type.
        relax_disp.exp_type(spectrum_id=new_id, exp_type=exp_type)

        # Relaxation dispersion CPMG constant time delay T (in s).
        relax_disp.relax_time(spectrum_id=new_id, time=relax_time)

    # Read the R2eff data.
    relax_disp.r2eff_read_spin(id=id, file=file, dir='../..', spin_id=spin_id, disp_point_col=1, data_col=2, error_col=3)

# Change the model.
relax_disp.select_model('MMQ 2-site')

# The R20 keys.
r20_key_sq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=500e6)
r20_key_sq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=600e6)
r20_key_sq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=800e6)
r20_key_1h_sq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=500e6)
r20_key_1h_sq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=600e6)
r20_key_1h_sq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=800e6)
r20_key_zq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=500e6)
r20_key_zq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=600e6)
r20_key_zq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=800e6)
r20_key_dq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=500e6)
r20_key_dq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=600e6)
r20_key_dq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=800e6)
r20_key_mq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=500e6)
r20_key_mq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=600e6)
r20_key_mq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=800e6)
r20_key_1h_mq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=500e6)
r20_key_1h_mq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=600e6)
r20_key_1h_mq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=800e6)

# Manually set the parameter values to the cpmg_fit results for all data.
spin = cdp.mol[0].res[0].spin[0]
spin.r2 = {
    r20_key_sq_500: 9.065070,
    r20_key_sq_600: 10.160889,
    r20_key_sq_800: 11.790803,
    r20_key_1h_sq_500: 7.096502,
    r20_key_1h_sq_600: 7.558959,
    r20_key_1h_sq_800: 6.060312,
    r20_key_zq_500: 0.284809,
    r20_key_zq_600: 0.000170,
    r20_key_zq_800: -0.000104,
    r20_key_dq_500: 14.809871,
    r20_key_dq_600: 18.534790,
    r20_key_dq_800: 21.503204,
    r20_key_mq_500: 12.841165,
    r20_key_mq_600: 14.078760,
    r20_key_mq_800: 16.837882,
    r20_key_1h_mq_500: 12.527122,
    r20_key_1h_mq_600: 13.516082,
    r20_key_1h_mq_800: 16.722821
}
spin.pA = 0.933134
spin.kex = 211.105
spin.dw = 5.098428
spin.dwH = 0.298763

# Optimisation.
minimise(min_algor='simplex')

# Monte Carlo simulations.
monte_carlo.setup(number=3)
monte_carlo.create_data(method='back_calc')
monte_carlo.initial_values()
minimise(min_algor='simplex', max_iter=100)
monte_carlo.error_analysis()

# Plot the dispersion curves.
relax_disp.plot_disp_curves(dir='.', force=True)

# Save the results.
state.save('state', compress_type=1, force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='R2eff', pipe_type='relax_disp', bundle=None)

relax> spin.create(spin_name='N', spin_num=None, res_name='Asp', res_num=9, mol_name=None)

relax> spin.element(element='N', spin_id='@N', force=False)

relax> spin.isotope(isotope='15N', spin_id='@N', force=False)

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_50.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_50.0', time=0.04)
Setting the '15N_CPMG_500_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_100.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_100.0', time=0.04)
Setting the '15N_CPMG_500_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_150.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_150.0', time=0.04)
Setting the '15N_CPMG_500_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_200.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_200.0', time=0.04)
Setting the '15N_CPMG_500_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_250.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_250.0', time=0.04)
Setting the '15N_CPMG_500_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_300.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_300.0', time=0.04)
Setting the '15N_CPMG_500_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_350.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_350.0', time=0.04)
Setting the '15N_CPMG_500_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_400.0', time=0.04)
Setting the '15N_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_450.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_450.0', time=0.04)
Setting the '15N_CPMG_500_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_500.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_500.0', time=0.04)
Setting the '15N_CPMG_500_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_600.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_600.0', time=0.04)
Setting the '15N_CPMG_500_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_700.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_700.0', time=0.04)
Setting the '15N_CPMG_500_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_800.0', time=0.04)
Setting the '15N_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_900.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_900.0', time=0.04)
Setting the '15N_CPMG_500_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_1000.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_1000.0', time=0.04)
Setting the '15N_CPMG_500_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_CPMG_500_MHz', spin_id=':9@N', file='ns_500.res', dir='../..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../../ns_500.res' for reading.
The spectrum ID '15N_CPMG_500_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_CPMG_500_MHz_50.0', '15N_CPMG_500_MHz_100.0', '15N_CPMG_500_MHz_150.0', '15N_CPMG_500_MHz_200.0', '15N_CPMG_500_MHz_250.0', '15N_CPMG_500_MHz_300.0', '15N_CPMG_500_MHz_350.0', '15N_CPMG_500_MHz_400.0', '15N_CPMG_500_MHz_500.0', '15N_CPMG_500_MHz_600.0', '15N_CPMG_500_MHz_700.0', '15N_CPMG_500_MHz_800.0', '15N_CPMG_500_MHz_900.0', '15N_CPMG_500_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      27.157670000000000       0.543150000000000    
 100.000000000000000      26.557810000000000       0.531160000000000    
 150.000000000000000      24.734620000000000       0.494690000000000    
 200.000000000000000      20.986170000000001       0.419720000000000    
 250.000000000000000      17.824420000000000       0.356490000000000    
 300.000000000000000      15.553520000000001       0.311070000000000    
 350.000000000000000      13.789580000000001       0.275790000000000    
 400.000000000000000      12.483340000000000       0.249670000000000    
 500.000000000000000      11.557240000000000       0.231140000000000    
 600.000000000000000      10.538740000000001       0.210770000000000    
 700.000000000000000      10.073950000000000       0.201480000000000    
 800.000000000000000       9.629519999999999       0.192590000000000    
 900.000000000000000       9.499940000000000       0.190000000000000    
1000.000000000000000       8.713500000000000       0.174270000000000    

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_50.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_50.0', time=0.04)
Setting the '15N_CPMG_600_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_100.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_100.0', time=0.04)
Setting the '15N_CPMG_600_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_150.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_150.0', time=0.04)
Setting the '15N_CPMG_600_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_200.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_200.0', time=0.04)
Setting the '15N_CPMG_600_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_250.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_250.0', time=0.04)
Setting the '15N_CPMG_600_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_300.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_300.0', time=0.04)
Setting the '15N_CPMG_600_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_350.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_350.0', time=0.04)
Setting the '15N_CPMG_600_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_400.0', time=0.04)
Setting the '15N_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_450.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_450.0', time=0.04)
Setting the '15N_CPMG_600_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_500.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_500.0', time=0.04)
Setting the '15N_CPMG_600_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_600.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_600.0', time=0.04)
Setting the '15N_CPMG_600_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_700.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_700.0', time=0.04)
Setting the '15N_CPMG_600_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_800.0', time=0.04)
Setting the '15N_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_900.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_900.0', time=0.04)
Setting the '15N_CPMG_600_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_1000.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_1000.0', time=0.04)
Setting the '15N_CPMG_600_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_CPMG_600_MHz', spin_id=':9@N', file='ns_600.res', dir='../..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../../ns_600.res' for reading.
The spectrum ID '15N_CPMG_600_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_CPMG_600_MHz_50.0', '15N_CPMG_600_MHz_100.0', '15N_CPMG_600_MHz_150.0', '15N_CPMG_600_MHz_200.0', '15N_CPMG_600_MHz_250.0', '15N_CPMG_600_MHz_300.0', '15N_CPMG_600_MHz_350.0', '15N_CPMG_600_MHz_400.0', '15N_CPMG_600_MHz_500.0', '15N_CPMG_600_MHz_600.0', '15N_CPMG_600_MHz_800.0', '15N_CPMG_600_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      28.712740000000000       0.574250000000000    
 100.000000000000000      28.156870000000001       0.648350000000000    
 150.000000000000000      27.460400000000000       0.630540000000000    
 200.000000000000000      24.311219999999999       0.555910000000000    
 250.000000000000000      21.550129999999999       0.497780000000000    
 300.000000000000000      18.737749999999998       0.444820000000000    
 350.000000000000000      16.154080000000000       0.401140000000000    
 400.000000000000000      14.696420000000000       0.378420000000000    
 500.000000000000000      13.146250000000000       0.262930000000000    
 600.000000000000000      11.594429999999999       0.334260000000000    
 800.000000000000000      10.244870000000001       0.316700000000000    
1000.000000000000000       9.741450000000000       0.310380000000000    

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_50.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_50.0', time=0.04)
Setting the '15N_CPMG_800_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_100.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_100.0', time=0.04)
Setting the '15N_CPMG_800_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_150.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_150.0', time=0.04)
Setting the '15N_CPMG_800_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_200.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_200.0', time=0.04)
Setting the '15N_CPMG_800_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_250.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_250.0', time=0.04)
Setting the '15N_CPMG_800_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_300.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_300.0', time=0.04)
Setting the '15N_CPMG_800_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_350.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_350.0', time=0.04)
Setting the '15N_CPMG_800_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_400.0', time=0.04)
Setting the '15N_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_450.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_450.0', time=0.04)
Setting the '15N_CPMG_800_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_500.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_500.0', time=0.04)
Setting the '15N_CPMG_800_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_600.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_600.0', time=0.04)
Setting the '15N_CPMG_800_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_700.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_700.0', time=0.04)
Setting the '15N_CPMG_800_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_800.0', time=0.04)
Setting the '15N_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_900.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_900.0', time=0.04)
Setting the '15N_CPMG_800_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_1000.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_1000.0', time=0.04)
Setting the '15N_CPMG_800_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_CPMG_800_MHz', spin_id=':9@N', file='ns_800.res', dir='../..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../../ns_800.res' for reading.
The spectrum ID '15N_CPMG_800_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_450.0' CPMG frequency is set to 450.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_CPMG_800_MHz_50.0', '15N_CPMG_800_MHz_100.0', '15N_CPMG_800_MHz_150.0', '15N_CPMG_800_MHz_200.0', '15N_CPMG_800_MHz_250.0', '15N_CPMG_800_MHz_300.0', '15N_CPMG_800_MHz_350.0', '15N_CPMG_800_MHz_400.0', '15N_CPMG_800_MHz_450.0', '15N_CPMG_800_MHz_500.0', '15N_CPMG_800_MHz_600.0', '15N_CPMG_800_MHz_700.0', '15N_CPMG_800_MHz_800.0', '15N_CPMG_800_MHz_900.0', '15N_CPMG_800_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      30.671690000000002       0.613430000000000    
 100.000000000000000      30.627970000000001       0.612560000000000    
 150.000000000000000      29.828849999999999       0.596580000000000    
 200.000000000000000      29.389659999999999       0.587790000000000    
 250.000000000000000      27.570190000000000       0.551400000000000    
 300.000000000000000      24.543270000000000       0.490870000000000    
 350.000000000000000      22.107839999999999       0.442160000000000    
 400.000000000000000      20.068380000000001       0.401370000000000    
 450.000000000000000      18.443570000000001       0.368870000000000    
 500.000000000000000      17.131820000000001       0.342640000000000    
 600.000000000000000      15.412590000000000       0.308250000000000    
 700.000000000000000      13.930770000000001       0.278620000000000    
 800.000000000000000      13.458140000000000       0.269160000000000    
 900.000000000000000      12.694400000000000       0.253890000000000    
1000.000000000000000      12.142960000000000       0.242860000000000    

relax> relax_disp.select_model(model='MMQ 2-site')
The reduced numerical solution for the 2-site Bloch-McConnell equations for MQ CPMG data using 3D magnetisation vectors, whereby the simplification R20A = R20B is assumed.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':9@N']
----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [       0.906507,       1.0160889,       1.1790803,        5.098428,        0.298763,        0.933134,       0.0211105]    fk: 778.173746744       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [       0.906507,       1.0160889,       1.1790803,        5.098428,        0.298763,        0.933134,     0.022166025]    fk: 641.418653167       
	k: 100      xk: [   0.8369740578,     0.883149462,      1.04035621,     4.523350298,    0.3272144515,    0.9225827262,   0.02591355063]    fk: 23.463841972        
	k: 200      xk: [   0.8363167778,     0.885733594,     1.041571034,     4.521797883,    0.3269330627,     0.922734789,   0.02596447593]    fk: 23.3676790468       
	k: 300      xk: [   0.8363168538,     0.885733747,     1.041571215,     4.521797885,    0.3269330486,    0.9227347943,   0.02596447563]    fk: 23.3676789956       
	k: 400      xk: [   0.8363168577,    0.8857337515,     1.041571221,     4.521797881,    0.3269330471,    0.9227347947,   0.02596447569]    fk: 23.3676789924       

	Parameter values: [0.83631686114255532, 0.88573375545083088, 1.0415712245449997, 4.5217978814896487, 0.32693304547280333, 0.92273479505196931, 0.025964475777153172]
	Function value:   23.367678988746889
	Iterations:       500
	Function calls:   918
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.8363168611,    0.8857337555,     1.041571225,     4.521797881,    0.3269330455,    0.9227347951,   0.02596447578]    fk: 23.4357988297       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8363168611,    0.8857337555,     1.041571225,     4.521797881,    0.3269330455,    0.9227347951,   0.02596447578]    fk: 23.4351176313       
	k: 100      xk: [   0.8399092109,    0.8842052491,     1.039670021,     4.464659497,   -0.2867966207,    0.9329892411,   0.03025078684]    fk: 21.5571557893       
	k: 200      xk: [    0.834834843,     0.880820237,     1.028905178,     4.442298464,    -1.632297386,     0.939610947,   0.03421201629]    fk: 19.4700530956       
	k: 300      xk: [   0.8337617998,    0.8755595922,      1.02686733,     4.389921462,    -4.264971035,    0.9469118281,   0.03987555713]    fk: 17.7055342772       
	k: 400      xk: [   0.8331829849,    0.8762690839,      1.02203145,     4.364353917,    -5.728373896,    0.9495764555,   0.04251875605]    fk: 17.3997536431       

	Parameter values: [0.83318324854209402, 0.87626919274583015, 1.022031573598019, 4.3643533979883493, -5.7283617118788257, 0.9495764388004333, 0.042518738721545074]
	Function value:   17.397403701645676
	Iterations:       500
	Function calls:   873
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.8331832485,    0.8762691927,     1.022031574,     4.364353398,    -5.728361712,    0.9495764388,   0.04251873872]    fk: 17.3980945164       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8331832485,    0.8762691927,     1.022031574,     4.364353398,    -5.728361712,    0.9495764388,   0.04251873872]    fk: 17.3980876081       
	k: 100      xk: [   0.8337865927,    0.8770974059,     1.023867036,     4.359552987,    -5.851541213,    0.9497490489,   0.04270777929]    fk: 17.3964316871       
	k: 200      xk: [   0.8337866361,    0.8770974145,     1.023866815,     4.359553421,    -5.851551879,    0.9497490479,   0.04270778029]    fk: 17.3962184059       
	k: 300      xk: [   0.8337866369,    0.8770974148,     1.023866814,     4.359553415,    -5.851551897,    0.9497490478,   0.04270778027]    fk: 17.3962184016       

	Parameter values: [0.83378663690147503, 0.8770974148427042, 1.0238668143416259, 4.3595534153214555, -5.8515518981241623, 0.94974904780366143, 0.042707780266890955]
	Function value:   17.39621840155786
	Iterations:       393
	Function calls:   814
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [   0.8337866369,    0.8770974148,     1.023866814,     4.359553415,    -5.851551898,    0.9497490478,   0.04270778027]    fk: 17.3962253144       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337866369,    0.8770974148,     1.023866814,     4.359553415,    -5.851551898,    0.9497490478,   0.04270778027]    fk: 17.3962252453       
	k: 100      xk: [   0.8337085381,    0.8768103321,     1.023255121,     4.359230893,    -6.002089952,    0.9497905454,   0.04275130575]    fk: 17.3885250874       
	k: 200      xk: [   0.8337086335,    0.8768100491,     1.023255192,     4.359230806,    -6.002155916,    0.9497905492,   0.04275130592]    fk: 17.3877956807       
	k: 300      xk: [   0.8337085682,    0.8768099095,     1.023255321,     4.359230782,    -6.002223863,    0.9497905472,   0.04275130638]    fk: 17.3877956427       
	k: 400      xk: [   0.8337085593,    0.8768098699,      1.02325532,     4.359230811,    -6.002231071,    0.9497905469,   0.04275130639]    fk: 17.3877956357       

	Parameter values: [0.8337085452678672, 0.87680989214572058, 1.0232553347381654, 4.3592308092045027, -6.0022356508694603, 0.94979054613067748, 0.042751306403726652]
	Function value:   17.387795621224544
	Iterations:       500
	Function calls:   936
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.8337085453,    0.8768098921,     1.023255335,     4.359230809,    -6.002235651,    0.9497905461,    0.0427513064]    fk: 17.387795693        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337085453,    0.8768098921,     1.023255335,     4.359230809,    -6.002235651,    0.9497905461,    0.0427513064]    fk: 17.3877956897       
	k: 100      xk: [   0.8337085453,    0.8768098921,     1.023255335,     4.359230809,    -6.002235651,    0.9497905461,    0.0427513064]    fk: 17.3877956897       
	k: 200      xk: [   0.8337085444,    0.8768098937,     1.023255335,     4.359230811,    -6.002238246,     0.949790546,   0.04275130622]    fk: 17.3877956871       
	k: 300      xk: [   0.8337085456,     0.876809896,     1.023255335,     4.359230811,    -6.002241878,     0.949790546,   0.04275130622]    fk: 17.387795687        
	k: 400      xk: [   0.8337085315,    0.8768098697,     1.023255336,     4.359230811,    -6.002500604,    0.9497905459,   0.04275130637]    fk: 17.3877956846       

	Parameter values: [0.83370853141981982, 0.8768098698324136, 1.0232553363122783, 4.359230811034152, -6.0025009226299959, 0.9497905458640501, 0.04275130636504864]
	Function value:   17.387795684532801
	Iterations:       500
	Function calls:   976
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 5        xk: [   0.8337085314,    0.8768098698,     1.023255336,     4.359230811,    -6.002500923,    0.9497905459,   0.04275130637]    fk: 17.3877956852       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337085314,    0.8768098698,     1.023255336,     4.359230811,    -6.002500923,    0.9497905459,   0.04275130637]    fk: 17.3877956852       
	k: 100      xk: [   0.8337085314,    0.8768098698,     1.023255336,     4.359230811,    -6.002500923,    0.9497905459,   0.04275130637]    fk: 17.3877956852       
	k: 200      xk: [   0.8337085275,    0.8768098623,     1.023255327,      4.35923085,    -6.002517629,    0.9497905453,   0.04275130629]    fk: 17.3877649057       
	k: 300      xk: [   0.8337085126,     0.876809848,     1.023255314,     4.359230907,    -6.002530004,     0.949790545,   0.04275130632]    fk: 17.3877649          
	k: 400      xk: [   0.8337085126,    0.8768098479,     1.023255314,     4.359230907,    -6.002530156,     0.949790545,   0.04275130632]    fk: 17.3877649          

	Parameter values: [0.8337085126112137, 0.8768098478524059, 1.0232553136099103, 4.359230906836089, -6.0025301562232087, 0.94979054499620974, 0.042751306317713914]
	Function value:   17.387764899961873
	Iterations:       457
	Function calls:   973
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.8337085126,    0.8768098479,     1.023255314,     4.359230907,    -6.002530156,     0.949790545,   0.04275130632]    fk: 17.3877649          
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337085126,    0.8768098479,     1.023255314,     4.359230907,    -6.002530156,     0.949790545,   0.04275130632]    fk: 17.3877649          
	k: 100      xk: [   0.8337085126,    0.8768098479,     1.023255314,     4.359230907,    -6.002530156,     0.949790545,   0.04275130632]    fk: 17.3877649          
	k: 200      xk: [   0.8337085126,    0.8768098478,     1.023255314,     4.359230907,    -6.002530162,     0.949790545,   0.04275130632]    fk: 17.3877649          

	Parameter values: [0.83370851261337675, 0.87680984783837557, 1.0232553136091047, 4.3592309068319333, -6.0025301617239624, 0.94979054499604476, 0.042751306317589867]
	Function value:   17.387764899965504
	Iterations:       211
	Function calls:   678
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.8337085126,    0.8768098478,     1.023255314,     4.359230907,    -6.002530162,     0.949790545,   0.04275130632]    fk: 17.3877649          
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337085126,    0.8768098478,     1.023255314,     4.359230907,    -6.002530162,     0.949790545,   0.04275130632]    fk: 17.3877649          
	k: 100      xk: [   0.8337085126,    0.8768098478,     1.023255314,     4.359230907,    -6.002530162,     0.949790545,   0.04275130632]    fk: 17.3877649          

	Parameter values: [0.83370851261347423, 0.87680984783830151, 1.0232553136091804, 4.3592309068316641, -6.002530162283076, 0.94979054499604154, 0.042751306317586862]
	Function value:   17.387764899965539
	Iterations:       197
	Function calls:   578
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [   0.8337085126,    0.8768098478,     1.023255314,     4.359230907,    -6.002530162,     0.949790545,   0.04275130632]    fk: 17.3877649          
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337085126,    0.8768098478,     1.023255314,     4.359230907,    -6.002530162,     0.949790545,   0.04275130632]    fk: 17.3877649          
	k: 100      xk: [   0.8337085126,    0.8768098478,     1.023255314,     4.359230907,    -6.002530162,     0.949790545,   0.04275130632]    fk: 17.3877649          

	Parameter values: [0.83370851261347423, 0.87680984783830151, 1.0232553136091804, 4.3592309068316641, -6.002530162283076, 0.94979054499604154, 0.042751306317586862]
	Function value:   17.387764899965539
	Iterations:       193
	Function calls:   571
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.83370851261347423, 0.87680984783830151, 1.0232553136091804, 4.3592309068316641, -6.002530162283076, 0.94979054499604154, 0.042751306317586862]
Function value:   17.387764899965539
Iterations:       3451
Function calls:   7317
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (SQ CPMG - 500.00000000 MHz)         8.337085126134742
r2 (SQ CPMG - 600.00000000 MHz)         8.768098478383015
r2 (SQ CPMG - 800.00000000 MHz)        10.232553136091804
dw                           4.359230906831664
dwH                         -6.002530162283076
pA                           0.949790544996042
kex                        427.513063175868638

relax> monte_carlo.setup(number=3)

relax> monte_carlo.create_data(method='back_calc')

relax> monte_carlo.initial_values()

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=100, constraints=True, scaling=True, verbosity=1)
Simulation 1, cluster [':9@N']
Simulation 2, cluster [':9@N']
Simulation 3, cluster [':9@N']

relax> monte_carlo.error_analysis()

relax> relax_disp.plot_disp_curves(dir='.', force=True)
Opening the file './disp_9_N.agr' for writing.
Opening the file './grace2images.py' for writing.

relax> state.save(state='state', dir=None, compress_type=1, force=True)
Opening the file 'state.bz2' for writing.

